; ModuleID = 'std::math::vector'
source_filename = "std::math::vector"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%Matrix4x4 = type { %.anon }
%.anon = type { %.anon.0 }
%.anon.0 = type { float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float }
%Matrix4x4.1 = type { %.anon.2 }
%.anon.2 = type { %.anon.3 }
%.anon.3 = type { double, double, double, double, double, double, double, double, double, double, double, double, double, double, double, double }
%Quaternion = type { <4 x float> }
%Quaternion.5 = type { <4 x double> }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$"std.math.vector.float[<3>].cross" = comdat any

$"std.math.vector.double[<3>].cross" = comdat any

$"std.math.vector.float[<3>].perpendicular" = comdat any

$"std.math.vector.double[<3>].perpendicular" = comdat any

$"std.math.vector.float[<3>].barycenter" = comdat any

$"std.math.vector.double[<3>].barycenter" = comdat any

$"std.math.vector.float[<3>].transform" = comdat any

$"std.math.vector.double[<3>].transform" = comdat any

$"std.math.vector.float[<3>].angle" = comdat any

$"std.math.vector.double[<3>].angle" = comdat any

$"std.math.vector.float[<3>].refract" = comdat any

$"std.math.vector.double[<3>].refract" = comdat any


!159 = !DILocalVariable(name: "self", arg: 1, scope: !156, file: !7, line: 33, type: !28)
!160 = !DILocation(line: 33, scope: !156)
!161 = !DILocalVariable(name: "a", arg: 2, scope: !156, file: !7, line: 33, type: !28)
!162 = !DILocalVariable(name: "b", arg: 3, scope: !156, file: !7, line: 33, type: !28)
!163 = !DILocalVariable(name: "c", arg: 4, scope: !156, file: !7, line: 33, type: !28)
!164 = !DILocalVariable(name: "v0", scope: !165, file: !7, line: 202, type: !28, align: 32)
!165 = distinct !DISubprogram(name: "barycenter3", linkageName: "barycenter3", scope: !7, file: !7, line: 200, scopeLine: 200, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !15)
!166 = !DILocation(line: 202, scope: !165, inlinedAt: !160)
!167 = !DILocalVariable(name: "v1", scope: !165, file: !7, line: 203, type: !28, align: 32)
!168 = !DILocation(line: 203, scope: !165, inlinedAt: !160)
!169 = !DILocalVariable(name: "v2", scope: !165, file: !7, line: 204, type: !28, align: 32)
!170 = !DILocation(line: 204, scope: !165, inlinedAt: !160)
!171 = !DILocalVariable(name: "d00", scope: !165, file: !7, line: 205, type: !29, align: 8)
!172 = !DILocation(line: 205, scope: !165, inlinedAt: !160)
!173 = !DILocation(line: 662, scope: !174, inlinedAt: !172)
!174 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !49, file: !49, line: 662, scopeLine: 662, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!175 = !DILocation(line: 647, scope: !176, inlinedAt: !173)
!176 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !49, file: !49, line: 647, scopeLine: 647, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!177 = !DILocalVariable(name: "d01", scope: !165, file: !7, line: 206, type: !29, align: 8)
!178 = !DILocation(line: 206, scope: !165, inlinedAt: !160)
!179 = !DILocation(line: 662, scope: !180, inlinedAt: !178)
!180 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !49, file: !49, line: 662, scopeLine: 662, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!181 = !DILocation(line: 647, scope: !182, inlinedAt: !179)
!182 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !49, file: !49, line: 647, scopeLine: 647, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!183 = !DILocalVariable(name: "d11", scope: !165, file: !7, line: 207, type: !29, align: 8)
!184 = !DILocation(line: 207, scope: !165, inlinedAt: !160)
!185 = !DILocation(line: 662, scope: !186, inlinedAt: !184)
!186 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !49, file: !49, line: 662, scopeLine: 662, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!187 = !DILocation(line: 647, scope: !188, inlinedAt: !185)
!188 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !49, file: !49, line: 647, scopeLine: 647, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!189 = !DILocalVariable(name: "d20", scope: !165, file: !7, line: 208, type: !29, align: 8)
!190 = !DILocation(line: 208, scope: !165, inlinedAt: !160)
!191 = !DILocation(line: 662, scope: !192, inlinedAt: !190)
!192 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !49, file: !49, line: 662, scopeLine: 662, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!193 = !DILocation(line: 647, scope: !194, inlinedAt: !191)
!194 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !49, file: !49, line: 647, scopeLine: 647, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!195 = !DILocalVariable(name: "d21", scope: !165, file: !7, line: 209, type: !29, align: 8)
!196 = !DILocation(line: 209, scope: !165, inlinedAt: !160)
!197 = !DILocation(line: 662, scope: !198, inlinedAt: !196)
!198 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !49, file: !49, line: 662, scopeLine: 662, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!199 = !DILocation(line: 647, scope: !200, inlinedAt: !197)
!200 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !49, file: !49, line: 647, scopeLine: 647, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!201 = !DILocalVariable(name: "denom", scope: !165, file: !7, line: 210, type: !29, align: 8)
!202 = !DILocation(line: 210, scope: !165, inlinedAt: !160)
!203 = !DILocalVariable(name: "y", scope: !165, file: !7, line: 211, type: !29, align: 8)
!204 = !DILocation(line: 211, scope: !165, inlinedAt: !160)
!205 = !DILocalVariable(name: "z", scope: !165, file: !7, line: 212, type: !29, align: 8)
!206 = !DILocation(line: 212, scope: !165, inlinedAt: !160)
!207 = !DILocation(line: 213, scope: !165, inlinedAt: !160)
!208 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.float[<3>].transform", scope: !7, file: !7, line: 35, type: !209, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!209 = !DISubroutineType(types: !210)
!210 = !{!11, !11, !211}
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !7, file: !7, line: 59, size: 512, align: 32, elements: !212, identifier: "std_math_matrix$float$.Matrix4x4")
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, scope: !211, file: !7, line: 61, baseType: !214, size: 512, align: 32)
!214 = !DICompositeType(tag: DW_TAG_union_type, scope: !211, file: !7, line: 61, size: 512, align: 32, elements: !215)
!215 = !{!216, !236}
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !7, line: 63, baseType: !217, size: 512, align: 32)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !214, file: !7, line: 63, size: 512, align: 32, elements: !218)
!218 = !{!219, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !217, file: !7, line: 65, baseType: !220, size: 32, align: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 4, baseType: !12, align: 4)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !217, file: !7, line: 65, baseType: !220, size: 32, align: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !217, file: !7, line: 65, baseType: !220, size: 32, align: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !217, file: !7, line: 65, baseType: !220, size: 32, align: 32, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !217, file: !7, line: 66, baseType: !220, size: 32, align: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !217, file: !7, line: 66, baseType: !220, size: 32, align: 32, offset: 160)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !217, file: !7, line: 66, baseType: !220, size: 32, align: 32, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !217, file: !7, line: 66, baseType: !220, size: 32, align: 32, offset: 224)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !217, file: !7, line: 67, baseType: !220, size: 32, align: 32, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !217, file: !7, line: 67, baseType: !220, size: 32, align: 32, offset: 288)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !217, file: !7, line: 67, baseType: !220, size: 32, align: 32, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !217, file: !7, line: 67, baseType: !220, size: 32, align: 32, offset: 352)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !217, file: !7, line: 68, baseType: !220, size: 32, align: 32, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !217, file: !7, line: 68, baseType: !220, size: 32, align: 32, offset: 416)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !217, file: !7, line: 68, baseType: !220, size: 32, align: 32, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !217, file: !7, line: 68, baseType: !220, size: 32, align: 32, offset: 480)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !214, file: !7, line: 70, baseType: !237, size: 512, align: 32)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 512, align: 32, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 16, lowerBound: 0)
!240 = !DILocalVariable(name: "self", arg: 1, scope: !208, file: !7, line: 35, type: !11)
!241 = !DILocation(line: 35, scope: !208)
!242 = !DILocalVariable(name: "mat", arg: 2, scope: !208, file: !7, line: 35, type: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4f", scope: !7, file: !7, line: 8, baseType: !211, align: 4)
!244 = !DILocation(line: 126, scope: !245, inlinedAt: !241)
!245 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !7, file: !7, line: 123, scopeLine: 123, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!246 = !DILocation(line: 125, scope: !245, inlinedAt: !241)
!247 = !DILocation(line: 127, scope: !245, inlinedAt: !241)
!248 = !DILocation(line: 128, scope: !245, inlinedAt: !241)
!249 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.double[<3>].transform", scope: !7, file: !7, line: 36, type: !250, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!250 = !DISubroutineType(types: !251)
!251 = !{!28, !28, !252}
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !7, file: !7, line: 59, size: 1024, align: 64, elements: !253, identifier: "std_math_matrix$double$.Matrix4x4")
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, scope: !252, file: !7, line: 61, baseType: !255, size: 1024, align: 64)
!255 = !DICompositeType(tag: DW_TAG_union_type, scope: !252, file: !7, line: 61, size: 1024, align: 64, elements: !256)
!256 = !{!257, !277}
!257 = !DIDerivedType(tag: DW_TAG_member, scope: !255, file: !7, line: 63, baseType: !258, size: 1024, align: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !255, file: !7, line: 63, size: 1024, align: 64, elements: !259)
!259 = !{!260, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !258, file: !7, line: 65, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 5, baseType: !29, align: 8)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !258, file: !7, line: 65, baseType: !261, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !258, file: !7, line: 65, baseType: !261, size: 64, align: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !258, file: !7, line: 65, baseType: !261, size: 64, align: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !258, file: !7, line: 66, baseType: !261, size: 64, align: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !258, file: !7, line: 66, baseType: !261, size: 64, align: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !258, file: !7, line: 66, baseType: !261, size: 64, align: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !258, file: !7, line: 66, baseType: !261, size: 64, align: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !258, file: !7, line: 67, baseType: !261, size: 64, align: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !258, file: !7, line: 67, baseType: !261, size: 64, align: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !258, file: !7, line: 67, baseType: !261, size: 64, align: 64, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !258, file: !7, line: 67, baseType: !261, size: 64, align: 64, offset: 704)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !258, file: !7, line: 68, baseType: !261, size: 64, align: 64, offset: 768)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !258, file: !7, line: 68, baseType: !261, size: 64, align: 64, offset: 832)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !258, file: !7, line: 68, baseType: !261, size: 64, align: 64, offset: 896)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !258, file: !7, line: 68, baseType: !261, size: 64, align: 64, offset: 960)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !255, file: !7, line: 70, baseType: !278, size: 1024, align: 64)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, align: 64, elements: !238)
!279 = !DILocalVariable(name: "self", arg: 1, scope: !249, file: !7, line: 36, type: !28)
!280 = !DILocation(line: 36, scope: !249)
!281 = !DILocalVariable(name: "mat", arg: 2, scope: !249, file: !7, line: 36, type: !282)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4", scope: !7, file: !7, line: 9, baseType: !252, align: 8)
!283 = !DILocation(line: 126, scope: !284, inlinedAt: !280)
!284 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !7, file: !7, line: 123, scopeLine: 123, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!285 = !DILocation(line: 125, scope: !284, inlinedAt: !280)
!286 = !DILocation(line: 127, scope: !284, inlinedAt: !280)
!287 = !DILocation(line: 128, scope: !284, inlinedAt: !280)
!288 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.float[<3>].angle", scope: !7, file: !7, line: 38, type: !289, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!289 = !DISubroutineType(types: !290)
!290 = !{!12, !11, !11}
!291 = !DILocalVariable(name: "self", arg: 1, scope: !288, file: !7, line: 38, type: !11)
!292 = !DILocation(line: 38, scope: !288)
!293 = !DILocalVariable(name: "v2", arg: 2, scope: !288, file: !7, line: 38, type: !11)
!294 = !DILocalVariable(name: "len", scope: !295, file: !7, line: 135, type: !12, align: 4)
!295 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !7, file: !7, line: 133, scopeLine: 133, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !15)
!296 = !DILocation(line: 135, scope: !295, inlinedAt: !292)
!297 = !DILocation(line: 619, scope: !298, inlinedAt: !299)
!298 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !49, file: !49, line: 619, scopeLine: 619, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!299 = !DILocation(line: 620, scope: !300, inlinedAt: !296)
!300 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !49, file: !49, line: 620, scopeLine: 620, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!301 = !DILocation(line: 604, scope: !302, inlinedAt: !297)
!302 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !49, file: !49, line: 604, scopeLine: 604, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!303 = !DILocalVariable(name: "dot", scope: !295, file: !7, line: 136, type: !12, align: 4)
!304 = !DILocation(line: 136, scope: !295, inlinedAt: !292)
!305 = !DILocation(line: 619, scope: !306, inlinedAt: !304)
!306 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !49, file: !49, line: 619, scopeLine: 619, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!307 = !DILocation(line: 604, scope: !308, inlinedAt: !305)
!308 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !49, file: !49, line: 604, scopeLine: 604, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!309 = !DILocation(line: 123, scope: !310, inlinedAt: !311)
!310 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !49, file: !49, line: 120, scopeLine: 120, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!311 = !DILocation(line: 137, scope: !295, inlinedAt: !292)
!312 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.double[<3>].angle", scope: !7, file: !7, line: 39, type: !313, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!313 = !DISubroutineType(types: !314)
!314 = !{!29, !28, !28}
!315 = !DILocalVariable(name: "self", arg: 1, scope: !312, file: !7, line: 39, type: !28)
!316 = !DILocation(line: 39, scope: !312)
!317 = !DILocalVariable(name: "v2", arg: 2, scope: !312, file: !7, line: 39, type: !28)
!318 = !DILocalVariable(name: "len", scope: !319, file: !7, line: 135, type: !29, align: 8)
!319 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !7, file: !7, line: 133, scopeLine: 133, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !15)
!320 = !DILocation(line: 135, scope: !319, inlinedAt: !316)
!321 = !DILocation(line: 662, scope: !322, inlinedAt: !323)
!322 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !49, file: !49, line: 662, scopeLine: 662, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!323 = !DILocation(line: 663, scope: !324, inlinedAt: !320)
!324 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !49, file: !49, line: 663, scopeLine: 663, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!325 = !DILocation(line: 647, scope: !326, inlinedAt: !321)
!326 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !49, file: !49, line: 647, scopeLine: 647, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!327 = !DILocalVariable(name: "dot", scope: !319, file: !7, line: 136, type: !29, align: 8)
!328 = !DILocation(line: 136, scope: !319, inlinedAt: !316)
!329 = !DILocation(line: 662, scope: !330, inlinedAt: !328)
!330 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !49, file: !49, line: 662, scopeLine: 662, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!331 = !DILocation(line: 647, scope: !332, inlinedAt: !329)
!332 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !49, file: !49, line: 647, scopeLine: 647, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!333 = !DILocation(line: 125, scope: !334, inlinedAt: !335)
!334 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !49, file: !49, line: 120, scopeLine: 120, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!335 = !DILocation(line: 137, scope: !319, inlinedAt: !316)
!336 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.float[<3>].refract", scope: !7, file: !7, line: 41, type: !337, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!337 = !DISubroutineType(types: !338)
!338 = !{!11, !11, !11, !12}
!339 = !DILocalVariable(name: "self", arg: 1, scope: !336, file: !7, line: 41, type: !11)
!340 = !DILocation(line: 41, scope: !336)
!341 = !DILocalVariable(name: "n", arg: 2, scope: !336, file: !7, line: 41, type: !11)
!342 = !DILocalVariable(name: "r", arg: 3, scope: !336, file: !7, line: 41, type: !12)
!343 = !DILocalVariable(name: "dot", scope: !344, file: !7, line: 218, type: !12, align: 4)
!344 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !7, file: !7, line: 216, scopeLine: 216, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !15)
!345 = !DILocation(line: 218, scope: !344, inlinedAt: !340)
!346 = !DILocation(line: 619, scope: !347, inlinedAt: !345)
!347 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !49, file: !49, line: 619, scopeLine: 619, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!348 = !DILocation(line: 604, scope: !349, inlinedAt: !346)
!349 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !49, file: !49, line: 604, scopeLine: 604, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!350 = !DILocalVariable(name: "d", scope: !344, file: !7, line: 219, type: !12, align: 4)
!351 = !DILocation(line: 219, scope: !344, inlinedAt: !340)
!352 = !DILocation(line: 221, scope: !344, inlinedAt: !340)
!353 = !DILocation(line: 31, scope: !354, inlinedAt: !356)
!354 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !355, file: !355, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!355 = !DIFile(filename: "values.c3", directory: "C:/Compilers/C3/lib/std/core")
!356 = !DILocation(line: 491, scope: !357, inlinedAt: !352)
!357 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !49, file: !49, line: 491, scopeLine: 491, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!358 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.double[<3>].refract", scope: !7, file: !7, line: 42, type: !359, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!359 = !DISubroutineType(types: !360)
!360 = !{!28, !28, !28, !29}
!361 = !DILocalVariable(name: "self", arg: 1, scope: !358, file: !7, line: 42, type: !28)
!362 = !DILocation(line: 42, scope: !358)
!363 = !DILocalVariable(name: "n", arg: 2, scope: !358, file: !7, line: 42, type: !28)
!364 = !DILocalVariable(name: "r", arg: 3, scope: !358, file: !7, line: 42, type: !29)
!365 = !DILocalVariable(name: "dot", scope: !366, file: !7, line: 218, type: !29, align: 8)
!366 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !7, file: !7, line: 216, scopeLine: 216, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !15)
!367 = !DILocation(line: 218, scope: !366, inlinedAt: !362)
!368 = !DILocation(line: 662, scope: !369, inlinedAt: !367)
!369 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !49, file: !49, line: 662, scopeLine: 662, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!370 = !DILocation(line: 647, scope: !371, inlinedAt: !368)
!371 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !49, file: !49, line: 647, scopeLine: 647, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!372 = !DILocalVariable(name: "d", scope: !366, file: !7, line: 219, type: !29, align: 8)
!373 = !DILocation(line: 219, scope: !366, inlinedAt: !362)
!374 = !DILocation(line: 221, scope: !366, inlinedAt: !362)
!375 = !DILocation(line: 31, scope: !376, inlinedAt: !377)
!376 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !355, file: !355, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!377 = !DILocation(line: 491, scope: !378, inlinedAt: !374)
!378 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !49, file: !49, line: 491, scopeLine: 491, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!379 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.float[<3>].rotate_quat", scope: !7, file: !7, line: 44, type: !380, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!380 = !DISubroutineType(types: !381)
!381 = !{!11, !11, !382}
!382 = !DICompositeType(tag: DW_TAG_union_type, name: "Quaternion", scope: !7, file: !7, line: 18, size: 128, align: 128, elements: !383, identifier: "std_math_quaternion$float$.Quaternion")
!383 = !{!384, !392}
!384 = !DIDerivedType(tag: DW_TAG_member, scope: !382, file: !7, line: 20, baseType: !385, size: 128, align: 128)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !382, file: !7, line: 20, size: 128, align: 128, elements: !386)
!386 = !{!387, !389, !390, !391}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !385, file: !7, line: 22, baseType: !388, size: 32, align: 32)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 5, baseType: !12, align: 4)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !385, file: !7, line: 22, baseType: !388, size: 32, align: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !385, file: !7, line: 22, baseType: !388, size: 32, align: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !385, file: !7, line: 22, baseType: !388, size: 32, align: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !382, file: !7, line: 24, baseType: !393, size: 128, align: 128)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 128, align: 32, flags: DIFlagVector, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 4, lowerBound: 0)
!396 = !DILocalVariable(name: "self", arg: 1, scope: !379, file: !7, line: 44, type: !11)
!397 = !DILocation(line: 44, scope: !379)
!398 = !DILocalVariable(name: "q", arg: 2, scope: !379, file: !7, line: 44, type: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternionf", scope: !7, file: !7, line: 5, baseType: !382, align: 16)
!400 = !DILocation(line: 150, scope: !401, inlinedAt: !397)
!401 = distinct !DISubprogram(name: "rotate_by_quat3", linkageName: "rotate_by_quat3", scope: !7, file: !7, line: 147, scopeLine: 147, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!402 = !DILocation(line: 151, scope: !401, inlinedAt: !397)
!403 = !DILocation(line: 152, scope: !401, inlinedAt: !397)
!404 = !DILocation(line: 149, scope: !401, inlinedAt: !397)
!405 = !DILocation(line: 153, scope: !401, inlinedAt: !397)
!406 = !DILocation(line: 154, scope: !401, inlinedAt: !397)
!407 = !DILocation(line: 155, scope: !401, inlinedAt: !397)
!408 = !DILocation(line: 156, scope: !401, inlinedAt: !397)
!409 = !DILocation(line: 157, scope: !401, inlinedAt: !397)
!410 = !DILocation(line: 158, scope: !401, inlinedAt: !397)
!411 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.double[<3>].rotate_quat", scope: !7, file: !7, line: 45, type: !412, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!412 = !DISubroutineType(types: !413)
!413 = !{!28, !28, !414}
!414 = !DICompositeType(tag: DW_TAG_union_type, name: "Quaternion", scope: !7, file: !7, line: 18, size: 256, align: 256, elements: !415, identifier: "std_math_quaternion$double$.Quaternion")
!415 = !{!416, !424}
!416 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !7, line: 20, baseType: !417, size: 256, align: 256)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !414, file: !7, line: 20, size: 256, align: 256, elements: !418)
!418 = !{!419, !421, !422, !423}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !417, file: !7, line: 22, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 6, baseType: !29, align: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !417, file: !7, line: 22, baseType: !420, size: 64, align: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !417, file: !7, line: 22, baseType: !420, size: 64, align: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !417, file: !7, line: 22, baseType: !420, size: 64, align: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !414, file: !7, line: 24, baseType: !425, size: 256, align: 256)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 256, align: 64, flags: DIFlagVector, elements: !394)
!426 = !DILocalVariable(name: "self", arg: 1, scope: !411, file: !7, line: 45, type: !28)
!427 = !DILocation(line: 45, scope: !411)
!428 = !DILocalVariable(name: "q", arg: 2, scope: !411, file: !7, line: 45, type: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternion", scope: !7, file: !7, line: 6, baseType: !414, align: 32)
!430 = !DILocation(line: 150, scope: !431, inlinedAt: !427)
!431 = distinct !DISubprogram(name: "rotate_by_quat3", linkageName: "rotate_by_quat3", scope: !7, file: !7, line: 147, scopeLine: 147, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!432 = !DILocation(line: 151, scope: !431, inlinedAt: !427)
!433 = !DILocation(line: 152, scope: !431, inlinedAt: !427)
!434 = !DILocation(line: 149, scope: !431, inlinedAt: !427)
!435 = !DILocation(line: 153, scope: !431, inlinedAt: !427)
!436 = !DILocation(line: 154, scope: !431, inlinedAt: !427)
!437 = !DILocation(line: 155, scope: !431, inlinedAt: !427)
!438 = !DILocation(line: 156, scope: !431, inlinedAt: !427)
!439 = !DILocation(line: 157, scope: !431, inlinedAt: !427)
!440 = !DILocation(line: 158, scope: !431, inlinedAt: !427)
!441 = distinct !DISubprogram(name: "rotate_axis", linkageName: "std.math.vector.float[<3>].rotate_axis", scope: !7, file: !7, line: 47, type: !337, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!442 = !DILocalVariable(name: "self", arg: 1, scope: !441, file: !7, line: 47, type: !11)
!443 = !DILocation(line: 47, scope: !441)
!444 = !DILocalVariable(name: "axis", arg: 2, scope: !441, file: !7, line: 47, type: !11)
!445 = !DILocalVariable(name: "angle", arg: 3, scope: !441, file: !7, line: 47, type: !12)
!446 = !DILocalVariable(name: "len", scope: !447, file: !7, line: 569, type: !12, align: 4)
!447 = distinct !DISubprogram(name: "normalize", linkageName: "normalize", scope: !49, file: !49, line: 567, scopeLine: 567, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !15)
!448 = !DILocation(line: 569, scope: !447, inlinedAt: !449)
!449 = !DILocation(line: 622, scope: !450, inlinedAt: !451)
!450 = distinct !DISubprogram(name: "normalize", linkageName: "normalize", scope: !49, file: !49, line: 622, scopeLine: 622, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!451 = !DILocation(line: 164, scope: !452, inlinedAt: !443)
!452 = distinct !DISubprogram(name: "rotate_axis_angle", linkageName: "rotate_axis_angle", scope: !7, file: !7, line: 162, scopeLine: 162, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !15)
!453 = !DILocation(line: 619, scope: !454, inlinedAt: !455)
!454 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !49, file: !49, line: 619, scopeLine: 619, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!455 = !DILocation(line: 620, scope: !456, inlinedAt: !448)
!456 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !49, file: !49, line: 620, scopeLine: 620, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!457 = !DILocation(line: 604, scope: !458, inlinedAt: !453)
!458 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !49, file: !49, line: 604, scopeLine: 604, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!459 = !DILocation(line: 570, scope: !447, inlinedAt: !449)
!460 = !DILocation(line: 571, scope: !447, inlinedAt: !449)
!461 = !DILocation(line: 166, scope: !452, inlinedAt: !443)
!462 = !DILocalVariable(name: "w", scope: !452, file: !7, line: 167, type: !11, align: 16)
!463 = !DILocation(line: 167, scope: !452, inlinedAt: !443)
