; ModuleID = 'std::os::win32'
source_filename = "std::os::win32"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%Backtrace = type { i64, %"char[]", %"char[]", %"char[]", i32, %any, i8 }
%any = type { ptr, i64 }
%Win32_SYSTEM_INFO = type { %.anon, i32, ptr, ptr, i64, i32, i32, i32, i16, i16 }
%.anon = type { i32 }
%"void*[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Win32_MODULEINFO = type { ptr, i32, ptr }
%List = type { i64, i64, %any, ptr }
%Symbol = type { %Win32_SYMBOL_INFO, [256 x i8] }
%Win32_SYMBOL_INFO = type { i32, i32, [2 x i64], i32, i32, i64, i32, i64, i64, i32, i32, i32, i32, i32, [1 x i8] }
%Win32_IMAGEHLP_MODULE64 = type { i32, i64, i32, i32, i32, i32, i32, [32 x i8], [256 x i8], [256 x i8], [256 x i8], i32, ptr, i32, %Win32_GUID, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%Win32_GUID = type { i32, i16, i16, [8 x i8] }
%Win32_IMAGEHLP_LINE64 = type { i32, ptr, i32, ptr, i64 }

$std.os.win32.allocation_granularity = comdat any

$std.os.win32.load_modules = comdat any

$std.os.win32.symbolize_backtrace = comdat any

$std.os.win32.resolve_backtrace = comdat any

$"$ct.std.os.win32.Win32_FILE_ATTRIBUTE_DATA" = comdat any

$"$ct.std.os.win32.Win32_WIN32_FIND_DATAW" = comdat any

$"$ct.int" = comdat any


!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "_SS_PAD1SIZE", linkageName: "std.os.win32._SS_PAD1SIZE", scope: !725, file: !725, line: 45, type: !503, isLocal: false, isDefinition: true, align: 8)
!725 = !DIFile(filename: "wsa.c3", directory: "C:/Compilers/C3/lib/std/os/win32")
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "_SS_PAD2SIZE", linkageName: "std.os.win32._SS_PAD2SIZE", scope: !725, file: !725, line: 46, type: !503, isLocal: false, isDefinition: true, align: 8)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "POLLERR", linkageName: "std.os.win32.POLLERR", scope: !725, file: !725, line: 110, type: !730, isLocal: false, isDefinition: true, align: 2)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_SHORT", scope: !725, file: !725, line: 148, baseType: !731, align: 2)
!731 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "POLLHUP", linkageName: "std.os.win32.POLLHUP", scope: !725, file: !725, line: 111, type: !730, isLocal: false, isDefinition: true, align: 2)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "POLLNVAL", linkageName: "std.os.win32.POLLNVAL", scope: !725, file: !725, line: 112, type: !730, isLocal: false, isDefinition: true, align: 2)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "POLLWRNORM", linkageName: "std.os.win32.POLLWRNORM", scope: !725, file: !725, line: 113, type: !730, isLocal: false, isDefinition: true, align: 2)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "POLLWRBAND", linkageName: "std.os.win32.POLLWRBAND", scope: !725, file: !725, line: 114, type: !730, isLocal: false, isDefinition: true, align: 2)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "POLLRDNORM", linkageName: "std.os.win32.POLLRDNORM", scope: !725, file: !725, line: 115, type: !730, isLocal: false, isDefinition: true, align: 2)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "POLLRDBAND", linkageName: "std.os.win32.POLLRDBAND", scope: !725, file: !725, line: 116, type: !730, isLocal: false, isDefinition: true, align: 2)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "POLLPRI", linkageName: "std.os.win32.POLLPRI", scope: !725, file: !725, line: 117, type: !730, isLocal: false, isDefinition: true, align: 2)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "POLLIN", linkageName: "std.os.win32.POLLIN", scope: !725, file: !725, line: 118, type: !730, isLocal: false, isDefinition: true, align: 2)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "POLLOUT", linkageName: "std.os.win32.POLLOUT", scope: !725, file: !725, line: 119, type: !730, isLocal: false, isDefinition: true, align: 2)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "SD_RECEIVE", linkageName: "std.os.win32.SD_RECEIVE", scope: !725, file: !725, line: 121, type: !8, isLocal: false, isDefinition: true, align: 4)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "SD_SEND", linkageName: "std.os.win32.SD_SEND", scope: !725, file: !725, line: 122, type: !8, isLocal: false, isDefinition: true, align: 4)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "SD_BOTH", linkageName: "std.os.win32.SD_BOTH", scope: !725, file: !725, line: 123, type: !8, isLocal: false, isDefinition: true, align: 4)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "FIONBIO", linkageName: "std.os.win32.FIONBIO", scope: !725, file: !725, line: 131, type: !3, isLocal: false, isDefinition: true, align: 4)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "FIONREAD", linkageName: "std.os.win32.FIONREAD", scope: !725, file: !725, line: 132, type: !3, isLocal: false, isDefinition: true, align: 4)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "SIOCATMARK", linkageName: "std.os.win32.SIOCATMARK", scope: !725, file: !725, line: 133, type: !3, isLocal: false, isDefinition: true, align: 4)
!762 = !{i32 1, !"CodeView", i32 1}
!763 = !{i32 2, !"Debug Info Version", i32 3}
!764 = !{i32 2, !"wchar_size", i32 2}
!765 = !{i32 4, !"PIC Level", i32 2}
!766 = !{i32 1, !"uwtable", i32 2}
!767 = !{i32 1, !"MaxTLSAlign", i32 65536}
!768 = distinct !DICompileUnit(language: DW_LANG_C11, file: !769, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !770, globals: !833, splitDebugInlining: false)
!769 = !DIFile(filename: "clock.c3", directory: "C:/Compilers/C3/lib/std/os/win32")
!770 = !{!771}
!771 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Win32_SYM_TYPE", scope: !772, file: !7, line: 314, baseType: !3, size: 32, align: 32, elements: !823)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_IMAGEHLP_MODULE64", scope: !7, file: !7, line: 335, size: 7296, align: 64, elements: !773, identifier: "std.os.win32.Win32_IMAGEHLP_MODULE64")
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !786, !790, !791, !792, !793, !797, !798, !812, !813, !815, !816, !817, !818, !819, !820, !821, !822}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "sizeOfStruct", scope: !772, file: !7, line: 337, baseType: !6, size: 32, align: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "baseOfImage", scope: !772, file: !7, line: 338, baseType: !593, size: 64, align: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "imageSize", scope: !772, file: !7, line: 339, baseType: !6, size: 32, align: 32, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "timeDateStamp", scope: !772, file: !7, line: 340, baseType: !6, size: 32, align: 32, offset: 160)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "checkSum", scope: !772, file: !7, line: 341, baseType: !6, size: 32, align: 32, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "numSyms", scope: !772, file: !7, line: 342, baseType: !6, size: 32, align: 32, offset: 224)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "symType", scope: !772, file: !7, line: 343, baseType: !771, size: 32, align: 32, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !772, file: !7, line: 344, baseType: !782, size: 256, align: 8, offset: 288)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 256, align: 8, elements: !784)
!783 = !DIBasicType(name: "ichar", size: 8, encoding: DW_ATE_signed_char)
!784 = !{!785}
!785 = !DISubrange(count: 32, lowerBound: 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "imageName", scope: !772, file: !7, line: 345, baseType: !787, size: 2048, align: 8, offset: 544)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 2048, align: 8, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 256, lowerBound: 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "loadedImageName", scope: !772, file: !7, line: 346, baseType: !787, size: 2048, align: 8, offset: 2592)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "loadedPdbName", scope: !772, file: !7, line: 347, baseType: !787, size: 2048, align: 8, offset: 4640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cVSig", scope: !772, file: !7, line: 348, baseType: !6, size: 32, align: 32, offset: 6688)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cVData", scope: !772, file: !7, line: 349, baseType: !794, size: 64, align: 64, offset: 6720)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Win32_CHAR**", baseType: !795, size: 64, align: 64, dwarfAddressSpace: 0)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Win32_CHAR*", baseType: !796, size: 64, align: 64, dwarfAddressSpace: 0)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_CHAR", scope: !7, file: !7, line: 7, baseType: !783, align: 1)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pdbSig", scope: !772, file: !7, line: 350, baseType: !6, size: 32, align: 32, offset: 6784)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pdbSig70", scope: !772, file: !7, line: 351, baseType: !799, size: 128, align: 32, offset: 6816)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_GUID", scope: !772, file: !7, line: 327, size: 128, align: 32, elements: !800, identifier: "std.os.win32.Win32_GUID")
!800 = !{!801, !803, !806, !807}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "data1", scope: !799, file: !7, line: 329, baseType: !802, size: 32, align: 32)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "CULong", scope: !7, file: !7, line: 24, baseType: !8, align: 4)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "data2", scope: !799, file: !7, line: 330, baseType: !804, size: 16, align: 16, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "CUShort", scope: !7, file: !7, line: 20, baseType: !805, align: 2)
!805 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "data3", scope: !799, file: !7, line: 331, baseType: !804, size: 16, align: 16, offset: 48)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "data4", scope: !799, file: !7, line: 332, baseType: !808, size: 64, align: 8, offset: 64)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 64, align: 8, elements: !810)
!809 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!810 = !{!811}
!811 = !DISubrange(count: 8, lowerBound: 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pdbAge", scope: !772, file: !7, line: 352, baseType: !6, size: 32, align: 32, offset: 6944)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pdbUnmatched", scope: !772, file: !7, line: 353, baseType: !814, size: 32, align: 32, offset: 6976)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_BOOL", scope: !7, file: !7, line: 3, baseType: !3, align: 4)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dbgUnmatched", scope: !772, file: !7, line: 354, baseType: !814, size: 32, align: 32, offset: 7008)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lineNumbers", scope: !772, file: !7, line: 355, baseType: !814, size: 32, align: 32, offset: 7040)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "globalSymbols", scope: !772, file: !7, line: 356, baseType: !814, size: 32, align: 32, offset: 7072)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "typeInfo", scope: !772, file: !7, line: 357, baseType: !814, size: 32, align: 32, offset: 7104)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sourceIndexed", scope: !772, file: !7, line: 358, baseType: !814, size: 32, align: 32, offset: 7136)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "publics", scope: !772, file: !7, line: 359, baseType: !814, size: 32, align: 32, offset: 7168)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "machineType", scope: !772, file: !7, line: 360, baseType: !6, size: 32, align: 32, offset: 7200)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !772, file: !7, line: 361, baseType: !6, size: 32, align: 32, offset: 7232)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832}
!824 = !DIEnumerator(name: "SYM_NONE", value: 0)
!825 = !DIEnumerator(name: "SYM_COFF", value: 1)
!826 = !DIEnumerator(name: "SYM_CV", value: 2)
!827 = !DIEnumerator(name: "SYM_PDB", value: 3)
!828 = !DIEnumerator(name: "SYM_EXPORT", value: 4)
!829 = !DIEnumerator(name: "SYM_DEFERRED", value: 5)
!830 = !DIEnumerator(name: "SYM_SYM", value: 6)
!831 = !DIEnumerator(name: "SYM_DIA", value: 7)
!832 = !DIEnumerator(name: "SYM_VIRTUAL", value: 8)
!833 = !{!0, !4, !9, !11, !13, !15, !17, !19, !21, !23, !25, !27, !29, !31, !33, !35, !37, !39, !41, !43, !45, !47, !49, !51, !53, !55, !58, !60, !62, !64, !66, !68, !70, !72, !74, !76, !78, !80, !82, !84, !86, !88, !90, !92, !94, !96, !98, !100, !102, !104, !106, !108, !110, !112, !114, !116, !118, !120, !122, !124, !126, !128, !130, !132, !134, !136, !138, !140, !142, !144, !146, !148, !150, !152, !154, !156, !158, !160, !162, !164, !166, !168, !170, !172, !174, !176, !178, !180, !182, !184, !186, !188, !190, !192, !194, !196, !198, !200, !202, !204, !206, !208, !210, !212, !214, !216, !218, !220, !222, !224, !226, !228, !230, !232, !234, !236, !238, !240, !242, !244, !246, !248, !250, !252, !254, !256, !258, !260, !262, !264, !266, !268, !270, !272, !274, !276, !278, !280, !282, !284, !286, !288, !290, !292, !294, !296, !298, !300, !302, !304, !306, !308, !310, !312, !314, !316, !318, !320, !322, !324, !326, !328, !330, !332, !334, !336, !338, !340, !342, !344, !346, !348, !350, !352, !354, !356, !358, !360, !362, !364, !366, !368, !370, !372, !374, !376, !378, !380, !382, !384, !386, !388, !390, !392, !394, !396, !398, !400, !402, !404, !406, !408, !410, !412, !414, !416, !418, !420, !422, !424, !426, !428, !430, !432, !434, !436, !438, !440, !442, !444, !446, !448, !450, !452, !454, !456, !458, !460, !462, !464, !466, !468, !470, !472, !474, !476, !478, !480, !482, !484, !486, !488, !490, !492, !494, !496, !498, !500, !505, !507, !509, !511, !513, !515, !517, !519, !521, !523, !525, !527, !529, !531, !533, !535, !537, !539, !541, !543, !545, !547, !549, !551, !553, !555, !557, !559, !561, !563, !565, !567, !569, !571, !573, !575, !577, !579, !581, !583, !585, !587, !589, !591, !594, !599, !601, !603, !605, !607, !609, !611, !613, !615, !617, !619, !622, !624, !626, !628, !630, !632, !634, !636, !638, !640, !642, !644, !646, !648, !650, !652, !654, !656, !658, !660, !662, !664, !666, !668, !670, !672, !674, !677, !679, !681, !683, !685, !687, !689, !691, !693, !695, !697, !699, !701, !703, !705, !707, !709, !711, !713, !715, !717, !719, !721, !723, !726, !728, !732, !734, !736, !738, !740, !742, !744, !746, !748, !750, !752, !754, !756, !758, !760}
!834 = distinct !DISubprogram(name: "allocation_granularity", linkageName: "std.os.win32.allocation_granularity", scope: !502, file: !502, line: 44, type: !835, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !768, retainedNodes: !837)
!835 = !DISubroutineType(types: !836)
!836 = !{!503}
!837 = !{}
!838 = !DILocation(line: 47, scope: !834)
!839 = !DILocalVariable(name: "info", scope: !834, file: !502, line: 49, type: !840, align: 8)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_SYSTEM_INFO", scope: !502, file: !502, line: 274, size: 384, align: 64, elements: !841, identifier: "std.os.win32.Win32_SYSTEM_INFO")
!841 = !{!842, !852, !853, !855, !856, !858, !859, !860, !861, !862}
!842 = !DIDerivedType(tag: DW_TAG_member, scope: !840, file: !502, line: 276, baseType: !843, size: 32, align: 32)
!843 = !DICompositeType(tag: DW_TAG_union_type, scope: !840, file: !502, line: 276, size: 32, align: 32, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "dwOemId", scope: !843, file: !502, line: 278, baseType: !6, size: 32, align: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, scope: !843, file: !502, line: 279, baseType: !847, size: 32, align: 32)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !843, file: !502, line: 279, size: 32, align: 32, elements: !848)
!848 = !{!849, !851}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "wProcessorArchitecture", scope: !847, file: !502, line: 281, baseType: !850, size: 16, align: 16)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_WORD", scope: !502, file: !502, line: 170, baseType: !805, align: 2)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "wReserved", scope: !847, file: !502, line: 282, baseType: !850, size: 16, align: 16, offset: 16)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "dwPageSize", scope: !840, file: !502, line: 285, baseType: !6, size: 32, align: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "lpMinimumApplicationAddress", scope: !840, file: !502, line: 286, baseType: !854, size: 64, align: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LPVOID", scope: !502, file: !502, line: 80, baseType: !598, align: 8)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lpMaximumApplicationAddress", scope: !840, file: !502, line: 287, baseType: !854, size: 64, align: 64, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "dwActiveProcessorMask", scope: !840, file: !502, line: 288, baseType: !857, size: 64, align: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_DWORD_PTR", scope: !502, file: !502, line: 11, baseType: !504, align: 8)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "dwNumberOfProcessors", scope: !840, file: !502, line: 289, baseType: !6, size: 32, align: 32, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "dwProcessorType", scope: !840, file: !502, line: 290, baseType: !6, size: 32, align: 32, offset: 288)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "dwAllocationGranularity", scope: !840, file: !502, line: 291, baseType: !6, size: 32, align: 32, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "wProcessorLevel", scope: !840, file: !502, line: 292, baseType: !850, size: 16, align: 16, offset: 352)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "wProcessorRevision", scope: !840, file: !502, line: 293, baseType: !850, size: 16, align: 16, offset: 368)
!863 = !DILocation(line: 49, scope: !834)
!864 = !DILocation(line: 50, scope: !834)
!865 = !DILocation(line: 51, scope: !834)
!866 = distinct !DISubprogram(name: "load_modules", linkageName: "std.os.win32.load_modules", scope: !7, file: !7, line: 126, type: !867, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !768, retainedNodes: !837)
!867 = !DISubroutineType(types: !868)
!868 = !{!869, !871}
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !870)
!870 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Win32_DWORD*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!872 = !DILocalVariable(name: "process", scope: !866, file: !7, line: 128, type: !597, align: 8)
!873 = !DILocation(line: 128, scope: !866)
!874 = !DILocalVariable(name: "needed", scope: !866, file: !7, line: 129, type: !6, align: 4)
!875 = !DILocation(line: 129, scope: !866)
!876 = !DILocation(line: 130, scope: !866)
!877 = !DILocalVariable(name: "symOptions", scope: !866, file: !7, line: 131, type: !6, align: 4)
!878 = !DILocation(line: 131, scope: !866)
!879 = !DILocation(line: 132, scope: !866)
!880 = !DILocation(line: 133, scope: !866)
!881 = !DILocalVariable(name: "mod_buffer", scope: !866, file: !7, line: 134, type: !882, align: 16)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 65536, align: 64, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 1024, lowerBound: 0)
!885 = !DILocation(line: 134, scope: !866)
!886 = !DILocation(line: 135, scope: !866)
!887 = !DILocation(line: 137, scope: !888)
!888 = distinct !DILexicalBlock(scope: !866, file: !7, line: 136, column: 2)
!889 = !DILocation(line: 139, scope: !866)
!890 = !DILocalVariable(name: "modules", scope: !866, file: !7, line: 140, type: !891, align: 8)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_HMODULE[]", size: 128, align: 64, elements: !892, identifier: "Win32_HMODULE[]")
!892 = !{!893, !896}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !891, baseType: !894, size: 64, align: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Win32_HMODULE*", baseType: !895, size: 64, align: 64, dwarfAddressSpace: 0)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_HMODULE", scope: !7, file: !7, line: 41, baseType: !598, align: 8)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !891, baseType: !503, size: 64, align: 64, offset: 64)
!897 = !DILocation(line: 140, scope: !866)
!898 = !DILocalVariable(name: "base", scope: !866, file: !7, line: 141, type: !598, align: 8)
!899 = !DILocation(line: 141, scope: !866)
!900 = !DILocation(line: 142, scope: !901)
!901 = distinct !DILexicalBlock(scope: !866, file: !7, line: 142, column: 2)
!902 = !DILocalVariable(name: ".temp", scope: !901, file: !7, line: 142, type: !503, align: 8)
!903 = !DILocalVariable(name: "mod", scope: !904, file: !7, line: 142, type: !598, align: 8)
!904 = distinct !DILexicalBlock(scope: !901, file: !7, line: 143, column: 2)
!905 = !DILocation(line: 142, scope: !904)
!906 = !DILocalVariable(name: "info", scope: !907, file: !7, line: 144, type: !908, align: 8)
!907 = distinct !DILexicalBlock(scope: !904, file: !7, line: 143, column: 2)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_MODULEINFO", scope: !7, file: !7, line: 298, size: 192, align: 64, elements: !909, identifier: "std.os.win32.Win32_MODULEINFO")
!909 = !{!910, !911, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "lpBaseOfDll", scope: !908, file: !7, line: 300, baseType: !854, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "sizeOfImage", scope: !908, file: !7, line: 301, baseType: !6, size: 32, align: 32, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "entryPoint", scope: !908, file: !7, line: 302, baseType: !854, size: 64, align: 64, offset: 128)
!913 = !DILocation(line: 144, scope: !907)
!914 = !DILocation(line: 145, scope: !907)
!915 = !DILocation(line: 147, scope: !916)
!916 = distinct !DILexicalBlock(scope: !907, file: !7, line: 146, column: 3)
!917 = !DILocation(line: 149, scope: !907)
!918 = !DILocalVariable(name: "load_size", scope: !907, file: !7, line: 150, type: !6, align: 4)
!919 = !DILocation(line: 150, scope: !907)
!920 = !DILocalVariable(name: "char_buf", scope: !907, file: !7, line: 151, type: !921, align: 16)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 8192, align: 8, elements: !883)
!922 = !DILocation(line: 151, scope: !907)
!923 = !DILocalVariable(name: "len", scope: !907, file: !7, line: 152, type: !6, align: 4)
!924 = !DILocation(line: 152, scope: !907)
!925 = !DILocation(line: 153, scope: !907)
!926 = !DILocalVariable(name: "module_name", scope: !907, file: !7, line: 154, type: !921, align: 16)
!927 = !DILocation(line: 154, scope: !907)
!928 = !DILocalVariable(name: "len2", scope: !907, file: !7, line: 155, type: !6, align: 4)
!929 = !DILocation(line: 155, scope: !907)
!930 = !DILocation(line: 156, scope: !907)
!931 = !DILocalVariable(name: "base_addr", scope: !907, file: !7, line: 157, type: !593, align: 8)
!932 = !DILocation(line: 157, scope: !907)
!933 = !DILocation(line: 159, scope: !866)
!934 = !DILocalVariable(name: "h", scope: !866, file: !7, line: 160, type: !935, align: 8)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Win32_IMAGE_NT_HEADERS*", baseType: !936, size: 64, align: 64, dwarfAddressSpace: 0)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_IMAGE_NT_HEADERS", scope: !7, file: !7, line: 600, size: 2112, align: 64, elements: !937, identifier: "std.os.win32.Win32_IMAGE_NT_HEADERS")
!937 = !{!938, !939, !949}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !936, file: !7, line: 602, baseType: !6, size: 32, align: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "fileHeader", scope: !936, file: !7, line: 603, baseType: !940, size: 160, align: 32, offset: 32)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_IMAGE_FILE_HEADER", scope: !936, file: !7, line: 587, size: 160, align: 32, elements: !941, identifier: "std.os.win32.Win32_IMAGE_FILE_HEADER")
!941 = !{!942, !943, !944, !945, !946, !947, !948}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !940, file: !7, line: 589, baseType: !850, size: 16, align: 16)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "numberOfSections", scope: !940, file: !7, line: 590, baseType: !850, size: 16, align: 16, offset: 16)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "timeDateStamp", scope: !940, file: !7, line: 591, baseType: !6, size: 32, align: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "pointerToSymbolTable", scope: !940, file: !7, line: 592, baseType: !6, size: 32, align: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "numberOfSymbols", scope: !940, file: !7, line: 593, baseType: !6, size: 32, align: 32, offset: 96)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "sizeOfOptionalHeader", scope: !940, file: !7, line: 594, baseType: !850, size: 16, align: 16, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "characteristics", scope: !940, file: !7, line: 595, baseType: !850, size: 16, align: 16, offset: 144)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "optionalHeader", scope: !936, file: !7, line: 604, baseType: !950, size: 1920, align: 64, offset: 192)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_IMAGE_OPTIONAL_HEADER64", scope: !936, file: !7, line: 552, size: 1920, align: 64, elements: !951, identifier: "std.os.win32.Win32_IMAGE_OPTIONAL_HEADER64")
!951 = !{!952, !953, !955, !956, !957, !958, !959, !960, !961, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !950, file: !7, line: 554, baseType: !850, size: 16, align: 16)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "majorLinkerVersion", scope: !950, file: !7, line: 555, baseType: !954, size: 8, align: 8, offset: 16)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_BYTE", scope: !7, file: !7, line: 5, baseType: !809, align: 1)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "minorLinkerVersion", scope: !950, file: !7, line: 556, baseType: !954, size: 8, align: 8, offset: 24)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "sizeOfCode", scope: !950, file: !7, line: 557, baseType: !6, size: 32, align: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "sizeOfInitializedData", scope: !950, file: !7, line: 558, baseType: !6, size: 32, align: 32, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "sizeOfUninitializedData", scope: !950, file: !7, line: 559, baseType: !6, size: 32, align: 32, offset: 96)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "addressOfEntryPoint", scope: !950, file: !7, line: 560, baseType: !6, size: 32, align: 32, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "baseOfCode", scope: !950, file: !7, line: 561, baseType: !6, size: 32, align: 32, offset: 160)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "imageBase", scope: !950, file: !7, line: 562, baseType: !962, size: 64, align: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_ULONGLONG", scope: !7, file: !7, line: 163, baseType: !504, align: 8)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "sectionAlignment", scope: !950, file: !7, line: 563, baseType: !6, size: 32, align: 32, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "fileAlignment", scope: !950, file: !7, line: 564, baseType: !6, size: 32, align: 32, offset: 288)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "majorOperatingSystemVersion", scope: !950, file: !7, line: 565, baseType: !850, size: 16, align: 16, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "minorOperatingSystemVersion", scope: !950, file: !7, line: 566, baseType: !850, size: 16, align: 16, offset: 336)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "majorImageVersion", scope: !950, file: !7, line: 567, baseType: !850, size: 16, align: 16, offset: 352)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "minorImageVersion", scope: !950, file: !7, line: 568, baseType: !850, size: 16, align: 16, offset: 368)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "majorSubsystemVersion", scope: !950, file: !7, line: 569, baseType: !850, size: 16, align: 16, offset: 384)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "minorSubsystemVersion", scope: !950, file: !7, line: 570, baseType: !850, size: 16, align: 16, offset: 400)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "win32VersionValue", scope: !950, file: !7, line: 571, baseType: !6, size: 32, align: 32, offset: 416)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "sizeOfImage", scope: !950, file: !7, line: 572, baseType: !6, size: 32, align: 32, offset: 448)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "sizeOfHeaders", scope: !950, file: !7, line: 573, baseType: !6, size: 32, align: 32, offset: 480)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "checkSum", scope: !950, file: !7, line: 574, baseType: !6, size: 32, align: 32, offset: 512)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "subsystem", scope: !950, file: !7, line: 575, baseType: !850, size: 16, align: 16, offset: 544)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "dllCharacteristics", scope: !950, file: !7, line: 576, baseType: !850, size: 16, align: 16, offset: 560)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "sizeOfStackReserve", scope: !950, file: !7, line: 577, baseType: !962, size: 64, align: 64, offset: 576)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "sizeOfStackCommit", scope: !950, file: !7, line: 578, baseType: !962, size: 64, align: 64, offset: 640)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "sizeOfHeapReserve", scope: !950, file: !7, line: 579, baseType: !962, size: 64, align: 64, offset: 704)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "sizeOfHeapCommit", scope: !950, file: !7, line: 580, baseType: !962, size: 64, align: 64, offset: 768)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "loaderFlags", scope: !950, file: !7, line: 581, baseType: !6, size: 32, align: 32, offset: 832)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "numberOfRvaAndSizes", scope: !950, file: !7, line: 582, baseType: !6, size: 32, align: 32, offset: 864)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "dataDirectory", scope: !950, file: !7, line: 583, baseType: !984, size: 1024, align: 32, offset: 896)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 1024, align: 32, elements: !990)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_IMAGE_DATA_DIRECTORY", scope: !7, file: !7, line: 546, size: 64, align: 32, elements: !986, identifier: "std.os.win32.Win32_IMAGE_DATA_DIRECTORY")
!986 = !{!987, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "virtualAddress", scope: !985, file: !7, line: 548, baseType: !988, size: 32, align: 32)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_ULONG", scope: !7, file: !7, line: 162, baseType: !8, align: 4)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !985, file: !7, line: 549, baseType: !988, size: 32, align: 32, offset: 32)
!990 = !{!991}
!991 = !DISubrange(count: 16, lowerBound: 0)
!992 = !DILocation(line: 160, scope: !866)
!993 = !DILocation(line: 161, scope: !866)
!994 = distinct !DISubprogram(name: "symbolize_backtrace", linkageName: "std.os.win32.symbolize_backtrace", scope: !7, file: !7, line: 172, type: !995, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !768, retainedNodes: !837)
!995 = !DISubroutineType(types: !996)
!996 = !{!869, !997, !1004, !1029}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BacktraceList*", baseType: !998, size: 64, align: 64, dwarfAddressSpace: 0)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "BacktraceList", scope: !7, file: !7, line: 88, baseType: !999, align: 8)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !7, file: !7, line: 18, size: 320, align: 64, elements: !1000, identifier: "std_collections_list$std.os.backtrace.Backtrace$.List")
!1000 = !{!1001, !1002, !1003, !1009}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !999, file: !7, line: 20, baseType: !503, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !999, file: !7, line: 21, baseType: !503, size: 64, align: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !999, file: !7, line: 22, baseType: !1004, size: 128, align: 64, offset: 128)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !1005, identifier: "Allocator")
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1004, baseType: !598, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1004, baseType: !1008, size: 64, align: 64, offset: 64)
!1008 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !999, file: !7, line: 23, baseType: !1010, size: 64, align: 64, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !1011, size: 64, align: 64, dwarfAddressSpace: 0)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !7, file: !7, line: 88, baseType: !1012, align: 8)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !7, file: !7, line: 9, size: 704, align: 64, elements: !1013, identifier: "std.os.backtrace.Backtrace")
!1013 = !{!1014, !1016, !1023, !1024, !1025, !1026, !1027}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1012, file: !7, line: 11, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !504)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !1012, file: !7, line: 12, baseType: !1017, size: 128, align: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !1018)
!1018 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !1019, identifier: "char[]")
!1019 = !{!1020, !1022}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1018, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !809, size: 64, align: 64, dwarfAddressSpace: 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1018, baseType: !503, size: 64, align: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !1012, file: !7, line: 13, baseType: !1017, size: 128, align: 64, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1012, file: !7, line: 14, baseType: !1017, size: 128, align: 64, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !1012, file: !7, line: 15, baseType: !8, size: 32, align: 32, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !1012, file: !7, line: 16, baseType: !1004, size: 128, align: 64, offset: 512)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !1012, file: !7, line: 17, baseType: !1028, size: 8, align: 8, offset: 640)
!1028 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!1029 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !1030, identifier: "void*[]")
!1030 = !{!1031, !1033}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1029, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !598, size: 64, align: 64, dwarfAddressSpace: 0)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1029, baseType: !503, size: 64, align: 64, offset: 64)
!1034 = !DILocalVariable(name: "allocator", arg: 1, scope: !994, file: !7, line: 172, type: !1004)
!1035 = !DILocation(line: 172, scope: !994)
!1036 = !DILocalVariable(name: "backtrace", arg: 2, scope: !994, file: !7, line: 172, type: !1029)
!1037 = !DILocalVariable(name: "list", scope: !994, file: !7, line: 174, type: !998, align: 8)
!1038 = !DILocation(line: 174, scope: !994)
!1039 = !DILocation(line: 175, scope: !994)
!1040 = !DILocalVariable(name: "process", scope: !994, file: !7, line: 176, type: !597, align: 8)
!1041 = !DILocation(line: 176, scope: !994)
!1042 = !DILocation(line: 177, scope: !994)
!1043 = !DILocation(line: 179, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !994, file: !7, line: 179, column: 2)
!1045 = !DILocalVariable(name: ".temp", scope: !1044, file: !7, line: 179, type: !503, align: 8)
!1046 = !DILocalVariable(name: "addr", scope: !1047, file: !7, line: 179, type: !598, align: 8)
!1047 = distinct !DILexicalBlock(scope: !1044, file: !7, line: 180, column: 2)
!1048 = !DILocation(line: 179, scope: !1047)
!1049 = !DILocation(line: 181, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1047, file: !7, line: 180, column: 2)
!1051 = !DILocation(line: 178, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !994, file: !7, line: 178, column: 8)
!1053 = distinct !DISubprogram(name: "resolve_backtrace", linkageName: "std.os.win32.resolve_backtrace", scope: !7, file: !7, line: 186, type: !1054, scopeLine: 186, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !768, retainedNodes: !837)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!869, !1056, !1004, !598, !598}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Backtrace*", baseType: !1012, size: 64, align: 64, dwarfAddressSpace: 0)
!1057 = !DILocalVariable(name: "allocator", arg: 1, scope: !1053, file: !7, line: 186, type: !1004)
!1058 = !DILocation(line: 186, scope: !1053)
!1059 = !DILocalVariable(name: "addr", arg: 2, scope: !1053, file: !7, line: 186, type: !598)
!1060 = !DILocalVariable(name: "process", arg: 3, scope: !1053, file: !7, line: 186, type: !597)
!1061 = !DILocalVariable(name: "symbol", scope: !1053, file: !7, line: 188, type: !1062, align: 8)
!1062 = !DICompositeType(tag: DW_TAG_structure_type, name: "Symbol", scope: !7, file: !7, line: 164, size: 2752, align: 64, elements: !1063, identifier: "std.os.win32.Symbol")
!1063 = !{!1064, !1089}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !1062, file: !7, line: 166, baseType: !1065, size: 704, align: 64)
!1065 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_SYMBOL_INFO", scope: !1062, file: !7, line: 609, size: 704, align: 64, elements: !1066, identifier: "std.os.win32.Win32_SYMBOL_INFO")
!1066 = !{!1067, !1068, !1069, !1073, !1074, !1075, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "sizeOfStruct", scope: !1065, file: !7, line: 611, baseType: !988, size: 32, align: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "typeIndex", scope: !1065, file: !7, line: 612, baseType: !988, size: 32, align: 32, offset: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1065, file: !7, line: 613, baseType: !1070, size: 128, align: 64, offset: 64)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 128, align: 64, elements: !1071)
!1071 = !{!1072}
!1072 = !DISubrange(count: 2, lowerBound: 0)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1065, file: !7, line: 614, baseType: !988, size: 32, align: 32, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1065, file: !7, line: 615, baseType: !988, size: 32, align: 32, offset: 224)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "modBase", scope: !1065, file: !7, line: 616, baseType: !1076, size: 64, align: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_ULONG64", scope: !7, file: !7, line: 166, baseType: !504, align: 8)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1065, file: !7, line: 617, baseType: !988, size: 32, align: 32, offset: 320)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1065, file: !7, line: 618, baseType: !1076, size: 64, align: 64, offset: 384)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1065, file: !7, line: 619, baseType: !1076, size: 64, align: 64, offset: 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "register", scope: !1065, file: !7, line: 620, baseType: !988, size: 32, align: 32, offset: 512)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !1065, file: !7, line: 621, baseType: !988, size: 32, align: 32, offset: 544)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1065, file: !7, line: 622, baseType: !988, size: 32, align: 32, offset: 576)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "nameLen", scope: !1065, file: !7, line: 623, baseType: !988, size: 32, align: 32, offset: 608)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "maxNameLen", scope: !1065, file: !7, line: 624, baseType: !988, size: 32, align: 32, offset: 640)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1065, file: !7, line: 625, baseType: !1086, size: 8, align: 8, offset: 672)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 8, align: 8, elements: !1087)
!1087 = !{!1088}
!1088 = !DISubrange(count: 1, lowerBound: 0)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1062, file: !7, line: 167, baseType: !1090, size: 2048, align: 8, offset: 704)
!1090 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 2048, align: 8, elements: !788)
!1091 = !DILocation(line: 188, scope: !1053)
!1092 = !DILocation(line: 190, scope: !1053)
!1093 = !DILocation(line: 191, scope: !1053)
!1094 = !DILocation(line: 192, scope: !1053)
!1095 = !DILocation(line: 194, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1053, file: !7, line: 193, column: 2)
!1097 = !DILocalVariable(name: "module_info", scope: !1053, file: !7, line: 196, type: !772, align: 8)
!1098 = !DILocation(line: 196, scope: !1053)
!1099 = !DILocation(line: 197, scope: !1053)
!1100 = !DILocation(line: 198, scope: !1053)
!1101 = !DILocation(line: 200, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1053, file: !7, line: 199, column: 2)
!1103 = !DILocalVariable(name: "module_name", scope: !1053, file: !7, line: 202, type: !1104, align: 8)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !7, file: !7, line: 12, baseType: !1021, align: 8)
!1105 = !DILocation(line: 202, scope: !1053)
!1106 = !DILocalVariable(name: "name", scope: !1053, file: !7, line: 203, type: !1090, align: 16)
!1107 = !DILocation(line: 203, scope: !1053)
!1108 = !DILocation(line: 204, scope: !1053)
!1109 = !DILocalVariable(name: "offset", scope: !1053, file: !7, line: 205, type: !6, align: 4)
!1110 = !DILocation(line: 205, scope: !1053)
!1111 = !DILocalVariable(name: "line", scope: !1053, file: !7, line: 206, type: !1112, align: 8)
!1112 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_IMAGEHLP_LINE64", scope: !7, file: !7, line: 305, size: 320, align: 64, elements: !1113, identifier: "std.os.win32.Win32_IMAGEHLP_LINE64")
!1113 = !{!1114, !1115, !1117, !1118, !1121}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "sizeOfStruct", scope: !1112, file: !7, line: 307, baseType: !6, size: 32, align: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1112, file: !7, line: 308, baseType: !1116, size: 64, align: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_PVOID", scope: !7, file: !7, line: 140, baseType: !598, align: 8)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "lineNumber", scope: !1112, file: !7, line: 309, baseType: !6, size: 32, align: 32, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "fileName", scope: !1112, file: !7, line: 310, baseType: !1119, size: 64, align: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_PCHAR", scope: !7, file: !7, line: 88, baseType: !1120, align: 8)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ichar*", baseType: !783, size: 64, align: 64, dwarfAddressSpace: 0)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1112, file: !7, line: 311, baseType: !593, size: 64, align: 64, offset: 256)
!1122 = !DILocation(line: 206, scope: !1053)
!1123 = !DILocalVariable(name: "backtrace", scope: !1053, file: !7, line: 207, type: !1012, align: 8)
!1124 = !DILocation(line: 207, scope: !1053)
!1125 = !DILocalVariable(name: "zname", scope: !1053, file: !7, line: 208, type: !1104, align: 8)
!1126 = !DILocation(line: 208, scope: !1053)
!1127 = !DILocation(line: 209, scope: !1053)
!1128 = !DILocation(line: 211, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1053, file: !7, line: 210, column: 2)
!1130 = !DILocation(line: 212, scope: !1129)
!1131 = !DILocalVariable(name: "filename", scope: !1053, file: !7, line: 214, type: !1017, align: 8)
!1132 = !DILocation(line: 214, scope: !1053)
!1133 = !DILocation(line: 215, scope: !1053)
!1134 = !DILocation(line: 216, scope: !1053)
