; ModuleID = 'std::encoding::json'
source_filename = "std::encoding::json"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%ByteReader = type { %"char[]", i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%JsonContext = type { i32, %any, %any, i32, ptr, double, i8, i32, i8 }
%"any[]" = type { ptr, i64 }

$std.encoding.json.parse_string = comdat any

$std.encoding.json.tparse_string = comdat any

$std.encoding.json.parse = comdat any

$std.encoding.json.tparse = comdat any

$std.encoding.json.lex_string = comdat any

$.dyn_search = comdat any

$"$ct.std.encoding.json.JsonContext.12674" = comdat any

$"$ct.int" = comdat any

$"$ct.std.encoding.json.JsonTokenType.12660" = comdat any

$std.encoding.json.max_depth = comdat any

$"$ct.std.io.ByteReader" = comdat any

$"$ct.std.core.mem.allocator.OnStackAllocator" = comdat any

$"$ct.ulong" = comdat any

$std.encoding.json.UNEXPECTED_CHARACTER = comdat any

$"$sel.read_byte" = comdat any

$std.io.EOF = comdat any

$std.encoding.json.INVALID_NUMBER = comdat any

$std.encoding.json.MAX_DEPTH_REACHED = comdat any

$std.encoding.json.INVALID_ESCAPE_SEQUENCE = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "max_depth", linkageName: "std.encoding.json.max_depth", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "json.c3", directory: "C:/Compilers/C3/lib/std/encoding")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !{i32 1, !"CodeView", i32 1}
!5 = !{i32 2, !"Debug Info Version", i32 3}
!6 = !{i32 2, !"wchar_size", i32 2}
!7 = !{i32 4, !"PIC Level", i32 2}
!8 = !{i32 1, !"uwtable", i32 2}
!9 = !{i32 1, !"MaxTLSAlign", i32 65536}
!10 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !54, splitDebugInlining: false)
!11 = !{!12}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "JsonTokenType", scope: !13, file: !2, line: 49, baseType: !3, size: 32, align: 32, elements: !40)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "JsonContext", scope: !2, file: !2, line: 66, size: 640, align: 64, elements: !14, identifier: "std.encoding.json.JsonContext.12674")
!14 = !{!15, !17, !24, !29, !30, !34, !36, !38, !39}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !13, file: !2, line: 68, baseType: !16, size: 32, align: 32)
!16 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !13, file: !2, line: 69, baseType: !18, size: 128, align: 64, offset: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !19, identifier: "InStream")
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !18, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !13, file: !2, line: 70, baseType: !25, size: 128, align: 64, offset: 192)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !26, identifier: "Allocator")
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !25, baseType: !21, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, baseType: !23, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !13, file: !2, line: 71, baseType: !12, size: 32, align: 32, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "last_string", scope: !13, file: !2, line: 72, baseType: !31, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !32, align: 8)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 1)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "last_number", scope: !13, file: !2, line: 73, baseType: !35, size: 64, align: 64, offset: 448)
!35 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !13, file: !2, line: 74, baseType: !37, size: 8, align: 8, offset: 512)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !13, file: !2, line: 75, baseType: !3, size: 32, align: 32, offset: 544)
!39 = !DIDerivedType(tag: DW_TAG_member, scope: !13, file: !2, line: 76, baseType: !37, size: 8, align: 8, offset: 576)
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!41 = !DIEnumerator(name: "NO_TOKEN", value: 0)
!42 = !DIEnumerator(name: "LBRACE", value: 1)
!43 = !DIEnumerator(name: "LBRACKET", value: 2)
!44 = !DIEnumerator(name: "COMMA", value: 3)
!45 = !DIEnumerator(name: "COLON", value: 4)
!46 = !DIEnumerator(name: "RBRACE", value: 5)
!47 = !DIEnumerator(name: "RBRACKET", value: 6)
!48 = !DIEnumerator(name: "STRING", value: 7)
!49 = !DIEnumerator(name: "NUMBER", value: 8)
!50 = !DIEnumerator(name: "TRUE", value: 9)
!51 = !DIEnumerator(name: "FALSE", value: 10)
!52 = !DIEnumerator(name: "NULL", value: 11)
!53 = !DIEnumerator(name: "EOF", value: 12)
!54 = !{!0}
!55 = distinct !DISubprogram(name: "parse_string", linkageName: "std.encoding.json.parse_string", scope: !2, file: !2, line: 12, type: !56, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !118)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !60, !25, !75}
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !59)
!59 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object**", baseType: !61, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object*", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !2, file: !2, line: 11, size: 640, align: 128, elements: !63, identifier: "std.collections.object.Object")
!63 = !{!64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, file: !2, line: 13, baseType: !23, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !62, file: !2, line: 14, baseType: !25, size: 128, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, scope: !62, file: !2, line: 15, baseType: !67, size: 384, align: 128, offset: 256)
!67 = !DICompositeType(tag: DW_TAG_union_type, scope: !62, file: !2, line: 15, size: 384, align: 128, elements: !68)
!68 = !{!69, !71, !72, !74, !83, !84, !94}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !67, file: !2, line: 17, baseType: !70, size: 128, align: 128)
!70 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !67, file: !2, line: 18, baseType: !35, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !67, file: !2, line: 19, baseType: !73, size: 8, align: 8)
!73 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !67, file: !2, line: 20, baseType: !75, size: 128, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !76)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !77, identifier: "char[]")
!77 = !{!78, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !76, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !76, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !82)
!82 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !67, file: !2, line: 21, baseType: !21, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !67, file: !2, line: 22, baseType: !85, size: 320, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !2, file: !2, line: 466, baseType: !86, align: 8)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !87, identifier: "std_collections_list$p$std.collections.object.Object$.List")
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !86, file: !2, line: 20, baseType: !81, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !86, file: !2, line: 21, baseType: !81, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !86, file: !2, line: 22, baseType: !25, size: 128, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !86, file: !2, line: 23, baseType: !92, size: 64, align: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !93, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 466, baseType: !61, align: 8)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !67, file: !2, line: 23, baseType: !95, size: 384, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !2, file: !2, line: 465, baseType: !96, align: 8)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !2, file: !2, line: 29, size: 384, align: 64, elements: !97, identifier: "std_collections_map$String$p$std.collections.object.Object$.HashMap")
!97 = !{!98, !113, !114, !115, !116}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !96, file: !2, line: 31, baseType: !99, size: 128, align: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !100, identifier: "Entry*[]")
!100 = !{!101, !112}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !99, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !103, size: 64, align: 64, dwarfAddressSpace: 0)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !104, size: 64, align: 64, dwarfAddressSpace: 0)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !2, file: !2, line: 21, size: 320, align: 64, elements: !105, identifier: "std_collections_map$String$p$std.collections.object.Object$.Entry")
!105 = !{!106, !107, !109, !111}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !104, file: !2, line: 23, baseType: !16, size: 32, align: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !104, file: !2, line: 24, baseType: !108, size: 128, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !2, file: !2, line: 465, baseType: !75, align: 8)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !104, file: !2, line: 25, baseType: !110, size: 64, align: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !2, file: !2, line: 465, baseType: !61, align: 8)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !2, line: 26, baseType: !103, size: 64, align: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !99, baseType: !81, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !96, file: !2, line: 32, baseType: !25, size: 128, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !96, file: !2, line: 33, baseType: !16, size: 32, align: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !96, file: !2, line: 34, baseType: !16, size: 32, align: 32, offset: 288)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !96, file: !2, line: 35, baseType: !117, size: 32, align: 32, offset: 320)
!117 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!118 = !{}
!119 = !DILocalVariable(name: "allocator", arg: 1, scope: !55, file: !2, line: 12, type: !25)
!120 = !DILocation(line: 12, scope: !55)
!121 = !DILocalVariable(name: "s", arg: 2, scope: !55, file: !2, line: 12, type: !75)
!122 = !DILocation(line: 14, scope: !55)
!123 = distinct !DISubprogram(name: "tparse_string", linkageName: "std.encoding.json.tparse_string", scope: !2, file: !2, line: 17, type: !124, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !118)
!124 = !DISubroutineType(types: !125)
!125 = !{!58, !60, !75}
!126 = !DILocalVariable(name: "s", arg: 1, scope: !123, file: !2, line: 17, type: !75)
!127 = !DILocation(line: 17, scope: !123)
!128 = !DILocation(line: 19, scope: !123)
!129 = distinct !DISubprogram(name: "parse", linkageName: "std.encoding.json.parse", scope: !2, file: !2, line: 22, type: !130, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !118)
!130 = !DISubroutineType(types: !131)
!131 = !{!58, !60, !25, !18}
!132 = !DILocalVariable(name: "allocator", arg: 1, scope: !129, file: !2, line: 22, type: !25)
!133 = !DILocation(line: 22, scope: !129)
!134 = !DILocalVariable(name: "s", arg: 2, scope: !129, file: !2, line: 22, type: !18)
!135 = !DILocalVariable(name: "buffer", scope: !136, file: !2, line: 572, type: !138, align: 16)
!136 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !137, file: !137, line: 570, scopeLine: 570, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !118)
!137 = !DIFile(filename: "mem.c3", directory: "C:/Compilers/C3/lib/std/core")
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 4096, align: 8, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 512, lowerBound: 0)
!141 = !DILocation(line: 572, scope: !136, inlinedAt: !142)
!142 = !DILocation(line: 24, scope: !129)
!143 = !DILocalVariable(name: "allocator", scope: !136, file: !2, line: 573, type: !144, align: 8)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 12, size: 384, align: 64, elements: !145, identifier: "std.core.mem.allocator.OnStackAllocator")
!145 = !{!146, !147, !148, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !144, file: !2, line: 14, baseType: !25, size: 128, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !2, line: 15, baseType: !76, size: 128, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !144, file: !2, line: 16, baseType: !81, size: 64, align: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !144, file: !2, line: 17, baseType: !150, size: 64, align: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !151, size: 64, align: 64, dwarfAddressSpace: 0)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !152, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.8319")
!152 = !{!153, !154, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !151, file: !2, line: 22, baseType: !73, size: 8, align: 8)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !151, file: !2, line: 23, baseType: !150, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !151, file: !2, line: 24, baseType: !21, size: 64, align: 64, offset: 128)
!156 = !DILocation(line: 573, scope: !136, inlinedAt: !142)
!157 = !DILocation(line: 574, scope: !136, inlinedAt: !142)
!158 = !DILocalVariable(name: "smem", scope: !129, file: !2, line: 24, type: !25, align: 8)
!159 = !DILocation(line: 576, scope: !160, inlinedAt: !142)
!160 = distinct !DILexicalBlock(scope: !136, file: !137, line: 576, column: 2)
!161 = !DILocalVariable(name: "context", scope: !162, file: !2, line: 26, type: !13, align: 8)
!162 = distinct !DILexicalBlock(scope: !129, file: !2, line: 25, column: 2)
!163 = !DILocation(line: 26, scope: !162)
!164 = !DILocalVariable(name: "state", scope: !165, file: !2, line: 641, type: !166, align: 8)
!165 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !137, file: !137, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !118)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 403, baseType: !167, align: 8)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !168, size: 64, align: 64, dwarfAddressSpace: 0)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !169, identifier: "std.core.mem.allocator.TempAllocator")
!169 = !{!170, !171, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !168, file: !2, line: 33, baseType: !25, size: 128, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !168, file: !2, line: 34, baseType: !172, size: 64, align: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !173, size: 64, align: 64, dwarfAddressSpace: 0)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !174, identifier: "std.core.mem.allocator.TempAllocatorPage")
!174 = !{!175, !176, !177, !178, !179}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !173, file: !2, line: 56, baseType: !172, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !173, file: !2, line: 57, baseType: !21, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !173, file: !2, line: 58, baseType: !81, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !173, file: !2, line: 59, baseType: !81, size: 64, align: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !2, line: 60, baseType: !180, align: 8, offset: 256)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, align: 8, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 0, lowerBound: 0)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !168, file: !2, line: 35, baseType: !167, size: 64, align: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !168, file: !2, line: 36, baseType: !73, size: 8, align: 8, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !168, file: !2, line: 37, baseType: !81, size: 64, align: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !168, file: !2, line: 38, baseType: !81, size: 64, align: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !168, file: !2, line: 39, baseType: !81, size: 64, align: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !168, file: !2, line: 40, baseType: !81, size: 64, align: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !168, file: !2, line: 41, baseType: !81, size: 64, align: 64, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !168, file: !2, line: 42, baseType: !81, size: 64, align: 64, offset: 640)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !168, file: !2, line: 43, baseType: !180, align: 8, offset: 704)
!192 = !DILocation(line: 641, scope: !165, inlinedAt: !193)
!193 = !DILocation(line: 27, scope: !162)
!194 = !DILocalVariable(name: "o", scope: !195, file: !2, line: 29, type: !61, align: 8)
!195 = distinct !DILexicalBlock(scope: !162, file: !2, line: 28, column: 3)
!196 = !DILocation(line: 29, scope: !195)
!197 = !DILocation(line: 644, scope: !198, inlinedAt: !193)
!198 = distinct !DILexicalBlock(scope: !165, file: !137, line: 643, column: 2)
!199 = !DILocation(line: 575, scope: !200, inlinedAt: !142)
!200 = distinct !DILexicalBlock(scope: !136, file: !137, line: 575, column: 8)
!201 = !DILocation(line: 31, scope: !195)
!202 = !DILocalVariable(name: "c", scope: !203, file: !2, line: 31, type: !37, align: 1)
!203 = distinct !DILexicalBlock(scope: !195, file: !2, line: 31, column: 4)
!204 = !DILocation(line: 31, scope: !203)
!205 = !DILocation(line: 30, scope: !206)
!206 = distinct !DILexicalBlock(scope: !195, file: !2, line: 30, column: 16)
!207 = !DILocation(line: 644, scope: !208, inlinedAt: !193)
!208 = distinct !DILexicalBlock(scope: !165, file: !137, line: 643, column: 2)
!209 = !DILocation(line: 575, scope: !210, inlinedAt: !142)
!210 = distinct !DILexicalBlock(scope: !136, file: !137, line: 575, column: 8)
!211 = !DILocation(line: 16, scope: !212, inlinedAt: !214)
!212 = distinct !DISubprogram(name: "@is_space", linkageName: "@is_space", scope: !213, file: !213, line: 16, scopeLine: 16, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!213 = !DIFile(filename: "ascii.c3", directory: "C:/Compilers/C3/lib/std/core")
!214 = !DILocation(line: 51, scope: !215, inlinedAt: !216)
!215 = distinct !DISubprogram(name: "is_space", linkageName: "is_space", scope: !213, file: !213, line: 51, scopeLine: 51, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!216 = !DILocation(line: 33, scope: !217)
!217 = distinct !DILexicalBlock(scope: !203, file: !2, line: 32, column: 4)
!218 = !DILocation(line: 30, scope: !219)
!219 = distinct !DILexicalBlock(scope: !195, file: !2, line: 30, column: 16)
!220 = !DILocation(line: 644, scope: !221, inlinedAt: !193)
!221 = distinct !DILexicalBlock(scope: !165, file: !137, line: 643, column: 2)
!222 = !DILocation(line: 575, scope: !223, inlinedAt: !142)
!223 = distinct !DILexicalBlock(scope: !136, file: !137, line: 575, column: 8)
!224 = !DILocalVariable(name: "f", scope: !225, file: !2, line: 422, type: !58, align: 8)
!225 = distinct !DISubprogram(name: "@catch", linkageName: "@catch", scope: !226, file: !226, line: 420, scopeLine: 420, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !118)
!226 = !DIFile(filename: "builtin.c3", directory: "C:/Compilers/C3/lib/std/core")
!227 = !DILocation(line: 422, scope: !225, inlinedAt: !228)
!228 = !DILocation(line: 36, scope: !195)
!229 = !DILocation(line: 36, scope: !225, inlinedAt: !228)
!230 = !DILocation(line: 423, scope: !225, inlinedAt: !228)
!231 = !DILocation(line: 30, scope: !232)
!232 = distinct !DILexicalBlock(scope: !195, file: !2, line: 30, column: 16)
!233 = !DILocation(line: 644, scope: !234, inlinedAt: !193)
!234 = distinct !DILexicalBlock(scope: !165, file: !137, line: 643, column: 2)
!235 = !DILocation(line: 575, scope: !236, inlinedAt: !142)
!236 = distinct !DILexicalBlock(scope: !136, file: !137, line: 575, column: 8)
!237 = !DILocation(line: 37, scope: !195)
!238 = !DILocation(line: 644, scope: !239, inlinedAt: !193)
!239 = distinct !DILexicalBlock(scope: !165, file: !137, line: 643, column: 2)
!240 = !DILocation(line: 575, scope: !241, inlinedAt: !142)
!241 = distinct !DILexicalBlock(scope: !136, file: !137, line: 575, column: 8)
!242 = distinct !DISubprogram(name: "tparse", linkageName: "std.encoding.json.tparse", scope: !2, file: !2, line: 42, type: !243, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !118)
