; ModuleID = 'std::os::env'
source_filename = "std::os::env"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"any[]" = type { ptr, i64 }
%PathImp = type { %"char[]", i32, %any }

$std.os.env.get_var = comdat any

$std.os.env.tget_var = comdat any

$std.os.env.set_var = comdat any

$std.os.env.get_home_dir = comdat any

$std.os.env.get_config_dir = comdat any

$std.os.env.clear_var = comdat any

$std.os.env.executable_path = comdat any

$std.core.builtin.NOT_FOUND = comdat any

$"$ct.fault" = comdat any

@.panic_msg = internal constant [34 x i8] c"@require \22name.len > 0\22 violated.\00", align 1
@.file = internal constant [7 x i8] c"env.c3\00", align 1
@.func = internal constant [8 x i8] c"get_var\00", align 1
@std.core.builtin.panic = external global ptr, align 8
@get_var.BUFSIZE = internal unnamed_addr constant i64 1024, align 8, !dbg !0
@std.core.builtin.NOT_FOUND = linkonce constant %"char[]" { ptr @std.core.builtin.NOT_FOUND.nameof, i64 18 }, comdat, align 8
@std.core.builtin.NOT_FOUND.nameof = internal constant [19 x i8] c"builtin::NOT_FOUND\00", align 1
@std.core.mem.allocator.current_temp = external thread_local global %any, align 8
@.func.1 = internal constant [9 x i8] c"tget_var\00", align 1
@.func.2 = internal constant [8 x i8] c"set_var\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BUFSIZE", linkageName: "get_var.BUFSIZE", scope: !2, file: !2, line: 21, type: !3, isLocal: true, isDefinition: true, align: 8)
!2 = !DIFile(filename: "env.c3", directory: "C:/Compilers/C3/lib/std/os")
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !4)
!4 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!5 = !{i32 1, !"CodeView", i32 1}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 2, !"wchar_size", i32 2}
!8 = !{i32 4, !"PIC Level", i32 2}
!9 = !{i32 1, !"uwtable", i32 2}
!10 = !{i32 1, !"MaxTLSAlign", i32 65536}
!11 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !12, globals: !36, splitDebugInlining: false)
!12 = !{!13}
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !14, file: !2, line: 23, baseType: !32, size: 32, align: 32, elements: !33)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !2, file: !2, line: 16, size: 320, align: 64, elements: !15, identifier: "std.io.path.PathImp")
!15 = !{!16, !24, !25}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !14, file: !2, line: 18, baseType: !17, size: 128, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !19, identifier: "char[]")
!19 = !{!20, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !18, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !18, baseType: !3, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !14, file: !2, line: 19, baseType: !13, size: 32, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !14, file: !2, line: 20, baseType: !26, size: 128, align: 64, offset: 192)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !27, identifier: "Allocator")
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !26, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34, !35}
!34 = !DIEnumerator(name: "WIN32", value: 0)
!35 = !DIEnumerator(name: "POSIX", value: 1)
!36 = !{!0}
!37 = distinct !DISubprogram(name: "get_var", linkageName: "std.os.env.get_var", scope: !2, file: !2, line: 12, type: !38, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !11, retainedNodes: !43)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !42, !26, !17}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !41)
!41 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !17, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !{}
!44 = !DILocalVariable(name: "allocator", arg: 1, scope: !37, file: !2, line: 12, type: !26)
!45 = !DILocation(line: 12, scope: !37)
!46 = !DILocalVariable(name: "name", arg: 2, scope: !37, file: !2, line: 12, type: !17)
!47 = !DILocation(line: 9, scope: !48)
!48 = distinct !DILexicalBlock(scope: !37, file: !2, line: 12, column: 57)
!49 = !DILocalVariable(name: "state", scope: !50, file: !2, line: 641, type: !52, align: 8)
!50 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !51, file: !51, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, retainedNodes: !43)
!51 = !DIFile(filename: "mem.c3", directory: "C:/Compilers/C3/lib/std/core")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 403, baseType: !53, align: 8)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !55, identifier: "std.core.mem.allocator.TempAllocator")
!55 = !{!56, !57, !69, !70, !72, !73, !74, !75, !76, !77, !78}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !54, file: !2, line: 33, baseType: !26, size: 128, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !54, file: !2, line: 34, baseType: !58, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !60, identifier: "std.core.mem.allocator.TempAllocatorPage")
!60 = !{!61, !62, !63, !64, !65}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !59, file: !2, line: 56, baseType: !58, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !59, file: !2, line: 57, baseType: !29, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !59, file: !2, line: 58, baseType: !3, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !59, file: !2, line: 59, baseType: !3, size: 64, align: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !2, line: 60, baseType: !66, align: 8, offset: 256)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 0, lowerBound: 0)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !54, file: !2, line: 35, baseType: !53, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !54, file: !2, line: 36, baseType: !71, size: 8, align: 8, offset: 256)
!71 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !54, file: !2, line: 37, baseType: !3, size: 64, align: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !54, file: !2, line: 38, baseType: !3, size: 64, align: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !54, file: !2, line: 39, baseType: !3, size: 64, align: 64, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !54, file: !2, line: 40, baseType: !3, size: 64, align: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !54, file: !2, line: 41, baseType: !3, size: 64, align: 64, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !54, file: !2, line: 42, baseType: !3, size: 64, align: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !2, line: 43, baseType: !66, align: 8, offset: 704)
!79 = !DILocation(line: 641, scope: !50, inlinedAt: !45)
!80 = !DILocalVariable(name: "buff", scope: !81, file: !2, line: 22, type: !82, align: 8)
!81 = distinct !DILexicalBlock(scope: !37, file: !2, line: 13, column: 1)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "WString", scope: !2, file: !2, line: 23, baseType: !83, align: 8)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ushort*", baseType: !84, size: 64, align: 64, dwarfAddressSpace: 0)
!84 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!85 = !DILocation(line: 22, scope: !81)
!86 = !DILocalVariable(name: "wstr", scope: !81, file: !2, line: 23, type: !82, align: 8)
!87 = !DILocation(line: 23, scope: !81)
!88 = !DILocation(line: 644, scope: !89, inlinedAt: !45)
!89 = distinct !DILexicalBlock(scope: !50, file: !51, line: 643, column: 2)
!90 = !DILocalVariable(name: "len", scope: !81, file: !2, line: 24, type: !3, align: 8)
!91 = !DILocation(line: 24, scope: !81)
!92 = !DILocation(line: 25, scope: !81)
!93 = !DILocation(line: 644, scope: !94, inlinedAt: !45)
!94 = distinct !DILexicalBlock(scope: !50, file: !51, line: 643, column: 2)
!95 = !DILocation(line: 26, scope: !81)
!96 = !DILocation(line: 28, scope: !97)
!97 = distinct !DILexicalBlock(scope: !81, file: !2, line: 27, column: 3)
!98 = !DILocation(line: 29, scope: !97)
!99 = !DILocation(line: 31, scope: !81)
!100 = !DILocation(line: 644, scope: !101, inlinedAt: !45)
!101 = distinct !DILexicalBlock(scope: !50, file: !51, line: 643, column: 2)
!102 = !DILocation(line: 644, scope: !103, inlinedAt: !45)
!103 = distinct !DILexicalBlock(scope: !50, file: !51, line: 643, column: 2)
!104 = distinct !DISubprogram(name: "tget_var", linkageName: "std.os.env.tget_var", scope: !2, file: !2, line: 37, type: !105, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !11, retainedNodes: !43)
!105 = !DISubroutineType(types: !106)
!106 = !{!40, !42, !17}
!107 = !DILocalVariable(name: "name", arg: 1, scope: !104, file: !2, line: 37, type: !17)
!108 = !DILocation(line: 37, scope: !104)
!109 = !DILocation(line: 39, scope: !104)
!110 = !DILocation(line: 9, scope: !104)
!111 = distinct !DISubprogram(name: "set_var", linkageName: "std.os.env.set_var", scope: !2, file: !2, line: 47, type: !112, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !11, retainedNodes: !43)
!112 = !DISubroutineType(types: !113)
!113 = !{!71, !17, !17, !71}
!114 = !DILocalVariable(name: "name", arg: 1, scope: !111, file: !2, line: 47, type: !17)
!115 = !DILocation(line: 47, scope: !111)
!116 = !DILocalVariable(name: "value", arg: 2, scope: !111, file: !2, line: 47, type: !17)
!117 = !DILocalVariable(name: "overwrite", arg: 3, scope: !111, file: !2, line: 47, type: !71)
!118 = !DILocation(line: 45, scope: !119)
!119 = distinct !DILexicalBlock(scope: !111, file: !2, line: 47, column: 70)
!120 = !DILocalVariable(name: "state", scope: !121, file: !2, line: 641, type: !52, align: 8)
!121 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !51, file: !51, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, retainedNodes: !43)
!122 = !DILocation(line: 641, scope: !121, inlinedAt: !115)
!123 = !DILocalVariable(name: "wname", scope: !124, file: !2, line: 51, type: !82, align: 8)
!124 = distinct !DILexicalBlock(scope: !111, file: !2, line: 48, column: 1)
!125 = !DILocation(line: 51, scope: !124)
!126 = !DILocation(line: 52, scope: !124)
!127 = !DILocalVariable(name: "buff", scope: !128, file: !2, line: 54, type: !129, align: 16)
!128 = distinct !DILexicalBlock(scope: !124, file: !2, line: 53, column: 3)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, align: 16, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 8, lowerBound: 0)
!132 = !DILocation(line: 54, scope: !128)
!133 = !DILocation(line: 55, scope: !128)
