; ModuleID = 'std::io::file'
source_filename = "std::io::file"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%File = type { ptr }
%PathImp = type { %"char[]", i32, %any }
%"any[]" = type { ptr, i64 }

$std.io.File.reopen = comdat any

$std.io.File.seek = comdat any

$std.io.File.write_byte = comdat any

$std.io.File.close = comdat any

$std.io.File.eof = comdat any

$std.io.File.read = comdat any

$std.io.File.write = comdat any

$std.io.File.read_byte = comdat any

$std.io.File.flush = comdat any

$std.io.File.fd = comdat any

$std.io.File.isatty = comdat any

$std.io.file.open = comdat any

$std.io.file.open_path = comdat any

$std.io.file.exists = comdat any

$std.io.file.from_handle = comdat any

$std.io.file.is_file = comdat any

$std.io.file.is_dir = comdat any

$std.io.file.get_size = comdat any

$std.io.file.delete = comdat any

$std.io.file.load_buffer = comdat any

$std.io.file.load = comdat any

$std.io.file.load_path = comdat any

$std.io.file.load_temp = comdat any

$std.io.file.load_path_temp = comdat any

$std.io.file.save = comdat any

$.dyn_search = comdat any

$std.io.OVERFLOW = comdat any

$"$ct.ulong" = comdat any

$"$sel.acquire" = comdat any

$"$sel.release" = comdat any

$std.io.FILE_NOT_VALID = comdat any

$std.io.INTERRUPTED = comdat any


!0 = !{i32 1, !"CodeView", i32 1}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 2}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 2}
!5 = !{i32 1, !"MaxTLSAlign", i32 65536}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "file.c3", directory: "C:/Compilers/C3/lib/std/io")
!8 = !{!9, !15}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Seek", scope: !7, file: !7, line: 7, baseType: !10, size: 32, align: 32, elements: !11)
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "SET", value: 0)
!13 = !DIEnumerator(name: "CURSOR", value: 1)
!14 = !DIEnumerator(name: "END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !16, file: !7, line: 23, baseType: !10, size: 32, align: 32, elements: !36)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !7, file: !7, line: 16, size: 320, align: 64, elements: !17, identifier: "std.io.path.PathImp")
!17 = !{!18, !28, !29}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !16, file: !7, line: 18, baseType: !19, size: 128, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !21, identifier: "char[]")
!21 = !{!22, !25}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !20, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !20, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !27)
!27 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !16, file: !7, line: 19, baseType: !15, size: 32, align: 32, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !16, file: !7, line: 20, baseType: !30, size: 128, align: 64, offset: 192)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !31, identifier: "Allocator")
!31 = !{!32, !34}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !30, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !30, baseType: !35, size: 64, align: 64, offset: 64)
!35 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!36 = !{!37, !38}
!37 = !DIEnumerator(name: "WIN32", value: 0)
!38 = !DIEnumerator(name: "POSIX", value: 1)
!39 = distinct !DISubprogram(name: "reopen", linkageName: "std.io.File.reopen", scope: !7, file: !7, line: 56, type: !40, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !33, !44, !19, !19}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !43)
!43 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "File*", baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !7, file: !7, line: 4, size: 64, align: 64, elements: !46, identifier: "std.io.File")
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !45, file: !7, line: 6, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !7, file: !7, line: 379, baseType: !33, align: 8)
!49 = !{}
!50 = !DILocation(line: 57, scope: !39)
!51 = !DILocalVariable(name: "self", arg: 1, scope: !39, file: !7, line: 56, type: !44)
!52 = !DILocation(line: 56, scope: !39)
!53 = !DILocalVariable(name: "filename", arg: 2, scope: !39, file: !7, line: 56, type: !19)
!54 = !DILocalVariable(name: "mode", arg: 3, scope: !39, file: !7, line: 56, type: !19)
!55 = !DILocation(line: 54, scope: !56)
!56 = distinct !DILexicalBlock(scope: !39, file: !7, line: 57, column: 1)
!57 = !DILocation(line: 58, scope: !39)
!58 = !DILocation(line: 39, scope: !39)
!59 = !DILocation(line: 40, scope: !39)
!60 = distinct !DISubprogram(name: "seek", linkageName: "std.io.File.seek", scope: !7, file: !7, line: 64, type: !61, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!61 = !DISubroutineType(types: !62)
!62 = !{!42, !63, !44, !43, !9}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!64 = !DILocation(line: 65, scope: !60)
!65 = !DILocalVariable(name: "self", arg: 1, scope: !60, file: !7, line: 64, type: !44)
!66 = !DILocation(line: 64, scope: !60)
!67 = !DILocalVariable(name: "offset", arg: 2, scope: !60, file: !7, line: 64, type: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !43)
!69 = !DILocalVariable(name: "seek_mode", arg: 3, scope: !60, file: !7, line: 64, type: !9)
!70 = !DILocation(line: 62, scope: !71)
!71 = distinct !DILexicalBlock(scope: !60, file: !7, line: 65, column: 1)
!72 = !DILocation(line: 66, scope: !60)
!73 = !DILocation(line: 67, scope: !60)
!74 = distinct !DISubprogram(name: "write_byte", linkageName: "std.io.File.write_byte", scope: !7, file: !7, line: 90, type: !75, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!75 = !DISubroutineType(types: !76)
!76 = !{!42, !33, !44, !24}
!77 = !DILocation(line: 91, scope: !74)
!78 = !DILocalVariable(name: "self", arg: 1, scope: !74, file: !7, line: 90, type: !44)
!79 = !DILocation(line: 90, scope: !74)
!80 = !DILocalVariable(name: "c", arg: 2, scope: !74, file: !7, line: 90, type: !24)
!81 = !DILocation(line: 88, scope: !82)
!82 = distinct !DILexicalBlock(scope: !74, file: !7, line: 91, column: 1)
!83 = !DILocation(line: 92, scope: !74)
!84 = distinct !DISubprogram(name: "close", linkageName: "std.io.File.close", scope: !7, file: !7, line: 98, type: !85, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!85 = !DISubroutineType(types: !86)
!86 = !{!42, !33, !44}
!87 = !DILocation(line: 99, scope: !84)
!88 = !DILocalVariable(name: "self", arg: 1, scope: !84, file: !7, line: 98, type: !44)
!89 = !DILocation(line: 98, scope: !84)
!90 = !DILocation(line: 100, scope: !84)
!91 = !DILocation(line: 102, scope: !92)
!92 = distinct !DILexicalBlock(scope: !93, file: !7, line: 102, column: 3)
!93 = distinct !DILexicalBlock(scope: !84, file: !7, line: 101, column: 2)
!94 = !DILocation(line: 105, scope: !95)
!95 = distinct !DILexicalBlock(scope: !92, file: !7, line: 105, column: 23)
!96 = !DILocation(line: 106, scope: !97)
!97 = distinct !DILexicalBlock(scope: !92, file: !7, line: 106, column: 23)
!98 = !DILocation(line: 114, scope: !99)
!99 = distinct !DILexicalBlock(scope: !92, file: !7, line: 114, column: 21)
!100 = !DILocation(line: 115, scope: !101)
!101 = distinct !DILexicalBlock(scope: !92, file: !7, line: 115, column: 13)
!102 = !DILocation(line: 118, scope: !84)
!103 = distinct !DISubprogram(name: "eof", linkageName: "std.io.File.eof", scope: !7, file: !7, line: 124, type: !104, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!104 = !DISubroutineType(types: !105)
!105 = !{!106, !44}
!106 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!107 = !DILocation(line: 125, scope: !103)
!108 = !DILocalVariable(name: "self", arg: 1, scope: !103, file: !7, line: 124, type: !44)
!109 = !DILocation(line: 124, scope: !103)
!110 = !DILocation(line: 122, scope: !111)
!111 = distinct !DILexicalBlock(scope: !103, file: !7, line: 125, column: 1)
!112 = !DILocation(line: 126, scope: !103)
!113 = distinct !DISubprogram(name: "read", linkageName: "std.io.File.read", scope: !7, file: !7, line: 132, type: !114, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!114 = !DISubroutineType(types: !115)
!115 = !{!42, !63, !44, !20}
!116 = !DILocation(line: 133, scope: !113)
!117 = !DILocalVariable(name: "self", arg: 1, scope: !113, file: !7, line: 132, type: !44)
!118 = !DILocation(line: 132, scope: !113)
!119 = !DILocalVariable(name: "buffer", arg: 2, scope: !113, file: !7, line: 132, type: !20)
!120 = !DILocation(line: 134, scope: !113)
!121 = distinct !DISubprogram(name: "write", linkageName: "std.io.File.write", scope: !7, file: !7, line: 141, type: !114, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!122 = !DILocation(line: 142, scope: !121)
!123 = !DILocalVariable(name: "self", arg: 1, scope: !121, file: !7, line: 141, type: !44)
!124 = !DILocation(line: 141, scope: !121)
!125 = !DILocalVariable(name: "buffer", arg: 2, scope: !121, file: !7, line: 141, type: !20)
!126 = !DILocation(line: 139, scope: !127)
!127 = distinct !DILexicalBlock(scope: !121, file: !7, line: 142, column: 1)
!128 = !DILocation(line: 143, scope: !121)
!129 = distinct !DISubprogram(name: "read_byte", linkageName: "std.io.File.read_byte", scope: !7, file: !7, line: 156, type: !130, scopeLine: 156, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!130 = !DISubroutineType(types: !131)
!131 = !{!42, !23, !44}
!132 = !DILocation(line: 157, scope: !129)
!133 = !DILocalVariable(name: "self", arg: 1, scope: !129, file: !7, line: 156, type: !44)
!134 = !DILocation(line: 156, scope: !129)
!135 = !DILocalVariable(name: "c", scope: !129, file: !7, line: 158, type: !10, align: 4)
!136 = !DILocation(line: 158, scope: !129)
!137 = !DILocation(line: 159, scope: !129)
!138 = !DILocation(line: 160, scope: !129)
!139 = distinct !DISubprogram(name: "flush", linkageName: "std.io.File.flush", scope: !7, file: !7, line: 222, type: !85, scopeLine: 222, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!140 = !DILocation(line: 223, scope: !139)
!141 = !DILocalVariable(name: "self", arg: 1, scope: !139, file: !7, line: 222, type: !44)
!142 = !DILocation(line: 222, scope: !139)
!143 = !DILocation(line: 220, scope: !144)
!144 = distinct !DILexicalBlock(scope: !139, file: !7, line: 223, column: 1)
!145 = !DILocation(line: 224, scope: !139)
!146 = distinct !DISubprogram(name: "fd", linkageName: "std.io.File.fd", scope: !7, file: !7, line: 146, type: !147, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!147 = !DISubroutineType(types: !148)
!148 = !{!149, !45}
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "Fd", scope: !7, file: !7, line: 56, baseType: !10, align: 4)
!150 = !DILocalVariable(name: "self", arg: 1, scope: !146, file: !7, line: 146, type: !45)
!151 = !DILocation(line: 146, scope: !146)
!152 = !DILocation(line: 148, scope: !146)
!153 = distinct !DISubprogram(name: "isatty", linkageName: "std.io.File.isatty", scope: !7, file: !7, line: 151, type: !154, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!154 = !DISubroutineType(types: !155)
!155 = !{!106, !45}
!156 = !DILocalVariable(name: "self", arg: 1, scope: !153, file: !7, line: 151, type: !45)
!157 = !DILocation(line: 151, scope: !153)
!158 = !DILocation(line: 153, scope: !153)
!159 = distinct !DISubprogram(name: "open", linkageName: "std.io.file.open", scope: !7, file: !7, line: 12, type: !160, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!160 = !DISubroutineType(types: !161)
!161 = !{!42, !44, !19, !19}
!162 = !DILocalVariable(name: "filename", arg: 1, scope: !159, file: !7, line: 12, type: !19)
!163 = !DILocation(line: 12, scope: !159)
!164 = !DILocalVariable(name: "mode", arg: 2, scope: !159, file: !7, line: 12, type: !19)
!165 = !DILocation(line: 14, scope: !159)
!166 = !DILocation(line: 5, scope: !159)
!167 = !DILocation(line: 6, scope: !159)
!168 = distinct !DISubprogram(name: "open_path", linkageName: "std.io.file.open_path", scope: !7, file: !7, line: 17, type: !169, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!169 = !DISubroutineType(types: !170)
!170 = !{!42, !44, !16, !19}
!171 = !DILocalVariable(name: "path", arg: 1, scope: !168, file: !7, line: 17, type: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "Path", scope: !7, file: !7, line: 14, baseType: !16, align: 8)
!173 = !DILocation(line: 17, scope: !168)
!174 = !DILocalVariable(name: "mode", arg: 2, scope: !168, file: !7, line: 17, type: !19)
!175 = !DILocation(line: 19, scope: !168)
!176 = !DILocation(line: 5, scope: !168)
!177 = !DILocation(line: 6, scope: !168)
!178 = distinct !DISubprogram(name: "exists", linkageName: "std.io.file.exists", scope: !7, file: !7, line: 22, type: !179, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!179 = !DISubroutineType(types: !180)
!180 = !{!106, !19}
!181 = !DILocalVariable(name: "file", arg: 1, scope: !178, file: !7, line: 22, type: !19)
!182 = !DILocation(line: 22, scope: !178)
!183 = !DILocalVariable(name: "state", scope: !184, file: !7, line: 641, type: !186, align: 8)
!184 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !185, file: !185, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !49)
!185 = !DIFile(filename: "mem.c3", directory: "C:/Compilers/C3/lib/std/core")
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !7, file: !7, line: 403, baseType: !187, align: 8)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !188, size: 64, align: 64, dwarfAddressSpace: 0)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !7, file: !7, line: 31, size: 704, align: 64, elements: !189, identifier: "std.core.mem.allocator.TempAllocator")
!189 = !{!190, !191, !203, !204, !205, !206, !207, !208, !209, !210, !211}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !188, file: !7, line: 33, baseType: !30, size: 128, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !188, file: !7, line: 34, baseType: !192, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !193, size: 64, align: 64, dwarfAddressSpace: 0)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !7, file: !7, line: 54, size: 256, align: 64, elements: !194, identifier: "std.core.mem.allocator.TempAllocatorPage")
!194 = !{!195, !196, !197, !198, !199}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !193, file: !7, line: 56, baseType: !192, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !193, file: !7, line: 57, baseType: !33, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !193, file: !7, line: 58, baseType: !26, size: 64, align: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !193, file: !7, line: 59, baseType: !26, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !193, file: !7, line: 60, baseType: !200, align: 8, offset: 256)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, align: 8, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 0, lowerBound: 0)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !188, file: !7, line: 35, baseType: !187, size: 64, align: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !188, file: !7, line: 36, baseType: !106, size: 8, align: 8, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !188, file: !7, line: 37, baseType: !26, size: 64, align: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !188, file: !7, line: 38, baseType: !26, size: 64, align: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !188, file: !7, line: 39, baseType: !26, size: 64, align: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !188, file: !7, line: 40, baseType: !26, size: 64, align: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !188, file: !7, line: 41, baseType: !26, size: 64, align: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !188, file: !7, line: 42, baseType: !26, size: 64, align: 64, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !7, line: 43, baseType: !200, align: 8, offset: 704)
!212 = !DILocation(line: 641, scope: !184, inlinedAt: !182)
!213 = !DILocation(line: 24, scope: !214)
!214 = distinct !DILexicalBlock(scope: !178, file: !7, line: 23, column: 1)
!215 = !DILocation(line: 644, scope: !216, inlinedAt: !182)
!216 = distinct !DILexicalBlock(scope: !184, file: !185, line: 643, column: 2)
!217 = distinct !DISubprogram(name: "from_handle", linkageName: "std.io.file.from_handle", scope: !7, file: !7, line: 27, type: !218, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!218 = !DISubroutineType(types: !219)
!219 = !{!45, !33}
!220 = !DILocalVariable(name: "file", arg: 1, scope: !217, file: !7, line: 27, type: !48)
!221 = !DILocation(line: 27, scope: !217)
!222 = !DILocation(line: 29, scope: !217)
!223 = distinct !DISubprogram(name: "is_file", linkageName: "std.io.file.is_file", scope: !7, file: !7, line: 32, type: !179, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!224 = !DILocalVariable(name: "path", arg: 1, scope: !223, file: !7, line: 32, type: !19)
!225 = !DILocation(line: 32, scope: !223)
!226 = !DILocation(line: 34, scope: !223)
!227 = distinct !DISubprogram(name: "is_dir", linkageName: "std.io.file.is_dir", scope: !7, file: !7, line: 37, type: !179, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!228 = !DILocalVariable(name: "path", arg: 1, scope: !227, file: !7, line: 37, type: !19)
!229 = !DILocation(line: 37, scope: !227)
!230 = !DILocation(line: 39, scope: !227)
!231 = distinct !DISubprogram(name: "get_size", linkageName: "std.io.file.get_size", scope: !7, file: !7, line: 42, type: !232, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!232 = !DISubroutineType(types: !233)
!233 = !{!42, !63, !19}
!234 = !DILocalVariable(name: "path", arg: 1, scope: !231, file: !7, line: 42, type: !19)
!235 = !DILocation(line: 42, scope: !231)
!236 = !DILocation(line: 44, scope: !231)
!237 = distinct !DISubprogram(name: "delete", linkageName: "std.io.file.delete", scope: !7, file: !7, line: 47, type: !238, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!238 = !DISubroutineType(types: !239)
!239 = !{!42, !33, !19}
!240 = !DILocalVariable(name: "filename", arg: 1, scope: !237, file: !7, line: 47, type: !19)
!241 = !DILocation(line: 47, scope: !237)
!242 = !DILocation(line: 49, scope: !237)
!243 = distinct !DISubprogram(name: "load_buffer", linkageName: "std.io.file.load_buffer", scope: !7, file: !7, line: 170, type: !244, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !49)
!244 = !DISubroutineType(types: !245)
!245 = !{!42, !246, !19, !20}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char[]*", baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!247 = !DILocalVariable(name: "filename", arg: 1, scope: !243, file: !7, line: 170, type: !19)
!248 = !DILocation(line: 170, scope: !243)
!249 = !DILocalVariable(name: "buffer", arg: 2, scope: !243, file: !7, line: 170, type: !20)
!250 = !DILocalVariable(name: "file", scope: !243, file: !7, line: 172, type: !45, align: 8)
!251 = !DILocation(line: 172, scope: !243)
!252 = !DILocalVariable(name: "len", scope: !243, file: !7, line: 174, type: !26, align: 8)
!253 = !DILocation(line: 174, scope: !243)
!254 = !DILocation(line: 62, scope: !243)
!255 = !DILocation(line: 173, scope: !256)
!256 = distinct !DILexicalBlock(scope: !243, file: !7, line: 173, column: 8)
!257 = !DILocation(line: 175, scope: !243)
!258 = !DILocation(line: 173, scope: !259)
!259 = distinct !DILexicalBlock(scope: !243, file: !7, line: 173, column: 8)
!260 = !DILocation(line: 176, scope: !243)
!261 = !DILocation(line: 173, scope: !262)
