; ModuleID = 'std::compression::qoi'
source_filename = "std::compression::qoi"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Header = type <{ i32, i32, i32, i8, i8 }>
%OpRGBA = type { i8, i8, i8, i8, i8 }
%OpRGB = type { i8, i8, i8, i8 }

$std.compression.qoi.write = comdat any

$std.compression.qoi.read = comdat any

$std.compression.qoi.encode = comdat any

$std.compression.qoi.decode = comdat any

$.dyn_search = comdat any

$"$ct.std.compression.qoi.QOIDesc" = comdat any

$"$ct.char" = comdat any

$"$ct.std.compression.qoi.QOIColorspace" = comdat any

$"std.compression.qoi.QOIColorspace$id" = comdat any

$"$ct.std.compression.qoi.QOIChannels" = comdat any

$"std.compression.qoi.QOIChannels$id" = comdat any

$"$ct.std.compression.qoi.Header" = comdat any

$"$ct.std.compression.qoi.Pixel" = comdat any

$"$ct.v4$char" = comdat any

$"$ct.std.compression.qoi.OpRGB" = comdat any

$"$ct.std.compression.qoi.OpRGBA" = comdat any

$"$ct.std.compression.qoi.OpIndex" = comdat any

$"$ct.std.compression.qoi.OpDiff" = comdat any

$"$ct.std.compression.qoi.OpLuma" = comdat any

$"$ct.ushort" = comdat any

$"$ct.std.compression.qoi.OpRun" = comdat any

$std.compression.qoi.PIXELS_MAX = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PIXELS_MAX", linkageName: "std.compression.qoi.PIXELS_MAX", scope: !2, file: !2, line: 3, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "qoi.c3", directory: "C:/Compilers/C3/lib/std/compression")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "OP_RGB", linkageName: "std.compression.qoi.OP_RGB", scope: !2, file: !2, line: 384, type: !3, isLocal: true, isDefinition: true, align: 4)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "OP_RGBA", linkageName: "std.compression.qoi.OP_RGBA", scope: !2, file: !2, line: 385, type: !3, isLocal: true, isDefinition: true, align: 4)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "OP_INDEX", linkageName: "std.compression.qoi.OP_INDEX", scope: !2, file: !2, line: 387, type: !3, isLocal: true, isDefinition: true, align: 4)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "OP_DIFF", linkageName: "std.compression.qoi.OP_DIFF", scope: !2, file: !2, line: 388, type: !3, isLocal: true, isDefinition: true, align: 4)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "OP_LUMA", linkageName: "std.compression.qoi.OP_LUMA", scope: !2, file: !2, line: 389, type: !3, isLocal: true, isDefinition: true, align: 4)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "OP_RUN", linkageName: "std.compression.qoi.OP_RUN", scope: !2, file: !2, line: 390, type: !3, isLocal: true, isDefinition: true, align: 4)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "END_OF_STREAM", linkageName: "std.compression.qoi.END_OF_STREAM", scope: !2, file: !2, line: 403, type: !18, isLocal: true, isDefinition: true, align: 1)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, align: 8, elements: !20)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !{!21}
!21 = !DISubrange(count: 8, lowerBound: 0)
!22 = !{i32 1, !"CodeView", i32 1}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 2, !"wchar_size", i32 2}
!25 = !{i32 4, !"PIC Level", i32 2}
!26 = !{i32 1, !"uwtable", i32 2}
!27 = !{i32 1, !"MaxTLSAlign", i32 65536}
!28 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, globals: !45, splitDebugInlining: false)
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QOIChannels", scope: !31, file: !2, line: 22, baseType: !19, size: 8, align: 8, elements: !41)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "QOIDesc", scope: !2, file: !2, line: 33, size: 96, align: 32, elements: !32, identifier: "std.compression.qoi.QOIDesc")
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !31, file: !2, line: 35, baseType: !3, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !31, file: !2, line: 36, baseType: !3, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !31, file: !2, line: 37, baseType: !30, size: 8, align: 8, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !31, file: !2, line: 38, baseType: !37, size: 8, align: 8, offset: 72)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QOIColorspace", scope: !31, file: !2, line: 10, baseType: !19, size: 8, align: 8, elements: !38)
!38 = !{!39, !40}
!39 = !DIEnumerator(name: "SRGB", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "LINEAR", value: 1, isUnsigned: true)
!41 = !{!42, !43, !44}
!42 = !DIEnumerator(name: "AUTO", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "RGB", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "RGBA", value: 2, isUnsigned: true)
!45 = !{!0, !4, !6, !8, !10, !12, !14, !16}
!46 = distinct !DISubprogram(name: "write", linkageName: "std.compression.qoi.write", scope: !2, file: !2, line: 66, type: !47, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !61)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !51, !54, !55, !60}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !50)
!50 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !53)
!53 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !56, identifier: "char[]")
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !55, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, baseType: !52, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "QOIDesc*", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !{}
!62 = !DILocalVariable(name: "filename", arg: 1, scope: !46, file: !2, line: 66, type: !54)
!63 = !DILocation(line: 66, scope: !46)
!64 = !DILocalVariable(name: "input", arg: 2, scope: !46, file: !2, line: 66, type: !55)
!65 = !DILocalVariable(name: "desc", arg: 3, scope: !46, file: !2, line: 66, type: !60)
!66 = !DILocalVariable(name: "state", scope: !67, file: !2, line: 641, type: !69, align: 8)
!67 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !68, file: !68, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!68 = !DIFile(filename: "mem.c3", directory: "C:/Compilers/C3/lib/std/core")
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 403, baseType: !70, align: 8)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !71, size: 64, align: 64, dwarfAddressSpace: 0)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !72, identifier: "std.core.mem.allocator.TempAllocator")
!72 = !{!73, !80, !92, !93, !95, !96, !97, !98, !99, !100, !101}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !71, file: !2, line: 33, baseType: !74, size: 128, align: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !75, identifier: "Allocator")
!75 = !{!76, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !74, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !71, file: !2, line: 34, baseType: !81, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !82, size: 64, align: 64, dwarfAddressSpace: 0)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !83, identifier: "std.core.mem.allocator.TempAllocatorPage")
!83 = !{!84, !85, !86, !87, !88}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !82, file: !2, line: 56, baseType: !81, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !82, file: !2, line: 57, baseType: !77, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !82, file: !2, line: 58, baseType: !52, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !82, file: !2, line: 59, baseType: !52, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !82, file: !2, line: 60, baseType: !89, align: 8, offset: 256)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, align: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 0, lowerBound: 0)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !71, file: !2, line: 35, baseType: !70, size: 64, align: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !71, file: !2, line: 36, baseType: !94, size: 8, align: 8, offset: 256)
!94 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !71, file: !2, line: 37, baseType: !52, size: 64, align: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !71, file: !2, line: 38, baseType: !52, size: 64, align: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !71, file: !2, line: 39, baseType: !52, size: 64, align: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !71, file: !2, line: 40, baseType: !52, size: 64, align: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !71, file: !2, line: 41, baseType: !52, size: 64, align: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !71, file: !2, line: 42, baseType: !52, size: 64, align: 64, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !71, file: !2, line: 43, baseType: !89, align: 8, offset: 704)
!102 = !DILocation(line: 641, scope: !67, inlinedAt: !63)
!103 = !DILocalVariable(name: "output", scope: !104, file: !2, line: 69, type: !55, align: 8)
!104 = distinct !DILexicalBlock(scope: !46, file: !2, line: 67, column: 1)
!105 = !DILocation(line: 69, scope: !104)
!106 = !DILocation(line: 644, scope: !107, inlinedAt: !63)
!107 = distinct !DILexicalBlock(scope: !67, file: !68, line: 643, column: 2)
!108 = !DILocation(line: 71, scope: !104)
!109 = !DILocation(line: 644, scope: !110, inlinedAt: !63)
!110 = distinct !DILexicalBlock(scope: !67, file: !68, line: 643, column: 2)
!111 = !DILocation(line: 72, scope: !104)
!112 = !DILocation(line: 644, scope: !113, inlinedAt: !63)
!113 = distinct !DILexicalBlock(scope: !67, file: !68, line: 643, column: 2)
!114 = distinct !DISubprogram(name: "read", linkageName: "std.compression.qoi.read", scope: !2, file: !2, line: 98, type: !115, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !61)
!115 = !DISubroutineType(types: !116)
!116 = !{!49, !117, !74, !54, !60, !30}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char[]*", baseType: !55, size: 64, align: 64, dwarfAddressSpace: 0)
!118 = !DILocalVariable(name: "allocator", arg: 1, scope: !114, file: !2, line: 98, type: !74)
!119 = !DILocation(line: 98, scope: !114)
!120 = !DILocalVariable(name: "filename", arg: 2, scope: !114, file: !2, line: 98, type: !54)
!121 = !DILocalVariable(name: "desc", arg: 3, scope: !114, file: !2, line: 98, type: !60)
!122 = !DILocalVariable(name: "channels", arg: 4, scope: !114, file: !2, line: 98, type: !30)
!123 = !DILocalVariable(name: "state", scope: !124, file: !2, line: 641, type: !69, align: 8)
!124 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !68, file: !68, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!125 = !DILocation(line: 641, scope: !124, inlinedAt: !119)
!126 = !DILocalVariable(name: "data", scope: !127, file: !2, line: 101, type: !55, align: 8)
!127 = distinct !DILexicalBlock(scope: !114, file: !2, line: 99, column: 1)
!128 = !DILocation(line: 101, scope: !127)
!129 = !DILocation(line: 644, scope: !130, inlinedAt: !119)
!130 = distinct !DILexicalBlock(scope: !124, file: !68, line: 643, column: 2)
!131 = !DILocation(line: 103, scope: !127)
!132 = !DILocation(line: 644, scope: !133, inlinedAt: !119)
!133 = distinct !DILexicalBlock(scope: !124, file: !68, line: 643, column: 2)
!134 = !DILocation(line: 644, scope: !135, inlinedAt: !119)
!135 = distinct !DILexicalBlock(scope: !124, file: !68, line: 643, column: 2)
!136 = distinct !DISubprogram(name: "encode", linkageName: "std.compression.qoi.encode", scope: !2, file: !2, line: 126, type: !137, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !61)
!137 = !DISubroutineType(types: !138)
!138 = !{!49, !117, !74, !55, !60}
!139 = !DILocalVariable(name: "allocator", arg: 1, scope: !136, file: !2, line: 126, type: !74)
!140 = !DILocation(line: 126, scope: !136)
!141 = !DILocalVariable(name: "input", arg: 2, scope: !136, file: !2, line: 126, type: !55)
!142 = !DILocation(line: 127, scope: !136)
!143 = !DILocalVariable(name: "desc", arg: 3, scope: !136, file: !2, line: 126, type: !60)
!144 = !DILocation(line: 129, scope: !136)
!145 = !DILocation(line: 130, scope: !136)
!146 = !DILocalVariable(name: "pixels", scope: !136, file: !2, line: 131, type: !3, align: 4)
!147 = !DILocation(line: 131, scope: !136)
!148 = !DILocation(line: 132, scope: !136)
!149 = !DILocalVariable(name: "image_size", scope: !136, file: !2, line: 135, type: !3, align: 4)
!150 = !DILocation(line: 135, scope: !136)
!151 = !DILocation(line: 136, scope: !136)
!152 = !DILocalVariable(name: "max_size", scope: !136, file: !2, line: 140, type: !3, align: 4)
!153 = !DILocation(line: 140, scope: !136)
!154 = !DILocalVariable(name: "output", scope: !136, file: !2, line: 141, type: !55, align: 8)
!155 = !DILocation(line: 141, scope: !136)
!156 = !DILocation(line: 304, scope: !157, inlinedAt: !159)
!157 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !158, file: !158, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!158 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Compilers/C3/lib/std/core")
!159 = !DILocation(line: 287, scope: !160, inlinedAt: !155)
!160 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !158, file: !158, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!161 = !DILocation(line: 80, scope: !162, inlinedAt: !156)
!162 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !158, file: !158, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!163 = !DILocation(line: 86, scope: !162, inlinedAt: !156)
!164 = !DILocation(line: 38, scope: !162, inlinedAt: !156)
!165 = !DILocation(line: 975, scope: !166, inlinedAt: !164)
!166 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !167, file: !167, line: 973, scopeLine: 973, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!167 = !DIFile(filename: "math.c3", directory: "C:/Compilers/C3/lib/std/math")
!168 = !DILocation(line: 11, scope: !169, inlinedAt: !171)
!169 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !170, file: !170, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!170 = !DIFile(filename: "bits.c3", directory: "C:/Compilers/C3/lib/std")
!171 = !DILocation(line: 146, scope: !136)
!172 = !DILocation(line: 147, scope: !136)
!173 = !DILocation(line: 11, scope: !174, inlinedAt: !172)
!174 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !170, file: !170, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!175 = !DILocation(line: 148, scope: !136)
!176 = !DILocation(line: 11, scope: !177, inlinedAt: !175)
!177 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !170, file: !170, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!178 = !DILocation(line: 149, scope: !136)
!179 = !DILocation(line: 150, scope: !136)
!180 = !DILocation(line: 145, scope: !136)
!181 = !DILocalVariable(name: "pos", scope: !136, file: !2, line: 153, type: !3, align: 4)
!182 = !DILocation(line: 153, scope: !136)
!183 = !DILocalVariable(name: "loc", scope: !136, file: !2, line: 154, type: !3, align: 4)
!184 = !DILocation(line: 154, scope: !136)
!185 = !DILocalVariable(name: "loc_end", scope: !136, file: !2, line: 155, type: !3, align: 4)
!186 = !DILocation(line: 155, scope: !136)
!187 = !DILocalVariable(name: "run_length", scope: !136, file: !2, line: 156, type: !19, align: 1)
!188 = !DILocation(line: 156, scope: !136)
!189 = !DILocalVariable(name: "palette", scope: !136, file: !2, line: 158, type: !190, align: 16)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 2048, align: 32, elements: !195)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixel", scope: !2, file: !2, line: 419, baseType: !192, align: 4)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 32, align: 8, flags: DIFlagVector, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 4, lowerBound: 0)
!195 = !{!196}
!196 = !DISubrange(count: 64, lowerBound: 0)
!197 = !DILocation(line: 158, scope: !136)
!198 = !DILocalVariable(name: "prev", scope: !136, file: !2, line: 159, type: !191, align: 4)
!199 = !DILocation(line: 159, scope: !136)
!200 = !DILocalVariable(name: "p", scope: !136, file: !2, line: 160, type: !191, align: 4)
!201 = !DILocation(line: 160, scope: !136)
!202 = !DILocalVariable(name: "diff", scope: !136, file: !2, line: 162, type: !203, align: 4)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 32, align: 8, flags: DIFlagVector, elements: !205)
!204 = !DIBasicType(name: "ichar", size: 8, encoding: DW_ATE_signed_char)
!205 = !{!206}
!206 = !DISubrange(count: 3, lowerBound: 0)
!207 = !DILocation(line: 162, scope: !136)
!208 = !DILocalVariable(name: "luma", scope: !136, file: !2, line: 163, type: !203, align: 4)
!209 = !DILocation(line: 163, scope: !136)
!210 = !DILocation(line: 166, scope: !211)
!211 = distinct !DILexicalBlock(scope: !136, file: !2, line: 166, column: 2)
!212 = !DILocation(line: 169, scope: !213)
!213 = distinct !DILexicalBlock(scope: !211, file: !2, line: 167, column: 2)
!214 = !DILocation(line: 172, scope: !213)
!215 = !DILocation(line: 173, scope: !213)
!216 = !DILocation(line: 176, scope: !213)
!217 = !DILocation(line: 178, scope: !218)
!218 = distinct !DILexicalBlock(scope: !213, file: !2, line: 177, column: 3)
!219 = !DILocation(line: 179, scope: !218)
!220 = !DILocation(line: 181, scope: !221)
!221 = distinct !DILexicalBlock(scope: !218, file: !2, line: 180, column: 4)
!222 = !DILocalVariable(name: "chunk", scope: !223, file: !2, line: 470, type: !224, align: 8)
!223 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 467, scopeLine: 467, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRun*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!225 = !DILocation(line: 470, scope: !223, inlinedAt: !220)
!226 = !DILocation(line: 471, scope: !223, inlinedAt: !220)
!227 = !DILocation(line: 472, scope: !223, inlinedAt: !220)
!228 = !DILocation(line: 182, scope: !221)
!229 = !DILocation(line: 184, scope: !218)
!230 = !DILocation(line: 187, scope: !213)
!231 = !DILocation(line: 189, scope: !232)
!232 = distinct !DILexicalBlock(scope: !213, file: !2, line: 188, column: 3)
!233 = !DILocalVariable(name: "chunk", scope: !234, file: !2, line: 470, type: !224, align: 8)
!234 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 467, scopeLine: 467, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!235 = !DILocation(line: 470, scope: !234, inlinedAt: !231)
!236 = !DILocation(line: 471, scope: !234, inlinedAt: !231)
!237 = !DILocation(line: 472, scope: !234, inlinedAt: !231)
!238 = !DILocation(line: 190, scope: !232)
!239 = !DILocation(line: 422, scope: !240, inlinedAt: !241)
!240 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 420, scopeLine: 420, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!241 = !DILocation(line: 196, scope: !242)
!242 = distinct !DILexicalBlock(scope: !213, file: !2, line: 193, column: 3)
!243 = !DILocation(line: 422, scope: !244, inlinedAt: !245)
!244 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 420, scopeLine: 420, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!245 = !DILocation(line: 199, scope: !246)
!246 = distinct !DILexicalBlock(scope: !242, file: !2, line: 197, column: 5)
!247 = !DILocalVariable(name: "chunk", scope: !248, file: !2, line: 470, type: !249, align: 8)
!248 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 467, scopeLine: 467, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpIndex*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!250 = !DILocation(line: 470, scope: !248, inlinedAt: !251)
!251 = !DILocation(line: 197, scope: !246)
!252 = !DILocation(line: 471, scope: !248, inlinedAt: !251)
!253 = !DILocation(line: 472, scope: !248, inlinedAt: !251)
!254 = !DILocation(line: 203, scope: !242)
!255 = !DILocation(line: 205, scope: !256)
!256 = distinct !DILexicalBlock(scope: !242, file: !2, line: 205, column: 5)
!257 = !DILocation(line: 206, scope: !256)
!258 = !DILocation(line: 207, scope: !256)
!259 = !DILocation(line: 208, scope: !256)
!260 = !DILocation(line: 212, scope: !261)
!261 = distinct !DILexicalBlock(scope: !256, file: !2, line: 209, column: 5)
!262 = !DILocation(line: 213, scope: !261)
!263 = !DILocation(line: 214, scope: !261)
!264 = !DILocalVariable(name: "chunk", scope: !265, file: !2, line: 470, type: !266, align: 8)
!265 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 467, scopeLine: 467, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpDiff*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!267 = !DILocation(line: 470, scope: !265, inlinedAt: !268)
!268 = !DILocation(line: 210, scope: !261)
!269 = !DILocation(line: 471, scope: !265, inlinedAt: !268)
!270 = !DILocation(line: 472, scope: !265, inlinedAt: !268)
!271 = !DILocation(line: 422, scope: !272, inlinedAt: !273)
!272 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 420, scopeLine: 420, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!273 = !DILocation(line: 216, scope: !261)
!274 = !DILocation(line: 217, scope: !261)
!275 = !DILocation(line: 220, scope: !256)
!276 = !DILocation(line: 221, scope: !256)
!277 = !DILocation(line: 222, scope: !256)
!278 = !DILocation(line: 223, scope: !256)
!279 = !DILocation(line: 227, scope: !280)
!280 = distinct !DILexicalBlock(scope: !256, file: !2, line: 224, column: 5)
!281 = !DILocation(line: 228, scope: !280)
!282 = !DILocation(line: 229, scope: !280)
!283 = !DILocalVariable(name: "chunk", scope: !284, file: !2, line: 470, type: !285, align: 8)
!284 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 467, scopeLine: 467, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpLuma*", baseType: !286, size: 64, align: 64, dwarfAddressSpace: 0)
!286 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!287 = !DILocation(line: 470, scope: !284, inlinedAt: !288)
!288 = !DILocation(line: 225, scope: !280)
!289 = !DILocation(line: 471, scope: !284, inlinedAt: !288)
!290 = !DILocation(line: 472, scope: !284, inlinedAt: !288)
!291 = !DILocation(line: 422, scope: !292, inlinedAt: !293)
!292 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 420, scopeLine: 420, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!293 = !DILocation(line: 231, scope: !280)
!294 = !DILocation(line: 232, scope: !280)
!295 = !DILocation(line: 234, scope: !256)
!296 = !DILocation(line: 238, scope: !297)
!297 = distinct !DILexicalBlock(scope: !242, file: !2, line: 238, column: 5)
!298 = !DILocation(line: 240, scope: !299)
!299 = distinct !DILexicalBlock(scope: !297, file: !2, line: 239, column: 5)
!300 = !DILocalVariable(name: "chunk", scope: !301, file: !2, line: 470, type: !302, align: 8)
!301 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 467, scopeLine: 467, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRGBA*", baseType: !303, size: 64, align: 64, dwarfAddressSpace: 0)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpRGBA", scope: !2, file: !2, line: 432, size: 40, align: 8, elements: !304, identifier: "std.compression.qoi.OpRGBA")
!304 = !{!305, !306, !307, !308, !309}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !303, file: !2, line: 434, baseType: !19, size: 8, align: 8)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !303, file: !2, line: 435, baseType: !19, size: 8, align: 8, offset: 8)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !303, file: !2, line: 436, baseType: !19, size: 8, align: 8, offset: 16)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !303, file: !2, line: 437, baseType: !19, size: 8, align: 8, offset: 24)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !303, file: !2, line: 438, baseType: !19, size: 8, align: 8, offset: 32)
!310 = !DILocation(line: 470, scope: !301, inlinedAt: !298)
!311 = !DILocation(line: 471, scope: !301, inlinedAt: !298)
!312 = !DILocation(line: 472, scope: !301, inlinedAt: !298)
!313 = !DILocation(line: 244, scope: !314)
!314 = distinct !DILexicalBlock(scope: !297, file: !2, line: 243, column: 5)
!315 = !DILocalVariable(name: "chunk", scope: !316, file: !2, line: 470, type: !317, align: 8)
!316 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 467, scopeLine: 467, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRGB*", baseType: !318, size: 64, align: 64, dwarfAddressSpace: 0)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpRGB", scope: !2, file: !2, line: 425, size: 32, align: 8, elements: !319, identifier: "std.compression.qoi.OpRGB")
!319 = !{!320, !321, !322, !323}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !318, file: !2, line: 427, baseType: !19, size: 8, align: 8)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !318, file: !2, line: 428, baseType: !19, size: 8, align: 8, offset: 8)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !318, file: !2, line: 429, baseType: !19, size: 8, align: 8, offset: 16)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !318, file: !2, line: 430, baseType: !19, size: 8, align: 8, offset: 24)
!324 = !DILocation(line: 470, scope: !316, inlinedAt: !313)
!325 = !DILocation(line: 471, scope: !316, inlinedAt: !313)
!326 = !DILocation(line: 472, scope: !316, inlinedAt: !313)
!327 = !DILocation(line: 422, scope: !328, inlinedAt: !329)
!328 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 420, scopeLine: 420, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!329 = !DILocation(line: 246, scope: !297)
!330 = !DILocation(line: 251, scope: !136)
!331 = !DILocation(line: 252, scope: !136)
!332 = !DILocation(line: 254, scope: !136)
!333 = distinct !DISubprogram(name: "decode", linkageName: "std.compression.qoi.decode", scope: !2, file: !2, line: 281, type: !334, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !61)
!334 = !DISubroutineType(types: !335)
!335 = !{!49, !117, !74, !55, !60, !30}
!336 = !DILocalVariable(name: "allocator", arg: 1, scope: !333, file: !2, line: 281, type: !74)
!337 = !DILocation(line: 281, scope: !333)
!338 = !DILocalVariable(name: "data", arg: 2, scope: !333, file: !2, line: 281, type: !55)
!339 = !DILocation(line: 282, scope: !333)
!340 = !DILocalVariable(name: "desc", arg: 3, scope: !333, file: !2, line: 281, type: !60)
!341 = !DILocalVariable(name: "channels", arg: 4, scope: !333, file: !2, line: 281, type: !30)
!342 = !DILocation(line: 284, scope: !333)
!343 = !DILocalVariable(name: "header", scope: !333, file: !2, line: 287, type: !344, align: 8)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Header*", baseType: !345, size: 64, align: 64, dwarfAddressSpace: 0)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Header", scope: !2, file: !2, line: 392, size: 112, align: 8, elements: !346, identifier: "std.compression.qoi.Header")
!346 = !{!347, !348, !349, !350, !351}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "be_magic", scope: !345, file: !2, line: 394, baseType: !3, size: 32, align: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "be_width", scope: !345, file: !2, line: 395, baseType: !3, size: 32, align: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "be_height", scope: !345, file: !2, line: 396, baseType: !3, size: 32, align: 32, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !345, file: !2, line: 399, baseType: !19, size: 8, align: 8, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !345, file: !2, line: 400, baseType: !19, size: 8, align: 8, offset: 104)
!352 = !DILocation(line: 287, scope: !333)
!353 = !DILocation(line: 290, scope: !333)
!354 = !DILocation(line: 11, scope: !355, inlinedAt: !353)
!355 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !170, file: !170, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!356 = !DILocation(line: 293, scope: !333)
!357 = !DILocation(line: 11, scope: !358, inlinedAt: !356)
!358 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !170, file: !170, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!359 = !DILocation(line: 294, scope: !333)
!360 = !DILocation(line: 11, scope: !361, inlinedAt: !359)
!361 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !170, file: !170, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!362 = !DILocation(line: 295, scope: !333)
!363 = !DILocalVariable(name: ".temp", scope: !364, file: !2, line: 412, type: !366, align: 1)
!364 = distinct !DILexicalBlock(scope: !365, file: !2, line: 412, column: 2)
!365 = distinct !DISubprogram(name: "@enumcast", linkageName: "@enumcast", scope: !2, file: !2, line: 410, scopeLine: 410, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 24, align: 8, elements: !205)
!367 = !DILocation(line: 412, scope: !364, inlinedAt: !362)
!368 = !DILocalVariable(name: ".temp", scope: !364, file: !2, line: 412, type: !52, align: 8)
!369 = !DILocalVariable(name: "value", scope: !370, file: !2, line: 412, type: !30, align: 1)
!370 = distinct !DILexicalBlock(scope: !364, file: !2, line: 413, column: 2)
!371 = !DILocation(line: 412, scope: !370, inlinedAt: !362)
!372 = !DILocation(line: 414, scope: !373, inlinedAt: !362)
!373 = distinct !DILexicalBlock(scope: !370, file: !2, line: 413, column: 2)
!374 = !DILocation(line: 416, scope: !365, inlinedAt: !362)
!375 = !DILocation(line: 296, scope: !333)
!376 = !DILocalVariable(name: ".temp", scope: !377, file: !2, line: 412, type: !379, align: 1)
!377 = distinct !DILexicalBlock(scope: !378, file: !2, line: 412, column: 2)
!378 = distinct !DISubprogram(name: "@enumcast", linkageName: "@enumcast", scope: !2, file: !2, line: 410, scopeLine: 410, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 16, align: 8, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 2, lowerBound: 0)
!382 = !DILocation(line: 412, scope: !377, inlinedAt: !375)
!383 = !DILocalVariable(name: ".temp", scope: !377, file: !2, line: 412, type: !52, align: 8)
!384 = !DILocalVariable(name: "value", scope: !385, file: !2, line: 412, type: !37, align: 1)
!385 = distinct !DILexicalBlock(scope: !377, file: !2, line: 413, column: 2)
!386 = !DILocation(line: 412, scope: !385, inlinedAt: !375)
!387 = !DILocation(line: 414, scope: !388, inlinedAt: !375)
!388 = distinct !DILexicalBlock(scope: !385, file: !2, line: 413, column: 2)
!389 = !DILocation(line: 416, scope: !378, inlinedAt: !375)
!390 = !DILocation(line: 297, scope: !333)
!391 = !DILocation(line: 300, scope: !333)
!392 = !DILocalVariable(name: "pixels", scope: !333, file: !2, line: 303, type: !53, align: 8)
!393 = !DILocation(line: 303, scope: !333)
!394 = !DILocation(line: 304, scope: !333)
!395 = !DILocalVariable(name: "pos", scope: !333, file: !2, line: 306, type: !3, align: 4)
!396 = !DILocation(line: 306, scope: !333)
!397 = !DILocalVariable(name: "loc", scope: !333, file: !2, line: 307, type: !3, align: 4)
!398 = !DILocation(line: 307, scope: !333)
!399 = !DILocalVariable(name: "run_length", scope: !333, file: !2, line: 308, type: !19, align: 1)
!400 = !DILocation(line: 308, scope: !333)
