; ModuleID = 'std::core::builtin'
source_filename = "std::core::builtin"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"any[]" = type { ptr, i64 }
%"void*[]" = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }

$std.core.builtin.panicf = comdat any

$std.core.builtin.print_backtrace = comdat any

$std.core.builtin.default_panic = comdat any

$"$ct.std.core.builtin.EmptySlot" = comdat any

$"$ct.p$void" = comdat any

$"$ct.void" = comdat any

$"$ct.int" = comdat any

$"$ct.std.core.builtin.PrefetchLocality" = comdat any

$std.core.builtin.EMPTY_MACRO_SLOT = comdat any

$std.core.builtin.panic = comdat any

$std.core.builtin.MAX_FRAMEADDRESS = comdat any

$"$ct.std.core.mem.allocator.OnStackAllocator" = comdat any

$"$ct.ulong" = comdat any

$"$ct.String" = comdat any

$"$ct.sa$char" = comdat any

$"$ct.char" = comdat any

$"$ct.uint" = comdat any

@"$ct.std.core.builtin.EmptySlot" = linkonce global %.introspect { i8 18, i64 0, ptr null, i64 8, i64 ptrtoint (ptr @"$ct.p$void" to i64), i64 0, [0 x i64] zeroinitializer }, comdat, align 8
@"$ct.p$void" = linkonce global %.introspect { i8 19, i64 0, ptr null, i64 8, i64 ptrtoint (ptr @"$ct.void" to i64), i64 0, [0 x i64] zeroinitializer }, comdat, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "EMPTY_MACRO_SLOT", linkageName: "std.core.builtin.EMPTY_MACRO_SLOT", scope: !2, file: !2, line: 27, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "builtin.c3", directory: "C:/Compilers/C3/lib/std/core")
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "EmptySlot", scope: !2, file: !2, line: 29, baseType: !4, align: 8)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "in_panic", linkageName: "std.core.builtin.in_panic.9019", scope: !2, file: !2, line: 178, type: !7, isLocal: true, isDefinition: true, align: 1)
!7 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "panic", linkageName: "std.core.builtin.panic", scope: !2, file: !2, line: 201, type: !10, isLocal: false, isDefinition: true, align: 8)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "PanicFn", scope: !2, file: !2, line: 199, baseType: !11, align: 8)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PanicFn", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DISubroutineType(types: !13)
!13 = !{null, !14, !14, !14, !23}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !16, identifier: "char[]")
!16 = !{!17, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !15, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !15, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !22)
!22 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "MAX_FRAMEADDRESS", linkageName: "std.core.builtin.MAX_FRAMEADDRESS", scope: !2, file: !2, line: 588, type: !26, isLocal: false, isDefinition: true, align: 4)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{i32 1, !"CodeView", i32 1}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{i32 2, !"wchar_size", i32 2}
!30 = !{i32 4, !"PIC Level", i32 2}
!31 = !{i32 1, !"uwtable", i32 2}
!32 = !{i32 1, !"MaxTLSAlign", i32 65536}
!33 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !34, splitDebugInlining: false)
!34 = !{!0, !5, !8, !24}
!35 = distinct !DISubprogram(name: "panicf", linkageName: "std.core.builtin.panicf", scope: !2, file: !2, line: 203, type: !36, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !48)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !14, !14, !14, !23, !38}
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !39, identifier: "any[]")
!39 = !{!40, !47}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !38, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !43, identifier: "any")
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !42, baseType: !4, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !38, baseType: !21, size: 64, align: 64, offset: 64)
!48 = !{}
!49 = !DILocalVariable(name: "fmt", arg: 1, scope: !35, file: !2, line: 203, type: !14)
!50 = !DILocation(line: 203, scope: !35)
!51 = !DILocalVariable(name: "file", arg: 2, scope: !35, file: !2, line: 203, type: !14)
!52 = !DILocalVariable(name: "function", arg: 3, scope: !35, file: !2, line: 203, type: !14)
!53 = !DILocalVariable(name: "line", arg: 4, scope: !35, file: !2, line: 203, type: !23)
!54 = !DILocalVariable(name: "args", arg: 5, scope: !35, file: !2, line: 203, type: !38)
!55 = !DILocation(line: 206, scope: !35)
!56 = !DILocation(line: 249, scope: !57, inlinedAt: !59)
!57 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !58, file: !58, line: 247, scopeLine: 247, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!58 = !DIFile(filename: "io.c3", directory: "C:/Compilers/C3/lib/std/io")
!59 = !DILocation(line: 208, scope: !60)
!60 = distinct !DILexicalBlock(scope: !35, file: !2, line: 207, column: 3)
!61 = !DILocation(line: 159, scope: !62, inlinedAt: !56)
!62 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !58, file: !58, line: 155, scopeLine: 155, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!63 = !DILocation(line: 139, scope: !62, inlinedAt: !56)
!64 = !DILocation(line: 259, scope: !65, inlinedAt: !66)
!65 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !58, file: !58, line: 257, scopeLine: 257, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!66 = !DILocation(line: 209, scope: !60)
!67 = !DILocalVariable(name: "len", scope: !68, file: !2, line: 215, type: !21, align: 8)
!68 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !58, file: !58, line: 213, scopeLine: 213, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !48)
!69 = !DILocation(line: 215, scope: !68, inlinedAt: !64)
!70 = !DILocation(line: 159, scope: !71, inlinedAt: !69)
!71 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !58, file: !58, line: 155, scopeLine: 155, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!72 = !DILocation(line: 139, scope: !71, inlinedAt: !69)
!73 = !DILocation(line: 216, scope: !68, inlinedAt: !64)
!74 = !DILocation(line: 88, scope: !68, inlinedAt: !64)
!75 = !DILocation(line: 221, scope: !68, inlinedAt: !64)
!76 = !DILocation(line: 220, scope: !68, inlinedAt: !64)
!77 = !DILocation(line: 223, scope: !68, inlinedAt: !64)
!78 = !DILocation(line: 210, scope: !60)
!79 = !DILocation(line: 212, scope: !35)
!80 = !DILocalVariable(name: "buffer", scope: !81, file: !2, line: 572, type: !83, align: 16)
!81 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !82, file: !82, line: 570, scopeLine: 570, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !48)
!82 = !DIFile(filename: "mem.c3", directory: "C:/Compilers/C3/lib/std/core")
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 4096, align: 8, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 512, lowerBound: 0)
!86 = !DILocation(line: 572, scope: !81, inlinedAt: !87)
!87 = !DILocation(line: 213, scope: !35)
!88 = !DILocalVariable(name: "allocator", scope: !81, file: !2, line: 573, type: !89, align: 8)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 12, size: 384, align: 64, elements: !90, identifier: "std.core.mem.allocator.OnStackAllocator")
!90 = !{!91, !96, !97, !98}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !89, file: !2, line: 14, baseType: !92, size: 128, align: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !93, identifier: "Allocator")
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !92, baseType: !4, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, baseType: !46, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !89, file: !2, line: 15, baseType: !15, size: 128, align: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !89, file: !2, line: 16, baseType: !21, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !89, file: !2, line: 17, baseType: !99, size: 64, align: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !101, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.8319")
!101 = !{!102, !103, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !100, file: !2, line: 22, baseType: !7, size: 8, align: 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !100, file: !2, line: 23, baseType: !99, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !100, file: !2, line: 24, baseType: !4, size: 64, align: 64, offset: 128)
!105 = !DILocation(line: 573, scope: !81, inlinedAt: !87)
!106 = !DILocation(line: 574, scope: !81, inlinedAt: !87)
!107 = !DILocalVariable(name: "allocator", scope: !35, file: !2, line: 213, type: !92, align: 8)
!108 = !DILocation(line: 576, scope: !109, inlinedAt: !87)
!109 = distinct !DILexicalBlock(scope: !81, file: !82, line: 576, column: 2)
!110 = !DILocalVariable(name: "s", scope: !111, file: !2, line: 215, type: !112, align: 8)
!111 = distinct !DILexicalBlock(scope: !35, file: !2, line: 214, column: 3)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !113, align: 8)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !114, size: 64, align: 64, dwarfAddressSpace: 0)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 1)
!115 = !DILocation(line: 215, scope: !111)
!116 = !DILocation(line: 216, scope: !111)
!117 = !DILocation(line: 18, scope: !111)
!118 = !DILocation(line: 217, scope: !111)
!119 = !DILocation(line: 218, scope: !111)
!120 = !DILocation(line: 219, scope: !111)
!121 = !DILocation(line: 575, scope: !122, inlinedAt: !87)
!122 = distinct !DILexicalBlock(scope: !81, file: !82, line: 575, column: 8)
!123 = distinct !DISubprogram(name: "print_backtrace", linkageName: "std.core.builtin.print_backtrace", scope: !2, file: !2, line: 126, type: !124, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !48)
!124 = !DISubroutineType(types: !125)
!125 = !{!7, !14, !26}
!126 = !DILocalVariable(name: "message", arg: 1, scope: !123, file: !2, line: 126, type: !14)
!127 = !DILocation(line: 126, scope: !123)
!128 = !DILocalVariable(name: "backtraces_to_ignore", arg: 2, scope: !123, file: !2, line: 126, type: !26)
!129 = !DILocalVariable(name: "buffer", scope: !130, file: !2, line: 572, type: !131, align: 16)
!130 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !82, file: !82, line: 570, scopeLine: 570, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !48)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 34816, align: 8, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 4352, lowerBound: 0)
!134 = !DILocation(line: 572, scope: !130, inlinedAt: !127)
!135 = !DILocalVariable(name: "allocator", scope: !130, file: !2, line: 573, type: !89, align: 8)
!136 = !DILocation(line: 573, scope: !130, inlinedAt: !127)
!137 = !DILocation(line: 574, scope: !130, inlinedAt: !127)
!138 = !DILocalVariable(name: "smem", scope: !123, file: !2, line: 126, type: !92, align: 8)
!139 = !DILocation(line: 576, scope: !140, inlinedAt: !127)
!140 = distinct !DILexicalBlock(scope: !130, file: !82, line: 576, column: 2)
!141 = !DILocalVariable(name: "buffer", scope: !142, file: !2, line: 128, type: !143, align: 16)
!142 = distinct !DILexicalBlock(scope: !123, file: !2, line: 127, column: 1)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, align: 64, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 256, lowerBound: 0)
!146 = !DILocation(line: 128, scope: !142)
!147 = !DILocalVariable(name: "backtraces", scope: !142, file: !2, line: 129, type: !148, align: 8)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !149, identifier: "void*[]")
!149 = !{!150, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !148, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !148, baseType: !21, size: 64, align: 64, offset: 64)
!153 = !DILocation(line: 129, scope: !142)
!154 = !DILocation(line: 130, scope: !142)
!155 = !DILocalVariable(name: "buffer", scope: !156, file: !2, line: 572, type: !157, align: 16)
!156 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !82, file: !82, line: 570, scopeLine: 570, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !48)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 16384, align: 8, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 2048, lowerBound: 0)
!160 = !DILocation(line: 572, scope: !156, inlinedAt: !161)
!161 = !DILocation(line: 131, scope: !142)
!162 = !DILocalVariable(name: "allocator", scope: !156, file: !2, line: 573, type: !89, align: 8)
!163 = !DILocation(line: 573, scope: !156, inlinedAt: !161)
!164 = !DILocation(line: 574, scope: !156, inlinedAt: !161)
!165 = !DILocalVariable(name: "mem", scope: !142, file: !2, line: 131, type: !92, align: 8)
!166 = !DILocation(line: 576, scope: !167, inlinedAt: !161)
!167 = distinct !DILexicalBlock(scope: !156, file: !82, line: 576, column: 2)
!168 = !DILocalVariable(name: "backtrace", scope: !169, file: !2, line: 133, type: !170, align: 8)
!169 = distinct !DILexicalBlock(scope: !142, file: !2, line: 132, column: 2)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !171, identifier: "std_collections_list$std.os.backtrace.Backtrace$.List")
!171 = !{!172, !173, !174, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !170, file: !2, line: 20, baseType: !21, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !170, file: !2, line: 21, baseType: !21, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !170, file: !2, line: 22, baseType: !92, size: 128, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !170, file: !2, line: 23, baseType: !176, size: 64, align: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !177, size: 64, align: 64, dwarfAddressSpace: 0)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 88, baseType: !178, align: 8)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 9, size: 704, align: 64, elements: !179, identifier: "std.os.backtrace.Backtrace")
!179 = !{!180, !182, !183, !184, !185, !186, !187}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !178, file: !2, line: 11, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !22)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !178, file: !2, line: 12, baseType: !14, size: 128, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !178, file: !2, line: 13, baseType: !14, size: 128, align: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !178, file: !2, line: 14, baseType: !14, size: 128, align: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !178, file: !2, line: 15, baseType: !23, size: 32, align: 32, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !178, file: !2, line: 16, baseType: !92, size: 128, align: 64, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !178, file: !2, line: 17, baseType: !7, size: 8, align: 8, offset: 640)
!188 = !DILocation(line: 133, scope: !169)
!189 = !DILocation(line: 134, scope: !169)
!190 = !DILocation(line: 575, scope: !191, inlinedAt: !161)
!191 = distinct !DILexicalBlock(scope: !156, file: !82, line: 575, column: 8)
!192 = !DILocation(line: 575, scope: !193, inlinedAt: !127)
!193 = distinct !DILexicalBlock(scope: !130, file: !82, line: 575, column: 8)
!194 = !DILocation(line: 135, scope: !169)
!195 = !DILocation(line: 575, scope: !196, inlinedAt: !161)
!196 = distinct !DILexicalBlock(scope: !156, file: !82, line: 575, column: 8)
!197 = !DILocation(line: 575, scope: !198, inlinedAt: !127)
!198 = distinct !DILexicalBlock(scope: !130, file: !82, line: 575, column: 8)
!199 = !DILocation(line: 249, scope: !200, inlinedAt: !201)
!200 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !58, file: !58, line: 247, scopeLine: 247, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!201 = !DILocation(line: 136, scope: !169)
!202 = !DILocation(line: 159, scope: !203, inlinedAt: !199)
!203 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !58, file: !58, line: 155, scopeLine: 155, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!204 = !DILocation(line: 139, scope: !203, inlinedAt: !199)
!205 = !DILocation(line: 249, scope: !206, inlinedAt: !207)
!206 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !58, file: !58, line: 247, scopeLine: 247, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!207 = !DILocation(line: 137, scope: !169)
!208 = !DILocation(line: 159, scope: !209, inlinedAt: !205)
!209 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !58, file: !58, line: 155, scopeLine: 155, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!210 = !DILocation(line: 139, scope: !209, inlinedAt: !205)
!211 = !DILocation(line: 259, scope: !212, inlinedAt: !213)
!212 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !58, file: !58, line: 257, scopeLine: 257, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!213 = !DILocation(line: 138, scope: !169)
!214 = !DILocalVariable(name: "len", scope: !215, file: !2, line: 215, type: !21, align: 8)
!215 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !58, file: !58, line: 213, scopeLine: 213, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !48)
!216 = !DILocation(line: 215, scope: !215, inlinedAt: !211)
!217 = !DILocation(line: 159, scope: !218, inlinedAt: !216)
!218 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !58, file: !58, line: 155, scopeLine: 155, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!219 = !DILocation(line: 139, scope: !218, inlinedAt: !216)
!220 = !DILocation(line: 216, scope: !215, inlinedAt: !211)
!221 = !DILocation(line: 88, scope: !215, inlinedAt: !211)
!222 = !DILocation(line: 221, scope: !215, inlinedAt: !211)
!223 = !DILocation(line: 220, scope: !215, inlinedAt: !211)
!224 = !DILocation(line: 223, scope: !215, inlinedAt: !211)
!225 = !DILocation(line: 139, scope: !226)
!226 = distinct !DILexicalBlock(scope: !169, file: !2, line: 139, column: 3)
!227 = !DILocalVariable(name: ".temp", scope: !226, file: !2, line: 139, type: !21, align: 8)
!228 = !DILocalVariable(name: "i", scope: !229, file: !2, line: 139, type: !21, align: 8)
!229 = distinct !DILexicalBlock(scope: !226, file: !2, line: 140, column: 3)
!230 = !DILocation(line: 139, scope: !229)
!231 = !DILocalVariable(name: "trace", scope: !229, file: !2, line: 139, type: !176, align: 8)
!232 = !DILocation(line: 384, scope: !229)
!233 = !DILocation(line: 141, scope: !234)
!234 = distinct !DILexicalBlock(scope: !229, file: !2, line: 140, column: 3)
!235 = !DILocalVariable(name: "inline_suffix", scope: !234, file: !2, line: 142, type: !14, align: 8)
