; ModuleID = 'std::net::url'
source_filename = "std::net::url"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"any[]" = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }
%"char[][]" = type { ptr, i64 }
%HashMap = type { %"Entry*[]", %any, i32, i32, float }
%"Entry*[]" = type { ptr, i64 }
%Url = type { %"char[]", %"char[]", i32, %"char[]", %"char[]", %"char[]", %"char[]", %"char[]", %any }
%UrlQueryValues = type { %HashMap, %List }
%Splitter = type { %"char[]", %"char[]", i64, i32, i32 }

$std.net.url.Url.to_format = comdat any

$std.net.url.Url.to_string = comdat any

$std.net.url.UrlQueryValues.add = comdat any

$std.net.url.UrlQueryValues.to_format = comdat any

$std.net.url.UrlQueryValues.free = comdat any

$std.net.url.Url.free = comdat any

$std.net.url.tparse = comdat any

$std.net.url.parse = comdat any

$std.net.url.parse_query_to_temp = comdat any

$std.net.url.parse_query = comdat any

$std.net.url.encode_len = comdat any

$std.net.url.encode = comdat any

$std.net.url.tencode = comdat any

$std.net.url.decode_len = comdat any

$std.net.url.decode = comdat any

$std.net.url.tdecode = comdat any

$"$ct.std.net.url.Url" = comdat any

$"$ct.std.net.url.UrlQueryValues" = comdat any


!0 = !{i32 1, !"CodeView", i32 1}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 2}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 2}
!5 = !{i32 1, !"MaxTLSAlign", i32 65536}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "url.c3", directory: "C:/Compilers/C3/lib/std/net")
!8 = !{!9, !19}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "UrlEncodingMode", scope: !10, file: !10, line: 8, baseType: !11, size: 8, align: 8, elements: !12)
!10 = !DIFile(filename: "url_encoding.c3", directory: "C:/Compilers/C3/lib/std/net")
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!12 = !{!13, !14, !15, !16, !17, !18}
!13 = !DIEnumerator(name: "UNRESERVED", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "PATH", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "HOST", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "USERPASS", value: 3, isUnsigned: true)
!17 = !DIEnumerator(name: "QUERY", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "FRAGMENT", value: 5, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SplitterType", scope: !20, file: !7, line: 1129, baseType: !35, size: 32, align: 32, elements: !36)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Splitter", scope: !7, file: !7, line: 1139, size: 384, align: 64, elements: !21, identifier: "std.core.string.Splitter")
!21 = !{!22, !31, !32, !33, !34}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !20, file: !7, line: 1141, baseType: !23, size: 128, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !25, identifier: "char[]")
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !24, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !30)
!30 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !20, file: !7, line: 1142, baseType: !23, size: 128, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !20, file: !7, line: 1143, baseType: !29, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !20, file: !7, line: 1144, baseType: !19, size: 32, align: 32, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "last_index", scope: !20, file: !7, line: 1145, baseType: !35, size: 32, align: 32, offset: 352)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "TOKENIZE", value: 0)
!38 = !DIEnumerator(name: "TOKENIZE_ALL", value: 1)
!39 = !DIEnumerator(name: "TOKENIZE_ALL_SKIP_LAST", value: 2)
!40 = distinct !DISubprogram(name: "to_format", linkageName: "std.net.url.Url.to_format", scope: !7, file: !7, line: 171, type: !41, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !81)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !45, !46, !65}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !44)
!44 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Url*", baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Url", scope: !7, file: !7, line: 29, size: 1088, align: 64, elements: !48, identifier: "std.net.url.Url")
!48 = !{!49, !50, !51, !53, !54, !55, !56, !57, !58}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !47, file: !7, line: 31, baseType: !23, size: 128, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !47, file: !7, line: 32, baseType: !23, size: 128, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !47, file: !7, line: 33, baseType: !52, size: 32, align: 32, offset: 256)
!52 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !47, file: !7, line: 34, baseType: !23, size: 128, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !47, file: !7, line: 35, baseType: !23, size: 128, align: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !47, file: !7, line: 36, baseType: !23, size: 128, align: 64, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !47, file: !7, line: 37, baseType: !23, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !47, file: !7, line: 38, baseType: !23, size: 128, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !47, file: !7, line: 40, baseType: !59, size: 128, align: 64, offset: 960)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !60, identifier: "Allocator")
!60 = !{!61, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !59, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !7, file: !7, line: 63, size: 320, align: 64, elements: !67, identifier: "std.io.Formatter")
!67 = !{!68, !69, !74}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !66, file: !7, line: 65, baseType: !62, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !66, file: !7, line: 66, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !7, file: !7, line: 16, baseType: !71, align: 8)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !72, size: 64, align: 64, dwarfAddressSpace: 0)
!72 = !DISubroutineType(types: !73)
!73 = !{!43, !62, !62, !11}
!74 = !DIDerivedType(tag: DW_TAG_member, scope: !66, file: !7, line: 67, baseType: !75, size: 192, align: 64, offset: 128)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !66, file: !7, line: 67, size: 192, align: 64, elements: !76)
!76 = !{!77, !78, !79, !80}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !75, file: !7, line: 69, baseType: !52, size: 32, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !75, file: !7, line: 70, baseType: !52, size: 32, align: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !75, file: !7, line: 71, baseType: !52, size: 32, align: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !75, file: !7, line: 72, baseType: !43, size: 64, align: 64, offset: 128)
!81 = !{}
!82 = !DILocation(line: 172, scope: !40)
!83 = !DILocalVariable(name: "self", arg: 1, scope: !40, file: !7, line: 171, type: !46)
!84 = !DILocation(line: 171, scope: !40)
!85 = !DILocalVariable(name: "f", arg: 2, scope: !40, file: !7, line: 171, type: !65)
!86 = !DILocalVariable(name: "len", scope: !40, file: !7, line: 173, type: !29, align: 8)
!87 = !DILocation(line: 173, scope: !40)
!88 = !DILocation(line: 175, scope: !40)
!89 = !DILocation(line: 177, scope: !90)
!90 = distinct !DILexicalBlock(scope: !40, file: !7, line: 176, column: 2)
!91 = !DILocation(line: 178, scope: !90)
!92 = !DILocation(line: 179, scope: !90)
!93 = !DILocation(line: 183, scope: !40)
!94 = !DILocalVariable(name: "buffer", scope: !95, file: !7, line: 572, type: !97, align: 16)
!95 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !96, file: !96, line: 570, scopeLine: 570, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !81)
!96 = !DIFile(filename: "mem.c3", directory: "C:/Compilers/C3/lib/std/core")
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 512, align: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 64, lowerBound: 0)
!100 = !DILocation(line: 572, scope: !95, inlinedAt: !101)
!101 = !DILocation(line: 185, scope: !102)
!102 = distinct !DILexicalBlock(scope: !40, file: !7, line: 184, column: 2)
!103 = !DILocalVariable(name: "allocator", scope: !95, file: !7, line: 573, type: !104, align: 8)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !7, file: !7, line: 12, size: 384, align: 64, elements: !105, identifier: "std.core.mem.allocator.OnStackAllocator")
!105 = !{!106, !107, !108, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !104, file: !7, line: 14, baseType: !59, size: 128, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !7, line: 15, baseType: !24, size: 128, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !104, file: !7, line: 16, baseType: !29, size: 64, align: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !104, file: !7, line: 17, baseType: !110, size: 64, align: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !111, size: 64, align: 64, dwarfAddressSpace: 0)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !7, file: !7, line: 20, size: 192, align: 64, elements: !112, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.8319")
!112 = !{!113, !115, !116}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !111, file: !7, line: 22, baseType: !114, size: 8, align: 8)
!114 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !111, file: !7, line: 23, baseType: !110, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !111, file: !7, line: 24, baseType: !62, size: 64, align: 64, offset: 128)
!117 = !DILocation(line: 573, scope: !95, inlinedAt: !101)
!118 = !DILocation(line: 574, scope: !95, inlinedAt: !101)
!119 = !DILocalVariable(name: "smem", scope: !102, file: !7, line: 185, type: !59, align: 8)
!120 = !DILocation(line: 576, scope: !121, inlinedAt: !101)
!121 = distinct !DILexicalBlock(scope: !95, file: !96, line: 576, column: 2)
!122 = !DILocation(line: 187, scope: !123)
!123 = distinct !DILexicalBlock(scope: !102, file: !7, line: 186, column: 3)
!124 = !DILocation(line: 575, scope: !125, inlinedAt: !101)
!125 = distinct !DILexicalBlock(scope: !95, file: !96, line: 575, column: 8)
!126 = !DILocation(line: 575, scope: !127, inlinedAt: !101)
!127 = distinct !DILexicalBlock(scope: !95, file: !96, line: 575, column: 8)
!128 = !DILocation(line: 189, scope: !102)
!129 = !DILocation(line: 191, scope: !130)
!130 = distinct !DILexicalBlock(scope: !102, file: !7, line: 190, column: 3)
!131 = !DILocalVariable(name: "buffer", scope: !132, file: !7, line: 572, type: !97, align: 16)
!132 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !96, file: !96, line: 570, scopeLine: 570, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !81)
!133 = !DILocation(line: 572, scope: !132, inlinedAt: !134)
!134 = !DILocation(line: 192, scope: !130)
!135 = !DILocalVariable(name: "allocator", scope: !132, file: !7, line: 573, type: !104, align: 8)
!136 = !DILocation(line: 573, scope: !132, inlinedAt: !134)
!137 = !DILocation(line: 574, scope: !132, inlinedAt: !134)
!138 = !DILocalVariable(name: "smem", scope: !130, file: !7, line: 192, type: !59, align: 8)
!139 = !DILocation(line: 576, scope: !140, inlinedAt: !134)
!140 = distinct !DILexicalBlock(scope: !132, file: !96, line: 576, column: 2)
!141 = !DILocation(line: 194, scope: !142)
!142 = distinct !DILexicalBlock(scope: !130, file: !7, line: 193, column: 4)
!143 = !DILocation(line: 575, scope: !144, inlinedAt: !134)
!144 = distinct !DILexicalBlock(scope: !132, file: !96, line: 575, column: 8)
!145 = !DILocation(line: 575, scope: !146, inlinedAt: !134)
!146 = distinct !DILexicalBlock(scope: !132, file: !96, line: 575, column: 8)
!147 = !DILocation(line: 197, scope: !102)
!148 = !DILocalVariable(name: "buffer", scope: !149, file: !7, line: 572, type: !150, align: 16)
!149 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !96, file: !96, line: 570, scopeLine: 570, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !81)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1024, align: 8, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 128, lowerBound: 0)
!153 = !DILocation(line: 572, scope: !149, inlinedAt: !154)
!154 = !DILocation(line: 201, scope: !40)
!155 = !DILocalVariable(name: "allocator", scope: !149, file: !7, line: 573, type: !104, align: 8)
!156 = !DILocation(line: 573, scope: !149, inlinedAt: !154)
!157 = !DILocation(line: 574, scope: !149, inlinedAt: !154)
!158 = !DILocalVariable(name: "smem", scope: !40, file: !7, line: 201, type: !59, align: 8)
!159 = !DILocation(line: 576, scope: !160, inlinedAt: !154)
!160 = distinct !DILexicalBlock(scope: !149, file: !96, line: 576, column: 2)
!161 = !DILocation(line: 203, scope: !162)
!162 = distinct !DILexicalBlock(scope: !40, file: !7, line: 202, column: 2)
!163 = !DILocation(line: 575, scope: !164, inlinedAt: !154)
!164 = distinct !DILexicalBlock(scope: !149, file: !96, line: 575, column: 8)
!165 = !DILocation(line: 575, scope: !166, inlinedAt: !154)
!166 = distinct !DILexicalBlock(scope: !149, file: !96, line: 575, column: 8)
!167 = !DILocation(line: 207, scope: !40)
!168 = !DILocalVariable(name: "buffer", scope: !169, file: !7, line: 572, type: !170, align: 16)
!169 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !96, file: !96, line: 570, scopeLine: 570, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !81)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, align: 8, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 256, lowerBound: 0)
!173 = !DILocation(line: 572, scope: !169, inlinedAt: !174)
!174 = !DILocation(line: 210, scope: !40)
!175 = !DILocalVariable(name: "allocator", scope: !169, file: !7, line: 573, type: !104, align: 8)
!176 = !DILocation(line: 573, scope: !169, inlinedAt: !174)
!177 = !DILocation(line: 574, scope: !169, inlinedAt: !174)
!178 = !DILocalVariable(name: "smem", scope: !40, file: !7, line: 210, type: !59, align: 8)
!179 = !DILocation(line: 576, scope: !180, inlinedAt: !174)
!180 = distinct !DILexicalBlock(scope: !169, file: !96, line: 576, column: 2)
!181 = !DILocation(line: 212, scope: !182)
!182 = distinct !DILexicalBlock(scope: !40, file: !7, line: 211, column: 2)
!183 = !DILocation(line: 575, scope: !184, inlinedAt: !174)
!184 = distinct !DILexicalBlock(scope: !169, file: !96, line: 575, column: 8)
!185 = !DILocation(line: 575, scope: !186, inlinedAt: !174)
!186 = distinct !DILexicalBlock(scope: !169, file: !96, line: 575, column: 8)
!187 = !DILocation(line: 217, scope: !40)
!188 = !DILocation(line: 219, scope: !189)
!189 = distinct !DILexicalBlock(scope: !40, file: !7, line: 218, column: 2)
!190 = !DILocation(line: 220, scope: !189)
!191 = !DILocation(line: 224, scope: !40)
!192 = !DILocalVariable(name: "buffer", scope: !193, file: !7, line: 572, type: !170, align: 16)
!193 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !96, file: !96, line: 570, scopeLine: 570, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !81)
!194 = !DILocation(line: 572, scope: !193, inlinedAt: !195)
!195 = !DILocation(line: 226, scope: !196)
!196 = distinct !DILexicalBlock(scope: !40, file: !7, line: 225, column: 2)
!197 = !DILocalVariable(name: "allocator", scope: !193, file: !7, line: 573, type: !104, align: 8)
!198 = !DILocation(line: 573, scope: !193, inlinedAt: !195)
!199 = !DILocation(line: 574, scope: !193, inlinedAt: !195)
!200 = !DILocalVariable(name: "smem", scope: !196, file: !7, line: 226, type: !59, align: 8)
!201 = !DILocation(line: 576, scope: !202, inlinedAt: !195)
!202 = distinct !DILexicalBlock(scope: !193, file: !96, line: 576, column: 2)
!203 = !DILocation(line: 228, scope: !204)
!204 = distinct !DILexicalBlock(scope: !196, file: !7, line: 227, column: 3)
!205 = !DILocation(line: 575, scope: !206, inlinedAt: !195)
!206 = distinct !DILexicalBlock(scope: !193, file: !96, line: 575, column: 8)
!207 = !DILocation(line: 229, scope: !204)
!208 = !DILocation(line: 575, scope: !209, inlinedAt: !195)
!209 = distinct !DILexicalBlock(scope: !193, file: !96, line: 575, column: 8)
!210 = !DILocation(line: 575, scope: !211, inlinedAt: !195)
!211 = distinct !DILexicalBlock(scope: !193, file: !96, line: 575, column: 8)
!212 = !DILocation(line: 232, scope: !40)
!213 = distinct !DISubprogram(name: "to_string", linkageName: "std.net.url.Url.to_string", scope: !7, file: !7, line: 235, type: !214, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !81)
!214 = !DISubroutineType(types: !215)
!215 = !{!23, !46, !59}
!216 = !DILocation(line: 236, scope: !213)
!217 = !DILocalVariable(name: "self", arg: 1, scope: !213, file: !7, line: 235, type: !46)
!218 = !DILocation(line: 235, scope: !213)
!219 = !DILocalVariable(name: "allocator", arg: 2, scope: !213, file: !7, line: 235, type: !59)
!220 = !DILocation(line: 237, scope: !213)
!221 = distinct !DISubprogram(name: "add", linkageName: "std.net.url.UrlQueryValues.add", scope: !7, file: !7, line: 292, type: !222, scopeLine: 292, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !81)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !224, !23, !23}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "UrlQueryValues*", baseType: !225, size: 64, align: 64, dwarfAddressSpace: 0)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "UrlQueryValues", scope: !7, file: !7, line: 243, size: 704, align: 64, elements: !226, identifier: "std.net.url.UrlQueryValues")
!226 = !{!227, !258}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !225, file: !7, line: 245, baseType: !228, size: 384, align: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !225, file: !7, line: 29, size: 384, align: 64, elements: !229, identifier: "std_collections_map$String$std_collections_list$String$.List$.HashMap")
!229 = !{!230, !253, !254, !255, !256}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !228, file: !7, line: 31, baseType: !231, size: 128, align: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !232, identifier: "Entry*[]")
!232 = !{!233, !252}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !231, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !235, size: 64, align: 64, dwarfAddressSpace: 0)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !236, size: 64, align: 64, dwarfAddressSpace: 0)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !7, file: !7, line: 21, size: 576, align: 64, elements: !237, identifier: "std_collections_map$String$std_collections_list$String$.List$.Entry")
!237 = !{!238, !239, !241, !251}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !236, file: !7, line: 23, baseType: !52, size: 32, align: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !236, file: !7, line: 24, baseType: !240, size: 128, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !7, file: !7, line: 245, baseType: !23, align: 8)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !236, file: !7, line: 25, baseType: !242, size: 320, align: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !7, file: !7, line: 245, baseType: !243, align: 8)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !7, file: !7, line: 18, size: 320, align: 64, elements: !244, identifier: "std_collections_list$String$.List")
!244 = !{!245, !246, !247, !248}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !243, file: !7, line: 20, baseType: !29, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !243, file: !7, line: 21, baseType: !29, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !243, file: !7, line: 22, baseType: !59, size: 128, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !243, file: !7, line: 23, baseType: !249, size: 64, align: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !250, size: 64, align: 64, dwarfAddressSpace: 0)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !7, file: !7, line: 9, baseType: !23, align: 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !7, line: 26, baseType: !235, size: 64, align: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !231, baseType: !29, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !228, file: !7, line: 32, baseType: !59, size: 128, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !228, file: !7, line: 33, baseType: !52, size: 32, align: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !228, file: !7, line: 34, baseType: !52, size: 32, align: 32, offset: 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !228, file: !7, line: 35, baseType: !257, size: 32, align: 32, offset: 320)
!257 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "key_order", scope: !225, file: !7, line: 246, baseType: !259, size: 320, align: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "UrlQueryValueList", scope: !7, file: !7, line: 241, baseType: !243, align: 8)
!260 = !DILocation(line: 293, scope: !221)
!261 = !DILocalVariable(name: "self", arg: 1, scope: !221, file: !7, line: 292, type: !224)
!262 = !DILocation(line: 292, scope: !221)
!263 = !DILocalVariable(name: "key", arg: 2, scope: !221, file: !7, line: 292, type: !23)
!264 = !DILocalVariable(name: "value", arg: 3, scope: !221, file: !7, line: 292, type: !23)
!265 = !DILocalVariable(name: "value_copy", scope: !221, file: !7, line: 294, type: !23, align: 8)
!266 = !DILocation(line: 294, scope: !221)
!267 = !DILocalVariable(name: "existing", scope: !221, file: !7, line: 295, type: !268, align: 8)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Value*", baseType: !242, size: 64, align: 64, dwarfAddressSpace: 0)
!269 = !DILocation(line: 295, scope: !221)
!270 = !DILocation(line: 297, scope: !271)
!271 = distinct !DILexicalBlock(scope: !221, file: !7, line: 296, column: 2)
!272 = !DILocalVariable(name: "new_list", scope: !273, file: !7, line: 301, type: !259, align: 8)
!273 = distinct !DILexicalBlock(scope: !221, file: !7, line: 300, column: 2)
!274 = !DILocation(line: 301, scope: !273)
!275 = !DILocation(line: 302, scope: !273)
!276 = !DILocation(line: 55, scope: !273)
!277 = !DILocalVariable(name: ".temp", scope: !273, file: !7, line: 303, type: !242, align: 8)
!278 = !DILocation(line: 303, scope: !273)
!279 = !DILocation(line: 304, scope: !273)
!280 = !DILocation(line: 306, scope: !221)
!281 = distinct !DISubprogram(name: "to_format", linkageName: "std.net.url.UrlQueryValues.to_format", scope: !7, file: !7, line: 311, type: !282, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !81)
!282 = !DISubroutineType(types: !283)
!283 = !{!43, !45, !224, !65}
!284 = !DILocation(line: 312, scope: !281)
!285 = !DILocalVariable(name: "self", arg: 1, scope: !281, file: !7, line: 311, type: !224)
!286 = !DILocation(line: 311, scope: !281)
!287 = !DILocalVariable(name: "f", arg: 2, scope: !281, file: !7, line: 311, type: !65)
!288 = !DILocalVariable(name: "len", scope: !281, file: !7, line: 313, type: !29, align: 8)
!289 = !DILocation(line: 313, scope: !281)
!290 = !DILocalVariable(name: "i", scope: !281, file: !7, line: 314, type: !29, align: 8)
!291 = !DILocation(line: 314, scope: !281)
!292 = !DILocation(line: 315, scope: !293)
!293 = distinct !DILexicalBlock(scope: !281, file: !7, line: 315, column: 2)
!294 = !DILocalVariable(name: ".temp", scope: !293, file: !7, line: 315, type: !29, align: 8)
!295 = !DILocalVariable(name: "key", scope: !296, file: !7, line: 315, type: !250, align: 8)
!296 = distinct !DILexicalBlock(scope: !293, file: !7, line: 316, column: 2)
!297 = !DILocation(line: 315, scope: !296)
!298 = !DILocation(line: 378, scope: !299, inlinedAt: !297)
!299 = distinct !DILexicalBlock(scope: !301, file: !300, line: 379, column: 1)
!300 = !DIFile(filename: "list.c3", directory: "C:/Compilers/C3/lib/std/collections")
!301 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !300, file: !300, line: 378, scopeLine: 378, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!302 = !DILocation(line: 376, scope: !299, inlinedAt: !297)
!303 = !DILocation(line: 315, scope: !299, inlinedAt: !297)
!304 = !DILocation(line: 380, scope: !301, inlinedAt: !297)
!305 = !DILocalVariable(name: "buffer", scope: !306, file: !7, line: 572, type: !150, align: 16)
!306 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !96, file: !96, line: 570, scopeLine: 570, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !81)
!307 = !DILocation(line: 572, scope: !306, inlinedAt: !308)
!308 = !DILocation(line: 317, scope: !309)
!309 = distinct !DILexicalBlock(scope: !296, file: !7, line: 316, column: 2)
!310 = !DILocalVariable(name: "allocator", scope: !306, file: !7, line: 573, type: !104, align: 8)
!311 = !DILocation(line: 573, scope: !306, inlinedAt: !308)
!312 = !DILocation(line: 574, scope: !306, inlinedAt: !308)
!313 = !DILocalVariable(name: "mem", scope: !309, file: !7, line: 317, type: !59, align: 8)
!314 = !DILocation(line: 576, scope: !315, inlinedAt: !308)
!315 = distinct !DILexicalBlock(scope: !306, file: !96, line: 576, column: 2)
!316 = !DILocalVariable(name: "encoded_key", scope: !317, file: !7, line: 319, type: !23, align: 8)
!317 = distinct !DILexicalBlock(scope: !309, file: !7, line: 318, column: 3)
!318 = !DILocation(line: 319, scope: !317)
!319 = !DILocalVariable(name: "values", scope: !317, file: !7, line: 320, type: !243, align: 8)
!320 = !DILocation(line: 320, scope: !317)
!321 = !DILocation(line: 321, scope: !317)
!322 = !DILocation(line: 575, scope: !323, inlinedAt: !308)
!323 = distinct !DILexicalBlock(scope: !306, file: !96, line: 575, column: 8)
!324 = !DILocation(line: 322, scope: !325)
!325 = distinct !DILexicalBlock(scope: !317, file: !7, line: 322, column: 4)
!326 = !DILocalVariable(name: ".temp", scope: !325, file: !7, line: 322, type: !29, align: 8)
!327 = !DILocalVariable(name: "value", scope: !328, file: !7, line: 322, type: !250, align: 8)
!328 = distinct !DILexicalBlock(scope: !325, file: !7, line: 323, column: 4)
!329 = !DILocation(line: 322, scope: !328)
!330 = !DILocation(line: 378, scope: !331, inlinedAt: !329)
!331 = distinct !DILexicalBlock(scope: !332, file: !300, line: 379, column: 1)
!332 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !300, file: !300, line: 378, scopeLine: 378, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!333 = !DILocation(line: 376, scope: !331, inlinedAt: !329)
!334 = !DILocation(line: 322, scope: !331, inlinedAt: !329)
!335 = !DILocation(line: 380, scope: !332, inlinedAt: !329)
!336 = !DILocation(line: 324, scope: !337)
!337 = distinct !DILexicalBlock(scope: !328, file: !7, line: 323, column: 4)
!338 = !DILocation(line: 575, scope: !339, inlinedAt: !308)
!339 = distinct !DILexicalBlock(scope: !306, file: !96, line: 575, column: 8)
!340 = !DILocation(line: 325, scope: !337)
!341 = !DILocation(line: 575, scope: !342, inlinedAt: !308)
!342 = distinct !DILexicalBlock(scope: !306, file: !96, line: 575, column: 8)
!343 = !DILocation(line: 326, scope: !337)
!344 = !DILocation(line: 575, scope: !345, inlinedAt: !308)
!345 = distinct !DILexicalBlock(scope: !306, file: !96, line: 575, column: 8)
!346 = !DILocalVariable(name: "buffer", scope: !347, file: !7, line: 572, type: !170, align: 16)
!347 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !96, file: !96, line: 570, scopeLine: 570, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !81)
!348 = !DILocation(line: 572, scope: !347, inlinedAt: !349)
!349 = !DILocation(line: 327, scope: !337)
!350 = !DILocalVariable(name: "allocator", scope: !347, file: !7, line: 573, type: !104, align: 8)
!351 = !DILocation(line: 573, scope: !347, inlinedAt: !349)
!352 = !DILocation(line: 574, scope: !347, inlinedAt: !349)
!353 = !DILocalVariable(name: "smem", scope: !337, file: !7, line: 327, type: !59, align: 8)
!354 = !DILocation(line: 576, scope: !355, inlinedAt: !349)
!355 = distinct !DILexicalBlock(scope: !347, file: !96, line: 576, column: 2)
!356 = !DILocation(line: 329, scope: !357)
!357 = distinct !DILexicalBlock(scope: !337, file: !7, line: 328, column: 5)
!358 = !DILocation(line: 575, scope: !359, inlinedAt: !349)
!359 = distinct !DILexicalBlock(scope: !347, file: !96, line: 575, column: 8)
!360 = !DILocation(line: 575, scope: !361, inlinedAt: !308)
!361 = distinct !DILexicalBlock(scope: !306, file: !96, line: 575, column: 8)
!362 = !DILocation(line: 575, scope: !363, inlinedAt: !349)
!363 = distinct !DILexicalBlock(scope: !347, file: !96, line: 575, column: 8)
!364 = !DILocation(line: 331, scope: !337)
!365 = !DILocation(line: 575, scope: !366, inlinedAt: !308)
!366 = distinct !DILexicalBlock(scope: !306, file: !96, line: 575, column: 8)
!367 = !DILocation(line: 335, scope: !281)
!368 = distinct !DISubprogram(name: "free", linkageName: "std.net.url.UrlQueryValues.free", scope: !7, file: !7, line: 339, type: !369, scopeLine: 339, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !81)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !224}
!371 = !DILocation(line: 340, scope: !368)
!372 = !DILocalVariable(name: "self", arg: 1, scope: !368, file: !7, line: 339, type: !224)
!373 = !DILocation(line: 339, scope: !368)
!374 = !DILocation(line: 341, scope: !368)
!375 = !DILocation(line: 324, scope: !376, inlinedAt: !378)
!376 = distinct !DISubprogram(name: "@each_entry", linkageName: "@each_entry", scope: !377, file: !377, line: 322, scopeLine: 322, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !81)
!377 = !DIFile(filename: "hashmap.c3", directory: "C:/Compilers/C3/lib/std/collections")
!378 = !DILocation(line: 316, scope: !379, inlinedAt: !374)
!379 = distinct !DISubprogram(name: "@each", linkageName: "@each", scope: !377, file: !377, line: 314, scopeLine: 314, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !81)
!380 = !DILocation(line: 325, scope: !381, inlinedAt: !378)
!381 = distinct !DILexicalBlock(scope: !376, file: !377, line: 325, column: 2)
!382 = !DILocalVariable(name: ".temp", scope: !381, file: !7, line: 325, type: !29, align: 8)
!383 = !DILocalVariable(name: "entry", scope: !384, file: !7, line: 325, type: !235, align: 8)
!384 = distinct !DILexicalBlock(scope: !381, file: !377, line: 326, column: 2)
!385 = !DILocation(line: 325, scope: !384, inlinedAt: !378)
!386 = !DILocation(line: 327, scope: !387, inlinedAt: !378)
!387 = distinct !DILexicalBlock(scope: !384, file: !377, line: 326, column: 2)
!388 = !DILocation(line: 327, scope: !389, inlinedAt: !378)
!389 = distinct !DILexicalBlock(scope: !387, file: !377, line: 327, column: 3)
!390 = !DILocalVariable(name: "entry", scope: !379, file: !7, line: 316, type: !235, align: 8)
!391 = !DILocation(line: 329, scope: !392, inlinedAt: !378)
!392 = distinct !DILexicalBlock(scope: !393, file: !377, line: 329, column: 4)
!393 = distinct !DILexicalBlock(scope: !389, file: !377, line: 328, column: 3)
!394 = !DILocalVariable(name: "key", scope: !368, file: !7, line: 341, type: !23, align: 8)
!395 = !DILocalVariable(name: "values", scope: !368, file: !7, line: 341, type: !259, align: 8)
!396 = !DILocation(line: 318, scope: !397, inlinedAt: !374)
!397 = distinct !DILexicalBlock(scope: !398, file: !377, line: 318, column: 3)
!398 = distinct !DILexicalBlock(scope: !379, file: !377, line: 317, column: 2)
!399 = !DILocation(line: 343, scope: !400)
!400 = distinct !DILexicalBlock(scope: !401, file: !7, line: 343, column: 3)
!401 = distinct !DILexicalBlock(scope: !368, file: !7, line: 342, column: 2)
!402 = !DILocalVariable(name: ".temp", scope: !400, file: !7, line: 343, type: !29, align: 8)
!403 = !DILocalVariable(name: "value", scope: !404, file: !7, line: 343, type: !250, align: 8)
!404 = distinct !DILexicalBlock(scope: !400, file: !7, line: 343, column: 27)
!405 = !DILocation(line: 343, scope: !404)
!406 = !DILocation(line: 378, scope: !407, inlinedAt: !405)
!407 = distinct !DILexicalBlock(scope: !408, file: !300, line: 379, column: 1)
!408 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !300, file: !300, line: 378, scopeLine: 378, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!409 = !DILocation(line: 376, scope: !407, inlinedAt: !405)
!410 = !DILocation(line: 343, scope: !407, inlinedAt: !405)
!411 = !DILocation(line: 380, scope: !408, inlinedAt: !405)
!412 = !DILocation(line: 344, scope: !401)
!413 = !DILocation(line: 330, scope: !393, inlinedAt: !378)
!414 = !DILocation(line: 346, scope: !368)
!415 = !DILocation(line: 348, scope: !416)
!416 = distinct !DILexicalBlock(scope: !368, file: !7, line: 348, column: 2)
!417 = !DILocalVariable(name: ".temp", scope: !416, file: !7, line: 348, type: !29, align: 8)
!418 = !DILocalVariable(name: "key", scope: !419, file: !7, line: 348, type: !249, align: 8)
!419 = distinct !DILexicalBlock(scope: !416, file: !7, line: 348, column: 33)
!420 = !DILocation(line: 348, scope: !419)
!421 = !DILocation(line: 384, scope: !419)
!422 = !DILocation(line: 349, scope: !368)
!423 = distinct !DISubprogram(name: "free", linkageName: "std.net.url.Url.free", scope: !7, file: !7, line: 357, type: !424, scopeLine: 357, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !81)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !46}
!426 = !DILocation(line: 358, scope: !423)
!427 = !DILocalVariable(name: "self", arg: 1, scope: !423, file: !7, line: 357, type: !46)
!428 = !DILocation(line: 357, scope: !423)
!429 = !DILocation(line: 359, scope: !423)
!430 = !DILocation(line: 360, scope: !423)
!431 = !DILocation(line: 361, scope: !423)
!432 = !DILocation(line: 362, scope: !423)
!433 = !DILocation(line: 363, scope: !423)
!434 = !DILocation(line: 364, scope: !423)
!435 = !DILocation(line: 365, scope: !423)
!436 = !DILocation(line: 366, scope: !423)
!437 = distinct !DISubprogram(name: "tparse", linkageName: "std.net.url.tparse", scope: !7, file: !7, line: 50, type: !438, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !81)
!438 = !DISubroutineType(types: !439)
!439 = !{!43, !46, !23}
!440 = !DILocalVariable(name: "url_string", arg: 1, scope: !437, file: !7, line: 50, type: !23)
!441 = !DILocation(line: 50, scope: !437)
!442 = !DILocation(line: 47, scope: !443)
!443 = distinct !DILexicalBlock(scope: !437, file: !7, line: 50, column: 38)
!444 = !DILocation(line: 56, scope: !437)
!445 = distinct !DISubprogram(name: "parse", linkageName: "std.net.url.parse", scope: !7, file: !7, line: 59, type: !446, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !81)
!446 = !DISubroutineType(types: !447)
!447 = !{!43, !46, !59, !23}
!448 = !DILocalVariable(name: "allocator", arg: 1, scope: !445, file: !7, line: 59, type: !59)
!449 = !DILocation(line: 59, scope: !445)
!450 = !DILocalVariable(name: "url_string", arg: 2, scope: !445, file: !7, line: 59, type: !23)
!451 = !DILocation(line: 56, scope: !452)
!452 = distinct !DILexicalBlock(scope: !445, file: !7, line: 60, column: 1)
!453 = !DILocation(line: 61, scope: !445)
!454 = !DILocation(line: 62, scope: !445)
!455 = !DILocalVariable(name: "url", scope: !445, file: !7, line: 63, type: !47, align: 8)
!456 = !DILocation(line: 63, scope: !445)
!457 = !DILocalVariable(name: "pos", scope: !445, file: !7, line: 66, type: !29, align: 8)
!458 = !DILocation(line: 66, scope: !445)
!459 = !DILocation(line: 68, scope: !460)
!460 = distinct !DILexicalBlock(scope: !445, file: !7, line: 67, column: 2)
!461 = !DILocation(line: 69, scope: !460)
!462 = !DILocation(line: 70, scope: !460)
!463 = !DILocalVariable(name: "pos", scope: !445, file: !7, line: 72, type: !29, align: 8)
!464 = !DILocation(line: 72, scope: !445)
!465 = !DILocation(line: 75, scope: !466)
!466 = distinct !DILexicalBlock(scope: !445, file: !7, line: 73, column: 2)
!467 = !DILocation(line: 76, scope: !466)
!468 = !DILocation(line: 77, scope: !466)
!469 = !DILocation(line: 78, scope: !466)
!470 = !DILocation(line: 82, scope: !445)
!471 = !DILocalVariable(name: "authority_end", scope: !472, file: !7, line: 84, type: !29, align: 8)
!472 = distinct !DILexicalBlock(scope: !445, file: !7, line: 83, column: 2)
!473 = !DILocation(line: 84, scope: !472)
!474 = !DILocalVariable(name: "authority", scope: !472, file: !7, line: 85, type: !23, align: 8)
!475 = !DILocation(line: 85, scope: !472)
!476 = !DILocalVariable(name: "user_info_end", scope: !472, file: !7, line: 87, type: !29, align: 8)
!477 = !DILocation(line: 87, scope: !472)
!478 = !DILocalVariable(name: "userinfo", scope: !479, file: !7, line: 89, type: !23, align: 8)
!479 = distinct !DILexicalBlock(scope: !472, file: !7, line: 88, column: 3)
!480 = !DILocation(line: 89, scope: !479)
!481 = !DILocalVariable(name: "username", scope: !479, file: !7, line: 90, type: !23, align: 8)
!482 = !DILocation(line: 90, scope: !479)
!483 = !DILocalVariable(name: "password", scope: !479, file: !7, line: 91, type: !23, align: 8)
!484 = !DILocation(line: 91, scope: !479)
!485 = !DILocalVariable(name: "state", scope: !486, file: !7, line: 641, type: !487, align: 8)
!486 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !96, file: !96, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !81)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !7, file: !7, line: 403, baseType: !488, align: 8)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !489, size: 64, align: 64, dwarfAddressSpace: 0)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !7, file: !7, line: 31, size: 704, align: 64, elements: !490, identifier: "std.core.mem.allocator.TempAllocator")
!490 = !{!491, !492, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !489, file: !7, line: 33, baseType: !59, size: 128, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !489, file: !7, line: 34, baseType: !493, size: 64, align: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !494, size: 64, align: 64, dwarfAddressSpace: 0)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !7, file: !7, line: 54, size: 256, align: 64, elements: !495, identifier: "std.core.mem.allocator.TempAllocatorPage")
!495 = !{!496, !497, !498, !499, !500}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !494, file: !7, line: 56, baseType: !493, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !494, file: !7, line: 57, baseType: !62, size: 64, align: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !494, file: !7, line: 58, baseType: !29, size: 64, align: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !494, file: !7, line: 59, baseType: !29, size: 64, align: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !494, file: !7, line: 60, baseType: !501, align: 8, offset: 256)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, align: 8, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 0, lowerBound: 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !489, file: !7, line: 35, baseType: !488, size: 64, align: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !489, file: !7, line: 36, baseType: !114, size: 8, align: 8, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !489, file: !7, line: 37, baseType: !29, size: 64, align: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !489, file: !7, line: 38, baseType: !29, size: 64, align: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !489, file: !7, line: 39, baseType: !29, size: 64, align: 64, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !489, file: !7, line: 40, baseType: !29, size: 64, align: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !489, file: !7, line: 41, baseType: !29, size: 64, align: 64, offset: 576)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !489, file: !7, line: 42, baseType: !29, size: 64, align: 64, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !489, file: !7, line: 43, baseType: !501, align: 8, offset: 704)
!513 = !DILocation(line: 641, scope: !486, inlinedAt: !514)
!514 = !DILocation(line: 92, scope: !479)
!515 = !DILocalVariable(name: "userpass", scope: !516, file: !7, line: 94, type: !517, align: 8)
!516 = distinct !DILexicalBlock(scope: !479, file: !7, line: 93, column: 4)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !518, identifier: "String[]")
!518 = !{!519, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !517, baseType: !520, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !517, baseType: !29, size: 64, align: 64, offset: 64)
!522 = !DILocation(line: 94, scope: !516)
!523 = !DILocation(line: 95, scope: !516)
!524 = !DILocation(line: 96, scope: !516)
!525 = !DILocation(line: 644, scope: !526, inlinedAt: !514)
!526 = distinct !DILexicalBlock(scope: !486, file: !96, line: 643, column: 2)
!527 = !DILocation(line: 99, scope: !516)
!528 = !DILocation(line: 644, scope: !529, inlinedAt: !514)
!529 = distinct !DILexicalBlock(scope: !486, file: !96, line: 643, column: 2)
!530 = !DILocation(line: 97, scope: !516)
!531 = !DILocation(line: 100, scope: !516)
!532 = !DILocation(line: 644, scope: !533, inlinedAt: !514)
!533 = distinct !DILexicalBlock(scope: !486, file: !96, line: 643, column: 2)
!534 = !DILocation(line: 644, scope: !535, inlinedAt: !514)
!535 = distinct !DILexicalBlock(scope: !486, file: !96, line: 643, column: 2)
!536 = !DILocation(line: 102, scope: !479)
!537 = !DILocalVariable(name: "host", scope: !472, file: !7, line: 106, type: !23, align: 8)
!538 = !DILocation(line: 106, scope: !472)
!539 = !DILocation(line: 107, scope: !472)
!540 = !DILocalVariable(name: "ipv6_end", scope: !541, file: !7, line: 109, type: !29, align: 8)
!541 = distinct !DILexicalBlock(scope: !472, file: !7, line: 108, column: 3)
!542 = !DILocation(line: 109, scope: !541)
!543 = !DILocation(line: 110, scope: !541)
!544 = !DILocation(line: 111, scope: !541)
!545 = !DILocation(line: 113, scope: !546)
!546 = distinct !DILexicalBlock(scope: !541, file: !7, line: 112, column: 4)
!547 = !DILocalVariable(name: "state", scope: !548, file: !7, line: 641, type: !487, align: 8)
!548 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !96, file: !96, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !81)
!549 = !DILocation(line: 641, scope: !548, inlinedAt: !550)
!550 = !DILocation(line: 118, scope: !551)
!551 = distinct !DILexicalBlock(scope: !472, file: !7, line: 117, column: 3)
!552 = !DILocalVariable(name: "host_port", scope: !553, file: !7, line: 120, type: !517, align: 8)
!553 = distinct !DILexicalBlock(scope: !551, file: !7, line: 119, column: 4)
!554 = !DILocation(line: 120, scope: !553)
!555 = !DILocation(line: 121, scope: !553)
!556 = !DILocation(line: 123, scope: !557)
!557 = distinct !DILexicalBlock(scope: !553, file: !7, line: 122, column: 5)
!558 = !DILocation(line: 124, scope: !557)
!559 = !DILocation(line: 644, scope: !560, inlinedAt: !550)
!560 = distinct !DILexicalBlock(scope: !548, file: !96, line: 643, column: 2)
!561 = !DILocation(line: 128, scope: !562)
!562 = distinct !DILexicalBlock(scope: !553, file: !7, line: 127, column: 5)
!563 = !DILocation(line: 644, scope: !564, inlinedAt: !550)
!564 = distinct !DILexicalBlock(scope: !548, file: !96, line: 643, column: 2)
!565 = !DILocation(line: 132, scope: !472)
!566 = !DILocation(line: 133, scope: !472)
!567 = !DILocalVariable(name: "query_index", scope: !445, file: !7, line: 137, type: !30, align: 8)
!568 = !DILocation(line: 137, scope: !445)
!569 = !DILocalVariable(name: "fragment_index", scope: !445, file: !7, line: 138, type: !30, align: 8)
!570 = !DILocation(line: 138, scope: !445)
!571 = !DILocation(line: 434, scope: !572, inlinedAt: !574)
!572 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !573, file: !573, line: 432, scopeLine: 432, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!573 = !DIFile(filename: "builtin.c3", directory: "C:/Compilers/C3/lib/std/core")
!574 = !DILocation(line: 140, scope: !445)
!575 = !DILocation(line: 435, scope: !572, inlinedAt: !574)
!576 = !DILocation(line: 434, scope: !577, inlinedAt: !574)
!577 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !573, file: !573, line: 432, scopeLine: 432, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!578 = !DILocation(line: 435, scope: !577, inlinedAt: !574)
