; ModuleID = 'std::io::os'
source_filename = "std::io::os"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"ushort[]" = type { ptr, i64 }
%File = type { ptr }
%Win32_FILE_ATTRIBUTE_DATA = type { i32, %Win32_FILETIME, %Win32_FILETIME, %Win32_FILETIME, i32, i32 }
%Win32_FILETIME = type { i32, i32 }
%Win32_LARGE_INTEGER = type { i64 }
%List = type { i64, i64, %any, ptr }
%any = type { ptr, i64 }
%PathImp = type { %"char[]", i32, %any }
%"any[]" = type { ptr, i64 }
%Win32_WIN32_FIND_DATAW = type { i32, %Win32_FILETIME, %Win32_FILETIME, %Win32_FILETIME, i32, i32, i32, i32, [260 x i16], [14 x i16], i32, i32, i16 }

$std.io.os.native_file_or_dir_exists = comdat any

$std.io.os.native_is_file = comdat any

$std.io.os.native_is_dir = comdat any

$std.io.os.native_file_size = comdat any

$std.io.os.native_fopen = comdat any

$std.io.os.native_remove = comdat any

$std.io.os.native_freopen = comdat any

$std.io.os.native_fseek = comdat any

$std.io.os.native_ftell = comdat any

$std.io.os.native_fwrite = comdat any

$std.io.os.native_fputc = comdat any

$std.io.os.native_fread = comdat any

$std.io.os.native_ls = comdat any

$std.io.os.native_rmtree = comdat any

$std.io.os.native_temp_directory = comdat any

$std.io.NO_PERMISSION = comdat any

$std.io.OUT_OF_SPACE = comdat any


!0 = !{i32 1, !"CodeView", i32 1}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 2}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 2}
!5 = !{i32 1, !"MaxTLSAlign", i32 65536}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "chdir.c3", directory: "C:/Compilers/C3/lib/std/io/os")
!8 = !{!9, !16}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Seek", scope: !10, file: !10, line: 7, baseType: !11, size: 32, align: 32, elements: !12)
!10 = !DIFile(filename: "file_libc.c3", directory: "C:/Compilers/C3/lib/std/io/os")
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !{!13, !14, !15}
!13 = !DIEnumerator(name: "SET", value: 0)
!14 = !DIEnumerator(name: "CURSOR", value: 1)
!15 = !DIEnumerator(name: "END", value: 2)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !18, file: !17, line: 23, baseType: !11, size: 32, align: 32, elements: !38)
!17 = !DIFile(filename: "ls.c3", directory: "C:/Compilers/C3/lib/std/io/os")
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !17, file: !17, line: 16, size: 320, align: 64, elements: !19, identifier: "std.io.path.PathImp")
!19 = !{!20, !30, !31}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !18, file: !17, line: 18, baseType: !21, size: 128, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !23, identifier: "char[]")
!23 = !{!24, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !22, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !29)
!29 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !18, file: !17, line: 19, baseType: !16, size: 32, align: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !18, file: !17, line: 20, baseType: !32, size: 128, align: 64, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !33, identifier: "Allocator")
!33 = !{!34, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !32, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !32, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!38 = !{!39, !40}
!39 = !DIEnumerator(name: "WIN32", value: 0)
!40 = !DIEnumerator(name: "POSIX", value: 1)
!41 = distinct !DISubprogram(name: "native_file_or_dir_exists", linkageName: "std.io.os.native_file_or_dir_exists", scope: !42, file: !42, line: 64, type: !43, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!42 = !DIFile(filename: "fileinfo.c3", directory: "C:/Compilers/C3/lib/std/io/os")
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !21}
!45 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!46 = !{}
!47 = !DILocalVariable(name: "path", arg: 1, scope: !41, file: !42, line: 64, type: !21)
!48 = !DILocation(line: 64, scope: !41)
!49 = !DILocalVariable(name: "state", scope: !50, file: !42, line: 641, type: !52, align: 8)
!50 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !51, file: !51, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!51 = !DIFile(filename: "mem.c3", directory: "C:/Compilers/C3/lib/std/core")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !42, file: !42, line: 403, baseType: !53, align: 8)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !42, file: !42, line: 31, size: 704, align: 64, elements: !55, identifier: "std.core.mem.allocator.TempAllocator")
!55 = !{!56, !57, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !54, file: !42, line: 33, baseType: !32, size: 128, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !54, file: !42, line: 34, baseType: !58, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !42, file: !42, line: 54, size: 256, align: 64, elements: !60, identifier: "std.core.mem.allocator.TempAllocatorPage")
!60 = !{!61, !62, !63, !64, !65}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !59, file: !42, line: 56, baseType: !58, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !59, file: !42, line: 57, baseType: !35, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !59, file: !42, line: 58, baseType: !28, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !59, file: !42, line: 59, baseType: !28, size: 64, align: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !42, line: 60, baseType: !66, align: 8, offset: 256)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 0, lowerBound: 0)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !54, file: !42, line: 35, baseType: !53, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !54, file: !42, line: 36, baseType: !45, size: 8, align: 8, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !54, file: !42, line: 37, baseType: !28, size: 64, align: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !54, file: !42, line: 38, baseType: !28, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !54, file: !42, line: 39, baseType: !28, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !54, file: !42, line: 40, baseType: !28, size: 64, align: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !54, file: !42, line: 41, baseType: !28, size: 64, align: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !54, file: !42, line: 42, baseType: !28, size: 64, align: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !42, line: 43, baseType: !66, align: 8, offset: 704)
!78 = !DILocation(line: 641, scope: !50, inlinedAt: !79)
!79 = !DILocation(line: 76, scope: !41)
!80 = !DILocation(line: 78, scope: !81)
!81 = distinct !DILexicalBlock(scope: !41, file: !42, line: 77, column: 4)
!82 = !DILocation(line: 644, scope: !83, inlinedAt: !79)
!83 = distinct !DILexicalBlock(scope: !50, file: !51, line: 643, column: 2)
!84 = distinct !DISubprogram(name: "native_is_file", linkageName: "std.io.os.native_is_file", scope: !42, file: !42, line: 90, type: !43, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!85 = !DILocalVariable(name: "path", arg: 1, scope: !84, file: !42, line: 90, type: !21)
!86 = !DILocation(line: 90, scope: !84)
!87 = !DILocalVariable(name: "f", scope: !84, file: !42, line: 102, type: !88, align: 8)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !42, file: !42, line: 4, size: 64, align: 64, elements: !89, identifier: "std.io.File")
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !88, file: !42, line: 6, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !42, file: !42, line: 379, baseType: !35, align: 8)
!92 = !DILocation(line: 102, scope: !84)
!93 = !DILocation(line: 434, scope: !94, inlinedAt: !96)
!94 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !95, file: !95, line: 432, scopeLine: 432, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!95 = !DIFile(filename: "builtin.c3", directory: "C:/Compilers/C3/lib/std/core")
!96 = !DILocation(line: 104, scope: !84)
!97 = !DILocation(line: 435, scope: !94, inlinedAt: !96)
!98 = !DILocation(line: 103, scope: !99)
!99 = distinct !DILexicalBlock(scope: !84, file: !42, line: 103, column: 10)
!100 = distinct !DISubprogram(name: "native_is_dir", linkageName: "std.io.os.native_is_dir", scope: !42, file: !42, line: 108, type: !43, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!101 = !DILocalVariable(name: "path", arg: 1, scope: !100, file: !42, line: 108, type: !21)
!102 = !DILocation(line: 108, scope: !100)
!103 = !DILocation(line: 114, scope: !100)
!104 = distinct !DISubprogram(name: "native_file_size", linkageName: "std.io.os.native_file_size", scope: !42, file: !42, line: 40, type: !105, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !109, !21}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !108)
!108 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!110 = !DILocalVariable(name: "path", arg: 1, scope: !104, file: !42, line: 40, type: !21)
!111 = !DILocation(line: 40, scope: !104)
!112 = !DILocalVariable(name: "state", scope: !113, file: !42, line: 641, type: !52, align: 8)
!113 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !51, file: !51, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!114 = !DILocation(line: 641, scope: !113, inlinedAt: !111)
!115 = !DILocalVariable(name: "data", scope: !116, file: !42, line: 42, type: !117, align: 4)
!116 = distinct !DILexicalBlock(scope: !104, file: !42, line: 41, column: 1)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_FILE_ATTRIBUTE_DATA", scope: !42, file: !42, line: 10, size: 288, align: 32, elements: !118, identifier: "std.os.win32.Win32_FILE_ATTRIBUTE_DATA")
!118 = !{!119, !122, !127, !128, !129, !130}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "dwFileAttributes", scope: !117, file: !42, line: 12, baseType: !120, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_DWORD", scope: !42, file: !42, line: 9, baseType: !121, align: 4)
!121 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ftCreationTime", scope: !117, file: !42, line: 13, baseType: !123, size: 64, align: 32, offset: 32)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_FILETIME", scope: !117, file: !42, line: 257, size: 64, align: 32, elements: !124, identifier: "std.os.win32.Win32_FILETIME")
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dwLowDateTime", scope: !123, file: !42, line: 259, baseType: !120, size: 32, align: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dwHighDateTime", scope: !123, file: !42, line: 260, baseType: !120, size: 32, align: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ftLastAccessTime", scope: !117, file: !42, line: 14, baseType: !123, size: 64, align: 32, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ftLastWriteTime", scope: !117, file: !42, line: 15, baseType: !123, size: 64, align: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nFileSizeHigh", scope: !117, file: !42, line: 16, baseType: !120, size: 32, align: 32, offset: 224)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nFileSizeLow", scope: !117, file: !42, line: 17, baseType: !120, size: 32, align: 32, offset: 256)
!131 = !DILocation(line: 42, scope: !116)
!132 = !DILocation(line: 43, scope: !116)
!133 = !DILocation(line: 644, scope: !134, inlinedAt: !111)
!134 = distinct !DILexicalBlock(scope: !113, file: !51, line: 643, column: 2)
!135 = !DILocalVariable(name: "size", scope: !116, file: !42, line: 44, type: !136, align: 8)
!136 = !DICompositeType(tag: DW_TAG_union_type, name: "Win32_LARGE_INTEGER", scope: !42, file: !42, line: 182, size: 64, align: 64, elements: !137, identifier: "std.os.win32.Win32_LARGE_INTEGER")
!137 = !{!138, !144}
!138 = !DIDerivedType(tag: DW_TAG_member, scope: !136, file: !42, line: 184, baseType: !139, size: 64, align: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !136, file: !42, line: 184, size: 64, align: 64, elements: !140)
!140 = !{!141, !142}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "lowPart", scope: !139, file: !42, line: 186, baseType: !120, size: 32, align: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "highPart", scope: !139, file: !42, line: 187, baseType: !143, size: 32, align: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LONG", scope: !42, file: !42, line: 61, baseType: !11, align: 4)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "quadPart", scope: !136, file: !42, line: 189, baseType: !29, size: 64, align: 64)
!145 = !DILocation(line: 44, scope: !116)
!146 = !DILocation(line: 45, scope: !116)
!147 = !DILocation(line: 46, scope: !116)
!148 = !DILocation(line: 47, scope: !116)
!149 = !DILocation(line: 644, scope: !150, inlinedAt: !111)
!150 = distinct !DILexicalBlock(scope: !113, file: !51, line: 643, column: 2)
!151 = distinct !DISubprogram(name: "native_fopen", linkageName: "std.io.os.native_fopen", scope: !10, file: !10, line: 8, type: !152, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!152 = !DISubroutineType(types: !153)
!153 = !{!107, !154, !21, !21}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!155 = !DILocalVariable(name: "filename", arg: 1, scope: !151, file: !10, line: 8, type: !21)
!156 = !DILocation(line: 8, scope: !151)
!157 = !DILocalVariable(name: "mode", arg: 2, scope: !151, file: !10, line: 8, type: !21)
!158 = !DILocation(line: 5, scope: !159)
!159 = distinct !DILexicalBlock(scope: !151, file: !10, line: 8, column: 65)
!160 = !DILocation(line: 6, scope: !159)
!161 = !DILocalVariable(name: "state", scope: !162, file: !10, line: 641, type: !52, align: 8)
!162 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !51, file: !51, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!163 = !DILocation(line: 641, scope: !162, inlinedAt: !156)
!164 = !DILocalVariable(name: "file", scope: !165, file: !10, line: 11, type: !35, align: 8)
!165 = distinct !DILexicalBlock(scope: !151, file: !10, line: 9, column: 1)
!166 = !DILocation(line: 11, scope: !165)
!167 = !DILocation(line: 644, scope: !168, inlinedAt: !156)
!168 = distinct !DILexicalBlock(scope: !162, file: !51, line: 643, column: 2)
!169 = !DILocation(line: 15, scope: !165)
!170 = !DILocation(line: 81, scope: !171, inlinedAt: !169)
!171 = distinct !DILexicalBlock(scope: !172, file: !10, line: 81, column: 2)
!172 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !10, file: !10, line: 79, scopeLine: 79, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!173 = !DILocation(line: 83, scope: !174, inlinedAt: !169)
!174 = distinct !DILexicalBlock(scope: !171, file: !10, line: 83, column: 23)
!175 = !DILocation(line: 84, scope: !176, inlinedAt: !169)
!176 = distinct !DILexicalBlock(scope: !171, file: !10, line: 84, column: 23)
!177 = !DILocation(line: 85, scope: !178, inlinedAt: !169)
!178 = distinct !DILexicalBlock(scope: !171, file: !10, line: 85, column: 22)
!179 = !DILocation(line: 86, scope: !180, inlinedAt: !169)
!180 = distinct !DILexicalBlock(scope: !171, file: !10, line: 86, column: 23)
!181 = !DILocation(line: 87, scope: !182, inlinedAt: !169)
!182 = distinct !DILexicalBlock(scope: !171, file: !10, line: 87, column: 22)
!183 = !DILocation(line: 88, scope: !184, inlinedAt: !169)
!184 = distinct !DILexicalBlock(scope: !171, file: !10, line: 88, column: 23)
!185 = !DILocation(line: 89, scope: !186, inlinedAt: !169)
!186 = distinct !DILexicalBlock(scope: !171, file: !10, line: 89, column: 23)
!187 = !DILocation(line: 90, scope: !188, inlinedAt: !169)
!188 = distinct !DILexicalBlock(scope: !171, file: !10, line: 90, column: 22)
!189 = !DILocation(line: 91, scope: !190, inlinedAt: !169)
!190 = distinct !DILexicalBlock(scope: !171, file: !10, line: 91, column: 23)
!191 = !DILocation(line: 92, scope: !192, inlinedAt: !169)
!192 = distinct !DILexicalBlock(scope: !171, file: !10, line: 92, column: 29)
!193 = !DILocation(line: 93, scope: !194, inlinedAt: !169)
!194 = distinct !DILexicalBlock(scope: !171, file: !10, line: 93, column: 23)
!195 = !DILocation(line: 94, scope: !196, inlinedAt: !169)
!196 = distinct !DILexicalBlock(scope: !171, file: !10, line: 94, column: 24)
!197 = !DILocation(line: 95, scope: !198, inlinedAt: !169)
!198 = distinct !DILexicalBlock(scope: !171, file: !10, line: 95, column: 23)
!199 = !DILocation(line: 96, scope: !200, inlinedAt: !169)
!200 = distinct !DILexicalBlock(scope: !171, file: !10, line: 96, column: 23)
!201 = !DILocation(line: 97, scope: !202, inlinedAt: !169)
!202 = distinct !DILexicalBlock(scope: !171, file: !10, line: 97, column: 22)
!203 = !DILocation(line: 98, scope: !204, inlinedAt: !169)
!204 = distinct !DILexicalBlock(scope: !171, file: !10, line: 98, column: 26)
!205 = !DILocation(line: 99, scope: !206, inlinedAt: !169)
!206 = distinct !DILexicalBlock(scope: !171, file: !10, line: 99, column: 22)
!207 = !DILocation(line: 100, scope: !208, inlinedAt: !169)
!208 = distinct !DILexicalBlock(scope: !171, file: !10, line: 100, column: 27)
!209 = !DILocation(line: 101, scope: !210, inlinedAt: !169)
!210 = distinct !DILexicalBlock(scope: !171, file: !10, line: 101, column: 20)
!211 = !DILocation(line: 102, scope: !212, inlinedAt: !169)
!212 = distinct !DILexicalBlock(scope: !171, file: !10, line: 102, column: 28)
!213 = !DILocation(line: 103, scope: !214, inlinedAt: !169)
!214 = distinct !DILexicalBlock(scope: !171, file: !10, line: 103, column: 12)
!215 = !DILocation(line: 644, scope: !216, inlinedAt: !156)
!216 = distinct !DILexicalBlock(scope: !162, file: !51, line: 643, column: 2)
!217 = !DILocation(line: 644, scope: !218, inlinedAt: !156)
!218 = distinct !DILexicalBlock(scope: !162, file: !51, line: 643, column: 2)
!219 = distinct !DISubprogram(name: "native_remove", linkageName: "std.io.os.native_remove", scope: !10, file: !10, line: 18, type: !220, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!220 = !DISubroutineType(types: !221)
!221 = !{!107, !35, !21}
!222 = !DILocalVariable(name: "filename", arg: 1, scope: !219, file: !10, line: 18, type: !21)
!223 = !DILocation(line: 18, scope: !219)
!224 = !DILocalVariable(name: "state", scope: !225, file: !10, line: 641, type: !52, align: 8)
!225 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !51, file: !51, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!226 = !DILocation(line: 641, scope: !225, inlinedAt: !223)
!227 = !DILocalVariable(name: "result", scope: !228, file: !10, line: 21, type: !229, align: 4)
!228 = distinct !DILexicalBlock(scope: !219, file: !10, line: 19, column: 1)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !10, file: !10, line: 21, baseType: !11, align: 4)
!230 = !DILocation(line: 21, scope: !228)
!231 = !DILocation(line: 644, scope: !232, inlinedAt: !223)
!232 = distinct !DILexicalBlock(scope: !225, file: !51, line: 643, column: 2)
!233 = !DILocation(line: 25, scope: !228)
!234 = !DILocation(line: 27, scope: !235)
!235 = distinct !DILexicalBlock(scope: !236, file: !10, line: 27, column: 3)
!236 = distinct !DILexicalBlock(scope: !228, file: !10, line: 26, column: 2)
!237 = !DILocation(line: 644, scope: !238, inlinedAt: !223)
!238 = distinct !DILexicalBlock(scope: !225, file: !51, line: 643, column: 2)
!239 = !DILocation(line: 644, scope: !240, inlinedAt: !223)
!240 = distinct !DILexicalBlock(scope: !225, file: !51, line: 643, column: 2)
!241 = !DILocation(line: 644, scope: !242, inlinedAt: !223)
!242 = distinct !DILexicalBlock(scope: !225, file: !51, line: 643, column: 2)
!243 = distinct !DISubprogram(name: "native_freopen", linkageName: "std.io.os.native_freopen", scope: !10, file: !10, line: 42, type: !244, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!244 = !DISubroutineType(types: !245)
!245 = !{!107, !154, !35, !21, !21}
!246 = !DILocalVariable(name: "file", arg: 1, scope: !243, file: !10, line: 42, type: !35)
!247 = !DILocation(line: 42, scope: !243)
!248 = !DILocalVariable(name: "filename", arg: 2, scope: !243, file: !10, line: 42, type: !21)
!249 = !DILocalVariable(name: "mode", arg: 3, scope: !243, file: !10, line: 42, type: !21)
!250 = !DILocation(line: 39, scope: !251)
!251 = distinct !DILexicalBlock(scope: !243, file: !10, line: 42, column: 79)
!252 = !DILocation(line: 40, scope: !251)
!253 = !DILocalVariable(name: "state", scope: !254, file: !10, line: 641, type: !52, align: 8)
!254 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !51, file: !51, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!255 = !DILocation(line: 641, scope: !254, inlinedAt: !247)
!256 = !DILocation(line: 45, scope: !257)
!257 = distinct !DILexicalBlock(scope: !243, file: !10, line: 43, column: 1)
!258 = !DILocation(line: 644, scope: !259, inlinedAt: !247)
!259 = distinct !DILexicalBlock(scope: !254, file: !51, line: 643, column: 2)
!260 = !DILocation(line: 49, scope: !257)
!261 = !DILocation(line: 81, scope: !262, inlinedAt: !260)
!262 = distinct !DILexicalBlock(scope: !263, file: !10, line: 81, column: 2)
!263 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !10, file: !10, line: 79, scopeLine: 79, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!264 = !DILocation(line: 83, scope: !265, inlinedAt: !260)
!265 = distinct !DILexicalBlock(scope: !262, file: !10, line: 83, column: 23)
!266 = !DILocation(line: 84, scope: !267, inlinedAt: !260)
!267 = distinct !DILexicalBlock(scope: !262, file: !10, line: 84, column: 23)
!268 = !DILocation(line: 85, scope: !269, inlinedAt: !260)
!269 = distinct !DILexicalBlock(scope: !262, file: !10, line: 85, column: 22)
!270 = !DILocation(line: 86, scope: !271, inlinedAt: !260)
!271 = distinct !DILexicalBlock(scope: !262, file: !10, line: 86, column: 23)
!272 = !DILocation(line: 87, scope: !273, inlinedAt: !260)
!273 = distinct !DILexicalBlock(scope: !262, file: !10, line: 87, column: 22)
!274 = !DILocation(line: 88, scope: !275, inlinedAt: !260)
!275 = distinct !DILexicalBlock(scope: !262, file: !10, line: 88, column: 23)
!276 = !DILocation(line: 89, scope: !277, inlinedAt: !260)
!277 = distinct !DILexicalBlock(scope: !262, file: !10, line: 89, column: 23)
!278 = !DILocation(line: 90, scope: !279, inlinedAt: !260)
!279 = distinct !DILexicalBlock(scope: !262, file: !10, line: 90, column: 22)
!280 = !DILocation(line: 91, scope: !281, inlinedAt: !260)
!281 = distinct !DILexicalBlock(scope: !262, file: !10, line: 91, column: 23)
!282 = !DILocation(line: 92, scope: !283, inlinedAt: !260)
!283 = distinct !DILexicalBlock(scope: !262, file: !10, line: 92, column: 29)
!284 = !DILocation(line: 93, scope: !285, inlinedAt: !260)
!285 = distinct !DILexicalBlock(scope: !262, file: !10, line: 93, column: 23)
!286 = !DILocation(line: 94, scope: !287, inlinedAt: !260)
!287 = distinct !DILexicalBlock(scope: !262, file: !10, line: 94, column: 24)
!288 = !DILocation(line: 95, scope: !289, inlinedAt: !260)
!289 = distinct !DILexicalBlock(scope: !262, file: !10, line: 95, column: 23)
!290 = !DILocation(line: 96, scope: !291, inlinedAt: !260)
!291 = distinct !DILexicalBlock(scope: !262, file: !10, line: 96, column: 23)
!292 = !DILocation(line: 97, scope: !293, inlinedAt: !260)
!293 = distinct !DILexicalBlock(scope: !262, file: !10, line: 97, column: 22)
!294 = !DILocation(line: 98, scope: !295, inlinedAt: !260)
!295 = distinct !DILexicalBlock(scope: !262, file: !10, line: 98, column: 26)
!296 = !DILocation(line: 99, scope: !297, inlinedAt: !260)
!297 = distinct !DILexicalBlock(scope: !262, file: !10, line: 99, column: 22)
!298 = !DILocation(line: 100, scope: !299, inlinedAt: !260)
!299 = distinct !DILexicalBlock(scope: !262, file: !10, line: 100, column: 27)
!300 = !DILocation(line: 101, scope: !301, inlinedAt: !260)
!301 = distinct !DILexicalBlock(scope: !262, file: !10, line: 101, column: 20)
!302 = !DILocation(line: 102, scope: !303, inlinedAt: !260)
!303 = distinct !DILexicalBlock(scope: !262, file: !10, line: 102, column: 28)
!304 = !DILocation(line: 103, scope: !305, inlinedAt: !260)
!305 = distinct !DILexicalBlock(scope: !262, file: !10, line: 103, column: 12)
!306 = !DILocation(line: 644, scope: !307, inlinedAt: !247)
!307 = distinct !DILexicalBlock(scope: !254, file: !51, line: 643, column: 2)
!308 = !DILocation(line: 644, scope: !309, inlinedAt: !247)
!309 = distinct !DILexicalBlock(scope: !254, file: !51, line: 643, column: 2)
!310 = distinct !DISubprogram(name: "native_fseek", linkageName: "std.io.os.native_fseek", scope: !10, file: !10, line: 52, type: !311, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!311 = !DISubroutineType(types: !312)
!312 = !{!107, !35, !35, !108, !9}
!313 = !DILocalVariable(name: "file", arg: 1, scope: !310, file: !10, line: 52, type: !35)
!314 = !DILocation(line: 52, scope: !310)
!315 = !DILocalVariable(name: "offset", arg: 2, scope: !310, file: !10, line: 52, type: !316)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !108)
!317 = !DILocalVariable(name: "seek_mode", arg: 3, scope: !310, file: !10, line: 52, type: !9)
!318 = !DILocation(line: 54, scope: !310)
!319 = !DILocation(line: 109, scope: !320, inlinedAt: !318)
!320 = distinct !DILexicalBlock(scope: !321, file: !10, line: 109, column: 2)
!321 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !10, file: !10, line: 107, scopeLine: 107, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!322 = !DILocation(line: 111, scope: !323, inlinedAt: !318)
!323 = distinct !DILexicalBlock(scope: !320, file: !10, line: 111, column: 23)
!324 = !DILocation(line: 112, scope: !325, inlinedAt: !318)
!325 = distinct !DILexicalBlock(scope: !320, file: !10, line: 112, column: 22)
!326 = !DILocation(line: 113, scope: !327, inlinedAt: !318)
!327 = distinct !DILexicalBlock(scope: !320, file: !10, line: 113, column: 26)
!328 = !DILocation(line: 114, scope: !329, inlinedAt: !318)
!329 = distinct !DILexicalBlock(scope: !320, file: !10, line: 114, column: 22)
!330 = !DILocation(line: 115, scope: !331, inlinedAt: !318)
!331 = distinct !DILexicalBlock(scope: !320, file: !10, line: 115, column: 23)
!332 = !DILocation(line: 116, scope: !333, inlinedAt: !318)
!333 = distinct !DILexicalBlock(scope: !320, file: !10, line: 116, column: 20)
!334 = !DILocation(line: 117, scope: !335, inlinedAt: !318)
!335 = distinct !DILexicalBlock(scope: !320, file: !10, line: 117, column: 23)
!336 = !DILocation(line: 118, scope: !337, inlinedAt: !318)
!337 = distinct !DILexicalBlock(scope: !320, file: !10, line: 118, column: 22)
!338 = !DILocation(line: 119, scope: !339, inlinedAt: !318)
!339 = distinct !DILexicalBlock(scope: !320, file: !10, line: 119, column: 22)
!340 = !DILocation(line: 120, scope: !341, inlinedAt: !318)
!341 = distinct !DILexicalBlock(scope: !320, file: !10, line: 120, column: 22)
!342 = !DILocation(line: 121, scope: !343, inlinedAt: !318)
!343 = distinct !DILexicalBlock(scope: !320, file: !10, line: 121, column: 23)
!344 = !DILocation(line: 122, scope: !345, inlinedAt: !318)
!345 = distinct !DILexicalBlock(scope: !320, file: !10, line: 122, column: 12)
!346 = distinct !DISubprogram(name: "native_ftell", linkageName: "std.io.os.native_ftell", scope: !10, file: !10, line: 58, type: !347, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!347 = !DISubroutineType(types: !348)
!348 = !{!107, !109, !35}
!349 = !DILocalVariable(name: "file", arg: 1, scope: !346, file: !10, line: 58, type: !91)
!350 = !DILocation(line: 58, scope: !346)
!351 = !DILocalVariable(name: "index", scope: !346, file: !10, line: 60, type: !108, align: 8)
!352 = !DILocation(line: 60, scope: !346)
!353 = !DILocation(line: 61, scope: !346)
!354 = !DILocation(line: 109, scope: !355, inlinedAt: !353)
!355 = distinct !DILexicalBlock(scope: !356, file: !10, line: 109, column: 2)
!356 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !10, file: !10, line: 107, scopeLine: 107, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!357 = !DILocation(line: 111, scope: !358, inlinedAt: !353)
!358 = distinct !DILexicalBlock(scope: !355, file: !10, line: 111, column: 23)
!359 = !DILocation(line: 112, scope: !360, inlinedAt: !353)
!360 = distinct !DILexicalBlock(scope: !355, file: !10, line: 112, column: 22)
!361 = !DILocation(line: 113, scope: !362, inlinedAt: !353)
!362 = distinct !DILexicalBlock(scope: !355, file: !10, line: 113, column: 26)
!363 = !DILocation(line: 114, scope: !364, inlinedAt: !353)
!364 = distinct !DILexicalBlock(scope: !355, file: !10, line: 114, column: 22)
!365 = !DILocation(line: 115, scope: !366, inlinedAt: !353)
!366 = distinct !DILexicalBlock(scope: !355, file: !10, line: 115, column: 23)
!367 = !DILocation(line: 116, scope: !368, inlinedAt: !353)
!368 = distinct !DILexicalBlock(scope: !355, file: !10, line: 116, column: 20)
!369 = !DILocation(line: 117, scope: !370, inlinedAt: !353)
!370 = distinct !DILexicalBlock(scope: !355, file: !10, line: 117, column: 23)
!371 = !DILocation(line: 118, scope: !372, inlinedAt: !353)
!372 = distinct !DILexicalBlock(scope: !355, file: !10, line: 118, column: 22)
!373 = !DILocation(line: 119, scope: !374, inlinedAt: !353)
!374 = distinct !DILexicalBlock(scope: !355, file: !10, line: 119, column: 22)
!375 = !DILocation(line: 120, scope: !376, inlinedAt: !353)
!376 = distinct !DILexicalBlock(scope: !355, file: !10, line: 120, column: 22)
!377 = !DILocation(line: 121, scope: !378, inlinedAt: !353)
!378 = distinct !DILexicalBlock(scope: !355, file: !10, line: 121, column: 23)
!379 = !DILocation(line: 122, scope: !380, inlinedAt: !353)
!380 = distinct !DILexicalBlock(scope: !355, file: !10, line: 122, column: 12)
!381 = distinct !DISubprogram(name: "native_fwrite", linkageName: "std.io.os.native_fwrite", scope: !10, file: !10, line: 64, type: !382, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!382 = !DISubroutineType(types: !383)
!383 = !{!107, !109, !35, !22}
!384 = !DILocalVariable(name: "file", arg: 1, scope: !381, file: !10, line: 64, type: !91)
!385 = !DILocation(line: 64, scope: !381)
!386 = !DILocalVariable(name: "buffer", arg: 2, scope: !381, file: !10, line: 64, type: !22)
!387 = !DILocation(line: 66, scope: !381)
!388 = distinct !DISubprogram(name: "native_fputc", linkageName: "std.io.os.native_fputc", scope: !10, file: !10, line: 69, type: !389, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!389 = !DISubroutineType(types: !390)
!390 = !{!107, !35, !11, !35}
!391 = !DILocalVariable(name: "c", arg: 1, scope: !388, file: !10, line: 69, type: !229)
!392 = !DILocation(line: 69, scope: !388)
!393 = !DILocalVariable(name: "stream", arg: 2, scope: !388, file: !10, line: 69, type: !91)
!394 = !DILocation(line: 71, scope: !388)
!395 = distinct !DISubprogram(name: "native_fread", linkageName: "std.io.os.native_fread", scope: !10, file: !10, line: 74, type: !382, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!396 = !DILocalVariable(name: "file", arg: 1, scope: !395, file: !10, line: 74, type: !91)
!397 = !DILocation(line: 74, scope: !395)
!398 = !DILocalVariable(name: "buffer", arg: 2, scope: !395, file: !10, line: 74, type: !22)
!399 = !DILocation(line: 76, scope: !395)
!400 = distinct !DISubprogram(name: "native_ls", linkageName: "std.io.os.native_ls", scope: !17, file: !17, line: 31, type: !401, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!401 = !DISubroutineType(types: !402)
!402 = !{!107, !403, !18, !45, !45, !21, !32}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PathList*", baseType: !404, size: 64, align: 64, dwarfAddressSpace: 0)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathList", scope: !17, file: !17, line: 10, baseType: !405, align: 8)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !17, file: !17, line: 18, size: 320, align: 64, elements: !406, identifier: "std_collections_list$std.io.path.PathImp$.List")
!406 = !{!407, !408, !409, !410}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !405, file: !17, line: 20, baseType: !28, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !405, file: !17, line: 21, baseType: !28, size: 64, align: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !405, file: !17, line: 22, baseType: !32, size: 128, align: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !405, file: !17, line: 23, baseType: !411, size: 64, align: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !412, size: 64, align: 64, dwarfAddressSpace: 0)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !17, file: !17, line: 10, baseType: !18, align: 8)
!413 = !DILocalVariable(name: "dir", arg: 1, scope: !400, file: !17, line: 31, type: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "Path", scope: !415, file: !415, line: 14, baseType: !18, align: 8)
!415 = !DIFile(filename: "temp_directory.c3", directory: "C:/Compilers/C3/lib/std/io/os")
!416 = !DILocation(line: 31, scope: !400)
!417 = !DILocalVariable(name: "no_dirs", arg: 2, scope: !400, file: !17, line: 31, type: !45)
!418 = !DILocalVariable(name: "no_symlinks", arg: 3, scope: !400, file: !17, line: 31, type: !45)
!419 = !DILocalVariable(name: "mask", arg: 4, scope: !400, file: !17, line: 31, type: !21)
!420 = !DILocalVariable(name: "allocator", arg: 5, scope: !400, file: !17, line: 31, type: !32)
!421 = !DILocalVariable(name: "list", scope: !400, file: !17, line: 33, type: !404, align: 8)
!422 = !DILocation(line: 33, scope: !400)
!423 = !DILocation(line: 34, scope: !400)
!424 = !DILocalVariable(name: "state", scope: !425, file: !17, line: 641, type: !52, align: 8)
!425 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !51, file: !51, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!426 = !DILocation(line: 641, scope: !425, inlinedAt: !427)
!427 = !DILocation(line: 36, scope: !400)
!428 = !DILocalVariable(name: "result", scope: !429, file: !17, line: 38, type: !430, align: 8)
!429 = distinct !DILexicalBlock(scope: !400, file: !17, line: 37, column: 2)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "WString", scope: !17, file: !17, line: 23, baseType: !431, align: 8)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ushort*", baseType: !432, size: 64, align: 64, dwarfAddressSpace: 0)
!432 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!433 = !DILocation(line: 38, scope: !429)
!434 = !DILocalVariable(name: "find_data", scope: !429, file: !17, line: 39, type: !435, align: 4)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_WIN32_FIND_DATAW", scope: !17, file: !17, line: 22, size: 4832, align: 32, elements: !436, identifier: "std.os.win32.Win32_WIN32_FIND_DATAW")
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !449, !453, !454, !455}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dwFileAttributes", scope: !435, file: !17, line: 24, baseType: !120, size: 32, align: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ftCreationTime", scope: !435, file: !17, line: 25, baseType: !123, size: 64, align: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ftLastAccessTime", scope: !435, file: !17, line: 26, baseType: !123, size: 64, align: 32, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ftLastWriteTime", scope: !435, file: !17, line: 27, baseType: !123, size: 64, align: 32, offset: 160)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "nFileSizeHigh", scope: !435, file: !17, line: 28, baseType: !120, size: 32, align: 32, offset: 224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nFileSizeLow", scope: !435, file: !17, line: 29, baseType: !120, size: 32, align: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dwReserved0", scope: !435, file: !17, line: 30, baseType: !120, size: 32, align: 32, offset: 288)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dwReserved1", scope: !435, file: !17, line: 31, baseType: !120, size: 32, align: 32, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cFileName", scope: !435, file: !17, line: 32, baseType: !446, size: 4160, align: 16, offset: 352)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 4160, align: 16, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 260, lowerBound: 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "cAlternateFileName", scope: !435, file: !17, line: 33, baseType: !450, size: 224, align: 16, offset: 4512)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 224, align: 16, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 14, lowerBound: 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dwFileType", scope: !435, file: !17, line: 34, baseType: !120, size: 32, align: 32, offset: 4736)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dwCreatorType", scope: !435, file: !17, line: 35, baseType: !120, size: 32, align: 32, offset: 4768)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "wFinderFlags", scope: !435, file: !17, line: 36, baseType: !456, size: 16, align: 16, offset: 4800)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_WORD", scope: !17, file: !17, line: 170, baseType: !432, align: 2)
!457 = !DILocation(line: 39, scope: !429)
!458 = !DILocalVariable(name: "find", scope: !429, file: !17, line: 40, type: !459, align: 8)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_HANDLE", scope: !17, file: !17, line: 17, baseType: !35, align: 8)
!460 = !DILocation(line: 40, scope: !429)
!461 = !DILocation(line: 41, scope: !429)
!462 = !DILocation(line: 644, scope: !463, inlinedAt: !427)
!463 = distinct !DILexicalBlock(scope: !425, file: !51, line: 643, column: 2)
!464 = !DILocation(line: 43, scope: !429)
!465 = !DILocation(line: 52, scope: !466)
!466 = distinct !DILexicalBlock(scope: !429, file: !17, line: 43, column: 3)
!467 = !DILocation(line: 45, scope: !468)
!468 = distinct !DILexicalBlock(scope: !466, file: !17, line: 44, column: 3)
!469 = !DILocalVariable(name: "state", scope: !470, file: !17, line: 641, type: !52, align: 8)
!470 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !51, file: !51, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!471 = !DILocation(line: 641, scope: !470, inlinedAt: !472)
!472 = !DILocation(line: 46, scope: !468)
!473 = !DILocalVariable(name: "filename", scope: !474, file: !17, line: 48, type: !21, align: 8)
!474 = distinct !DILexicalBlock(scope: !468, file: !17, line: 47, column: 4)
!475 = !DILocation(line: 48, scope: !474)
!476 = !DILocation(line: 644, scope: !477, inlinedAt: !472)
!477 = distinct !DILexicalBlock(scope: !470, file: !51, line: 643, column: 2)
!478 = !DILocation(line: 42, scope: !479)
!479 = distinct !DILexicalBlock(scope: !429, file: !17, line: 42, column: 9)
!480 = !DILocation(line: 644, scope: !481, inlinedAt: !427)
!481 = distinct !DILexicalBlock(scope: !425, file: !51, line: 643, column: 2)
!482 = !DILocation(line: 49, scope: !474)
!483 = !DILocation(line: 644, scope: !484, inlinedAt: !472)
!484 = distinct !DILexicalBlock(scope: !470, file: !51, line: 643, column: 2)
!485 = !DILocation(line: 50, scope: !474)
!486 = !DILocation(line: 644, scope: !487, inlinedAt: !472)
!487 = distinct !DILexicalBlock(scope: !470, file: !51, line: 643, column: 2)
!488 = !DILocation(line: 42, scope: !489)
!489 = distinct !DILexicalBlock(scope: !429, file: !17, line: 42, column: 9)
!490 = !DILocation(line: 644, scope: !491, inlinedAt: !427)
!491 = distinct !DILexicalBlock(scope: !425, file: !51, line: 643, column: 2)
!492 = !DILocation(line: 644, scope: !493, inlinedAt: !472)
!493 = distinct !DILexicalBlock(scope: !470, file: !51, line: 643, column: 2)
!494 = !DILocation(line: 42, scope: !495)
!495 = distinct !DILexicalBlock(scope: !429, file: !17, line: 42, column: 9)
!496 = !DILocation(line: 644, scope: !497, inlinedAt: !427)
!497 = distinct !DILexicalBlock(scope: !425, file: !51, line: 643, column: 2)
!498 = distinct !DISubprogram(name: "native_rmtree", linkageName: "std.io.os.native_rmtree", scope: !499, file: !499, line: 41, type: !500, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!499 = !DIFile(filename: "rmtree.c3", directory: "C:/Compilers/C3/lib/std/io/os")
!500 = !DISubroutineType(types: !501)
!501 = !{!107, !35, !18}
!502 = !DILocalVariable(name: "path", arg: 1, scope: !498, file: !499, line: 41, type: !414)
!503 = !DILocation(line: 41, scope: !498)
!504 = !DILocalVariable(name: "find_data", scope: !498, file: !499, line: 43, type: !435, align: 4)
!505 = !DILocation(line: 43, scope: !498)
!506 = !DILocalVariable(name: "s", scope: !498, file: !499, line: 44, type: !21, align: 8)
!507 = !DILocation(line: 44, scope: !498)
!508 = !DILocalVariable(name: "find", scope: !498, file: !499, line: 45, type: !459, align: 8)
!509 = !DILocation(line: 45, scope: !498)
!510 = !DILocation(line: 47, scope: !498)
!511 = !DILocation(line: 49, scope: !498)
!512 = !DILocation(line: 65, scope: !513)
!513 = distinct !DILexicalBlock(scope: !498, file: !499, line: 49, column: 2)
!514 = !DILocalVariable(name: "state", scope: !515, file: !499, line: 641, type: !52, align: 8)
!515 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !51, file: !51, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!516 = !DILocation(line: 641, scope: !515, inlinedAt: !517)
!517 = !DILocation(line: 51, scope: !518)
!518 = distinct !DILexicalBlock(scope: !513, file: !499, line: 50, column: 2)
!519 = !DILocalVariable(name: "filename", scope: !520, file: !499, line: 53, type: !21, align: 8)
!520 = distinct !DILexicalBlock(scope: !518, file: !499, line: 52, column: 3)
!521 = !DILocation(line: 53, scope: !520)
!522 = !DILocation(line: 644, scope: !523, inlinedAt: !517)
!523 = distinct !DILexicalBlock(scope: !515, file: !51, line: 643, column: 2)
!524 = !DILocation(line: 48, scope: !525)
!525 = distinct !DILexicalBlock(scope: !498, file: !499, line: 48, column: 8)
!526 = !DILocation(line: 54, scope: !520)
!527 = !DILocation(line: 644, scope: !528, inlinedAt: !517)
!528 = distinct !DILexicalBlock(scope: !515, file: !51, line: 643, column: 2)
!529 = !DILocalVariable(name: "file_path", scope: !520, file: !499, line: 55, type: !414, align: 8)
!530 = !DILocation(line: 55, scope: !520)
!531 = !DILocation(line: 644, scope: !532, inlinedAt: !517)
!532 = distinct !DILexicalBlock(scope: !515, file: !51, line: 643, column: 2)
!533 = !DILocation(line: 48, scope: !534)
!534 = distinct !DILexicalBlock(scope: !498, file: !499, line: 48, column: 8)
!535 = !DILocation(line: 56, scope: !520)
!536 = !DILocation(line: 58, scope: !537)
!537 = distinct !DILexicalBlock(scope: !520, file: !499, line: 57, column: 4)
!538 = !DILocation(line: 644, scope: !539, inlinedAt: !517)
!539 = distinct !DILexicalBlock(scope: !515, file: !51, line: 643, column: 2)
!540 = !DILocation(line: 48, scope: !541)
!541 = distinct !DILexicalBlock(scope: !498, file: !499, line: 48, column: 8)
!542 = !DILocation(line: 62, scope: !543)
!543 = distinct !DILexicalBlock(scope: !520, file: !499, line: 61, column: 4)
!544 = !DILocation(line: 644, scope: !545, inlinedAt: !517)
!545 = distinct !DILexicalBlock(scope: !515, file: !51, line: 643, column: 2)
!546 = !DILocalVariable(name: "state", scope: !547, file: !499, line: 641, type: !52, align: 8)
!547 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !51, file: !51, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!548 = !DILocation(line: 641, scope: !547, inlinedAt: !549)
!549 = !DILocation(line: 9, scope: !550, inlinedAt: !552)
!550 = distinct !DISubprogram(name: "native_rmdir", linkageName: "native_rmdir", scope: !551, file: !551, line: 7, scopeLine: 7, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!551 = !DIFile(filename: "rmdir.c3", directory: "C:/Compilers/C3/lib/std/io/os")
!552 = !DILocation(line: 66, scope: !498)
!553 = !DILocation(line: 29, scope: !554, inlinedAt: !552)
!554 = distinct !DILexicalBlock(scope: !550, file: !551, line: 10, column: 2)
!555 = !DILocation(line: 644, scope: !556, inlinedAt: !549)
!556 = distinct !DILexicalBlock(scope: !547, file: !51, line: 643, column: 2)
!557 = !DILocation(line: 30, scope: !558, inlinedAt: !552)
!558 = distinct !DILexicalBlock(scope: !554, file: !551, line: 30, column: 4)
!559 = !DILocation(line: 33, scope: !560, inlinedAt: !552)
!560 = distinct !DILexicalBlock(scope: !558, file: !551, line: 33, column: 6)
!561 = !DILocation(line: 644, scope: !562, inlinedAt: !549)
!562 = distinct !DILexicalBlock(scope: !547, file: !51, line: 643, column: 2)
!563 = !DILocation(line: 35, scope: !564, inlinedAt: !552)
!564 = distinct !DILexicalBlock(scope: !558, file: !551, line: 35, column: 6)
!565 = !DILocation(line: 644, scope: !566, inlinedAt: !549)
!566 = distinct !DILexicalBlock(scope: !547, file: !51, line: 643, column: 2)
!567 = !DILocation(line: 37, scope: !568, inlinedAt: !552)
!568 = distinct !DILexicalBlock(scope: !558, file: !551, line: 37, column: 6)
!569 = !DILocation(line: 644, scope: !570, inlinedAt: !549)
!570 = distinct !DILexicalBlock(scope: !547, file: !51, line: 643, column: 2)
!571 = !DILocation(line: 40, scope: !572, inlinedAt: !552)
!572 = distinct !DILexicalBlock(scope: !558, file: !551, line: 40, column: 6)
!573 = !DILocation(line: 644, scope: !574, inlinedAt: !549)
!574 = distinct !DILexicalBlock(scope: !547, file: !51, line: 643, column: 2)
!575 = !DILocation(line: 42, scope: !576, inlinedAt: !552)
!576 = distinct !DILexicalBlock(scope: !558, file: !551, line: 42, column: 6)
!577 = !DILocation(line: 644, scope: !578, inlinedAt: !549)
!578 = distinct !DILexicalBlock(scope: !547, file: !51, line: 643, column: 2)
!579 = !DILocation(line: 48, scope: !580)
!580 = distinct !DILexicalBlock(scope: !498, file: !499, line: 48, column: 8)
!581 = !DILocation(line: 48, scope: !582)
!582 = distinct !DILexicalBlock(scope: !498, file: !499, line: 48, column: 8)
!583 = distinct !DISubprogram(name: "native_temp_directory", linkageName: "std.io.os.native_temp_directory", scope: !415, file: !415, line: 14, type: !584, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!584 = !DISubroutineType(types: !585)
!585 = !{!107, !586, !32}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Path*", baseType: !414, size: 64, align: 64, dwarfAddressSpace: 0)
!587 = !DILocalVariable(name: "allocator", arg: 1, scope: !583, file: !415, line: 14, type: !32)
!588 = !DILocation(line: 14, scope: !583)
!589 = !DILocalVariable(name: "state", scope: !590, file: !415, line: 641, type: !52, align: 8)
!590 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !51, file: !51, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!591 = !DILocation(line: 641, scope: !590, inlinedAt: !588)
!592 = !DILocalVariable(name: "len", scope: !593, file: !415, line: 16, type: !120, align: 4)
!593 = distinct !DILexicalBlock(scope: !583, file: !415, line: 15, column: 1)
!594 = !DILocation(line: 16, scope: !593)
!595 = !DILocation(line: 17, scope: !593)
!596 = !DILocation(line: 644, scope: !597, inlinedAt: !588)
!597 = distinct !DILexicalBlock(scope: !590, file: !51, line: 643, column: 2)
!598 = !DILocalVariable(name: "buff", scope: !593, file: !415, line: 18, type: !599, align: 8)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "Char16[]", size: 128, align: 64, elements: !600, identifier: "Char16[]")
!600 = !{!601, !604}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !599, baseType: !602, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Char16*", baseType: !603, size: 64, align: 64, dwarfAddressSpace: 0)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char16", scope: !415, file: !415, line: 33, baseType: !432, align: 2)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !599, baseType: !28, size: 64, align: 64, offset: 64)
!605 = !DILocation(line: 18, scope: !593)
!606 = !DILocation(line: 879, scope: !607, inlinedAt: !605)
!607 = distinct !DISubprogram(name: "talloc_array", linkageName: "talloc_array", scope: !51, file: !51, line: 877, scopeLine: 877, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!608 = !DILocation(line: 19, scope: !593)
!609 = !DILocation(line: 644, scope: !610, inlinedAt: !588)
!610 = distinct !DILexicalBlock(scope: !590, file: !51, line: 643, column: 2)
!611 = !DILocation(line: 20, scope: !593)
!612 = !DILocation(line: 644, scope: !613, inlinedAt: !588)
!613 = distinct !DILexicalBlock(scope: !590, file: !51, line: 643, column: 2)
!614 = !DILocation(line: 644, scope: !615, inlinedAt: !588)
!615 = distinct !DILexicalBlock(scope: !590, file: !51, line: 643, column: 2)
