; ModuleID = 'std::collections::object'
source_filename = "std::collections::object"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%Object = type { i64, %any, %.anon }
%.anon = type { i128, [32 x i8] }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"char[][]" = type { ptr, i64 }
%HashMap = type { %"Entry*[]", %any, i32, i32, float }
%"Entry*[]" = type { ptr, i64 }

$std.collections.object.Object.to_format = comdat any

$std.collections.object.Object.free = comdat any

$std.collections.object.Object.is_null = comdat any

$std.collections.object.Object.is_empty = comdat any

$std.collections.object.Object.is_map = comdat any

$std.collections.object.Object.is_array = comdat any

$std.collections.object.Object.is_bool = comdat any

$std.collections.object.Object.is_string = comdat any

$std.collections.object.Object.is_float = comdat any

$std.collections.object.Object.is_int = comdat any

$std.collections.object.Object.is_keyable = comdat any

$std.collections.object.Object.is_indexable = comdat any

$std.collections.object.Object.set_object = comdat any

$std.collections.object.Object.get = comdat any

$std.collections.object.Object.has_key = comdat any

$std.collections.object.Object.get_at = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "TRUE_OBJECT", linkageName: "std.collections.object.TRUE_OBJECT", scope: !2, file: !2, line: 7, type: !3, isLocal: false, isDefinition: true, align: 16)
!2 = !DIFile(filename: "object.c3", directory: "C:/Compilers/C3/lib/std/collections")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !2, file: !2, line: 11, size: 640, align: 128, elements: !4, identifier: "std.collections.object.Object")
!4 = !{!5, !7, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !3, file: !2, line: 13, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!7 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 14, baseType: !8, size: 128, align: 64, offset: 64)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !9, identifier: "Allocator")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !8, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, baseType: !6, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, scope: !3, file: !2, line: 15, baseType: !14, size: 384, align: 128, offset: 256)
!14 = !DICompositeType(tag: DW_TAG_union_type, scope: !3, file: !2, line: 15, size: 384, align: 128, elements: !15)
!15 = !{!16, !18, !20, !22, !32, !33, !44}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !14, file: !2, line: 17, baseType: !17, size: 128, align: 128)
!17 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !14, file: !2, line: 18, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !14, file: !2, line: 19, baseType: !21, size: 8, align: 8)
!21 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !14, file: !2, line: 20, baseType: !23, size: 128, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !25, identifier: "char[]")
!25 = !{!26, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !24, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !31)
!31 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !14, file: !2, line: 21, baseType: !11, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !14, file: !2, line: 22, baseType: !34, size: 320, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !2, file: !2, line: 466, baseType: !35, align: 8)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !36, identifier: "std_collections_list$p$std.collections.object.Object$.List")
!36 = !{!37, !38, !39, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !35, file: !2, line: 20, baseType: !30, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !35, file: !2, line: 21, baseType: !30, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !35, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !35, file: !2, line: 23, baseType: !41, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 466, baseType: !43, align: 8)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !14, file: !2, line: 23, baseType: !45, size: 384, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !2, file: !2, line: 465, baseType: !46, align: 8)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !2, file: !2, line: 29, size: 384, align: 64, elements: !47, identifier: "std_collections_map$String$p$std.collections.object.Object$.HashMap")
!47 = !{!48, !64, !65, !66, !67}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !46, file: !2, line: 31, baseType: !49, size: 128, align: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !50, identifier: "Entry*[]")
!50 = !{!51, !63}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !49, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !2, file: !2, line: 21, size: 320, align: 64, elements: !55, identifier: "std_collections_map$String$p$std.collections.object.Object$.Entry")
!55 = !{!56, !58, !60, !62}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !54, file: !2, line: 23, baseType: !57, size: 32, align: 32)
!57 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !54, file: !2, line: 24, baseType: !59, size: 128, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !2, file: !2, line: 465, baseType: !23, align: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !54, file: !2, line: 25, baseType: !61, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !2, file: !2, line: 465, baseType: !43, align: 8)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !2, line: 26, baseType: !53, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, baseType: !30, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !46, file: !2, line: 32, baseType: !8, size: 128, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !46, file: !2, line: 33, baseType: !57, size: 32, align: 32, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !46, file: !2, line: 34, baseType: !57, size: 32, align: 32, offset: 288)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !46, file: !2, line: 35, baseType: !68, size: 32, align: 32, offset: 320)
!68 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "FALSE_OBJECT", linkageName: "std.collections.object.FALSE_OBJECT", scope: !2, file: !2, line: 8, type: !3, isLocal: false, isDefinition: true, align: 16)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "NULL_OBJECT", linkageName: "std.collections.object.NULL_OBJECT", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 16)
!73 = !{i32 1, !"CodeView", i32 1}
!74 = !{i32 2, !"Debug Info Version", i32 3}
!75 = !{i32 2, !"wchar_size", i32 2}
!76 = !{i32 4, !"PIC Level", i32 2}
!77 = !{i32 1, !"uwtable", i32 2}
!78 = !{i32 1, !"MaxTLSAlign", i32 65536}
!79 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !80, splitDebugInlining: false)
!80 = !{!0, !69, !71}
!81 = distinct !DISubprogram(name: "to_format", linkageName: "std.collections.object.Object.to_format", scope: !2, file: !2, line: 28, type: !82, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !79, retainedNodes: !103)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !86, !43, !87}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !85)
!85 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 63, size: 320, align: 64, elements: !89, identifier: "std.io.Formatter")
!89 = !{!90, !91, !96}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !88, file: !2, line: 65, baseType: !11, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !88, file: !2, line: 66, baseType: !92, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 16, baseType: !93, align: 8)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !94, size: 64, align: 64, dwarfAddressSpace: 0)
!94 = !DISubroutineType(types: !95)
!95 = !{!84, !11, !11, !28}
!96 = !DIDerivedType(tag: DW_TAG_member, scope: !88, file: !2, line: 67, baseType: !97, size: 192, align: 64, offset: 128)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !88, file: !2, line: 67, size: 192, align: 64, elements: !98)
!98 = !{!99, !100, !101, !102}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !97, file: !2, line: 69, baseType: !57, size: 32, align: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !97, file: !2, line: 70, baseType: !57, size: 32, align: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !97, file: !2, line: 71, baseType: !57, size: 32, align: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !97, file: !2, line: 72, baseType: !84, size: 64, align: 64, offset: 128)
!103 = !{}
!104 = !DILocation(line: 29, scope: !81)
!105 = !DILocalVariable(name: "self", arg: 1, scope: !81, file: !2, line: 28, type: !43)
!106 = !DILocation(line: 28, scope: !81)
!107 = !DILocalVariable(name: "formatter", arg: 2, scope: !81, file: !2, line: 28, type: !87)
!108 = !DILocation(line: 30, scope: !109)
!109 = distinct !DILexicalBlock(scope: !81, file: !2, line: 30, column: 2)
!110 = !DILocation(line: 32, scope: !109)
!111 = !DILocation(line: 33, scope: !112)
!112 = distinct !DILexicalBlock(scope: !109, file: !2, line: 33, column: 4)
!113 = !DILocation(line: 34, scope: !109)
!114 = !DILocation(line: 35, scope: !115)
!115 = distinct !DILexicalBlock(scope: !109, file: !2, line: 35, column: 4)
!116 = !DILocation(line: 36, scope: !109)
!117 = !DILocation(line: 37, scope: !118)
!118 = distinct !DILexicalBlock(scope: !109, file: !2, line: 37, column: 4)
!119 = !DILocation(line: 38, scope: !109)
!120 = !DILocation(line: 39, scope: !121)
!121 = distinct !DILexicalBlock(scope: !109, file: !2, line: 39, column: 4)
!122 = !DILocation(line: 40, scope: !109)
!123 = !DILocalVariable(name: "n", scope: !124, file: !2, line: 41, type: !30, align: 8)
!124 = distinct !DILexicalBlock(scope: !109, file: !2, line: 41, column: 4)
!125 = !DILocation(line: 41, scope: !124)
!126 = !DILocation(line: 42, scope: !127)
!127 = distinct !DILexicalBlock(scope: !124, file: !2, line: 42, column: 4)
!128 = !DILocalVariable(name: ".temp", scope: !127, file: !2, line: 42, type: !30, align: 8)
!129 = !DILocalVariable(name: "i", scope: !130, file: !2, line: 42, type: !30, align: 8)
!130 = distinct !DILexicalBlock(scope: !127, file: !2, line: 43, column: 4)
!131 = !DILocation(line: 42, scope: !130)
!132 = !DILocalVariable(name: "ol", scope: !130, file: !2, line: 42, type: !42, align: 8)
!133 = !DILocation(line: 378, scope: !134, inlinedAt: !131)
!134 = distinct !DILexicalBlock(scope: !136, file: !135, line: 379, column: 1)
!135 = !DIFile(filename: "list.c3", directory: "C:/Compilers/C3/lib/std/collections")
!136 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !135, file: !135, line: 378, scopeLine: 378, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79)
!137 = !DILocation(line: 376, scope: !134, inlinedAt: !131)
!138 = !DILocation(line: 42, scope: !134, inlinedAt: !131)
!139 = !DILocation(line: 380, scope: !136, inlinedAt: !131)
!140 = !DILocation(line: 44, scope: !141)
!141 = distinct !DILexicalBlock(scope: !130, file: !2, line: 43, column: 4)
!142 = !DILocation(line: 45, scope: !141)
!143 = !DILocation(line: 47, scope: !124)
!144 = !DILocation(line: 48, scope: !124)
!145 = !DILocation(line: 49, scope: !109)
!146 = !DILocalVariable(name: "n", scope: !147, file: !2, line: 50, type: !30, align: 8)
!147 = distinct !DILexicalBlock(scope: !109, file: !2, line: 50, column: 4)
!148 = !DILocation(line: 50, scope: !147)
!149 = !DILocalVariable(name: "buffer", scope: !150, file: !2, line: 572, type: !152, align: 16)
!150 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !151, file: !151, line: 570, scopeLine: 570, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79, retainedNodes: !103)
!151 = !DIFile(filename: "mem.c3", directory: "C:/Compilers/C3/lib/std/core")
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, align: 8, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 1024, lowerBound: 0)
!155 = !DILocation(line: 572, scope: !150, inlinedAt: !156)
!156 = !DILocation(line: 51, scope: !147)
!157 = !DILocalVariable(name: "allocator", scope: !150, file: !2, line: 573, type: !158, align: 8)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 12, size: 384, align: 64, elements: !159, identifier: "std.core.mem.allocator.OnStackAllocator")
!159 = !{!160, !161, !162, !163}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !158, file: !2, line: 14, baseType: !8, size: 128, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !158, file: !2, line: 15, baseType: !24, size: 128, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !158, file: !2, line: 16, baseType: !30, size: 64, align: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !158, file: !2, line: 17, baseType: !164, size: 64, align: 64, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !165, size: 64, align: 64, dwarfAddressSpace: 0)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !166, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.8319")
!166 = !{!167, !168, !169}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !165, file: !2, line: 22, baseType: !21, size: 8, align: 8)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !165, file: !2, line: 23, baseType: !164, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !165, file: !2, line: 24, baseType: !11, size: 64, align: 64, offset: 128)
!170 = !DILocation(line: 573, scope: !150, inlinedAt: !156)
!171 = !DILocation(line: 574, scope: !150, inlinedAt: !156)
!172 = !DILocalVariable(name: "mem", scope: !147, file: !2, line: 51, type: !8, align: 8)
!173 = !DILocation(line: 576, scope: !174, inlinedAt: !156)
!174 = distinct !DILexicalBlock(scope: !150, file: !151, line: 576, column: 2)
!175 = !DILocation(line: 53, scope: !176)
!176 = distinct !DILexicalBlock(scope: !177, file: !2, line: 53, column: 5)
!177 = distinct !DILexicalBlock(scope: !147, file: !2, line: 52, column: 4)
!178 = !DILocalVariable(name: ".temp", scope: !176, file: !2, line: 53, type: !30, align: 8)
!179 = !DILocalVariable(name: "i", scope: !180, file: !2, line: 53, type: !30, align: 8)
!180 = distinct !DILexicalBlock(scope: !176, file: !2, line: 54, column: 5)
!181 = !DILocation(line: 53, scope: !180)
!182 = !DILocalVariable(name: "key", scope: !180, file: !2, line: 53, type: !23, align: 8)
!183 = !DILocation(line: 55, scope: !184)
!184 = distinct !DILexicalBlock(scope: !180, file: !2, line: 54, column: 5)
!185 = !DILocation(line: 575, scope: !186, inlinedAt: !156)
!186 = distinct !DILexicalBlock(scope: !150, file: !151, line: 575, column: 8)
!187 = !DILocation(line: 56, scope: !184)
!188 = !DILocation(line: 575, scope: !189, inlinedAt: !156)
!189 = distinct !DILexicalBlock(scope: !150, file: !151, line: 575, column: 8)
!190 = !DILocation(line: 57, scope: !184)
!191 = !DILocation(line: 575, scope: !192, inlinedAt: !156)
!192 = distinct !DILexicalBlock(scope: !150, file: !151, line: 575, column: 8)
!193 = !DILocation(line: 575, scope: !194, inlinedAt: !156)
!194 = distinct !DILexicalBlock(scope: !150, file: !151, line: 575, column: 8)
!195 = !DILocation(line: 60, scope: !147)
!196 = !DILocation(line: 61, scope: !147)
!197 = !DILocation(line: 63, scope: !198)
!198 = distinct !DILexicalBlock(scope: !199, file: !2, line: 63, column: 4)
!199 = distinct !DILexicalBlock(scope: !109, file: !2, line: 63, column: 4)
!200 = !DILocation(line: 66, scope: !201)
!201 = distinct !DILexicalBlock(scope: !198, file: !2, line: 66, column: 6)
!202 = !DILocation(line: 68, scope: !203)
!203 = distinct !DILexicalBlock(scope: !198, file: !2, line: 68, column: 6)
!204 = !DILocation(line: 70, scope: !205)
!205 = distinct !DILexicalBlock(scope: !198, file: !2, line: 70, column: 6)
!206 = !DILocation(line: 72, scope: !207)
!207 = distinct !DILexicalBlock(scope: !198, file: !2, line: 72, column: 6)
!208 = !DILocation(line: 74, scope: !209)
!209 = distinct !DILexicalBlock(scope: !198, file: !2, line: 74, column: 6)
!210 = distinct !DISubprogram(name: "free", linkageName: "std.collections.object.Object.free", scope: !2, file: !2, line: 115, type: !211, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !79, retainedNodes: !103)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !43}
!213 = !DILocation(line: 116, scope: !210)
!214 = !DILocalVariable(name: "self", arg: 1, scope: !210, file: !2, line: 115, type: !43)
!215 = !DILocation(line: 115, scope: !210)
!216 = !DILocation(line: 117, scope: !217)
!217 = distinct !DILexicalBlock(scope: !210, file: !2, line: 117, column: 2)
!218 = !DILocation(line: 119, scope: !217)
!219 = !DILocation(line: 120, scope: !220)
!220 = distinct !DILexicalBlock(scope: !217, file: !2, line: 120, column: 4)
!221 = !DILocation(line: 121, scope: !217)
!222 = !DILocation(line: 122, scope: !223)
!223 = distinct !DILexicalBlock(scope: !217, file: !2, line: 122, column: 4)
!224 = !DILocation(line: 119, scope: !225, inlinedAt: !222)
!225 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !226, file: !226, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79)
!226 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Compilers/C3/lib/std/core")
!227 = !DILocation(line: 123, scope: !225, inlinedAt: !222)
