; ModuleID = 'std::net'
source_filename = "std::net"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%InetAddress = type { i8, %.anon }
%.anon = type { [8 x i16] }
%AddrInfo = type { i32, i32, i32, i32, i64, %.anon.0, ptr }
%.anon.0 = type { ptr, ptr }
%"Poll[]" = type { ptr, i64 }
%Socket = type { ptr, i64, [128 x i8] }
%Poll = type { ptr, i16, i16 }

$std.net.InetAddress.to_format = comdat any

$std.net.InetAddress.to_string = comdat any

$std.net.InetAddress.to_tstring = comdat any

$std.net.InetAddress.is_loopback = comdat any

$std.net.InetAddress.is_any_local = comdat any

$std.net.InetAddress.is_link_local = comdat any

$std.net.InetAddress.is_site_local = comdat any

$std.net.InetAddress.is_multicast = comdat any

$std.net.InetAddress.is_multicast_global = comdat any

$std.net.InetAddress.is_multicast_node_local = comdat any

$std.net.InetAddress.is_multicast_site_local = comdat any

$std.net.InetAddress.is_multicast_org_local = comdat any

$std.net.InetAddress.is_multicast_link_local = comdat any

$std.net.ipv6_from_str = comdat any

$std.net.ipv4_from_str = comdat any

$std.net.addrinfo = comdat any

$std.net.ipv4toint = comdat any

$std.net.int_to_ipv4 = comdat any

$std.net.Socket.get_broadcast = comdat any


!27 = distinct !DIGlobalVariable(name: "POLL_EVENT_READ", linkageName: "std.net.POLL_EVENT_READ", scope: !2, file: !2, line: 41, type: !23, isLocal: false, isDefinition: true, align: 2)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "POLL_EVENT_WRITE_OOB", linkageName: "std.net.POLL_EVENT_WRITE_OOB", scope: !2, file: !2, line: 42, type: !23, isLocal: false, isDefinition: true, align: 2)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "POLL_EVENT_WRITE", linkageName: "std.net.POLL_EVENT_WRITE", scope: !2, file: !2, line: 43, type: !23, isLocal: false, isDefinition: true, align: 2)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "POLL_EVENT_DISCONNECT", linkageName: "std.net.POLL_EVENT_DISCONNECT", scope: !2, file: !2, line: 44, type: !23, isLocal: false, isDefinition: true, align: 2)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "POLL_EVENT_ERROR", linkageName: "std.net.POLL_EVENT_ERROR", scope: !2, file: !2, line: 45, type: !23, isLocal: false, isDefinition: true, align: 2)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "POLL_EVENT_INVALID", linkageName: "std.net.POLL_EVENT_INVALID", scope: !2, file: !2, line: 46, type: !23, isLocal: false, isDefinition: true, align: 2)
!38 = !{i32 1, !"CodeView", i32 1}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 2, !"wchar_size", i32 2}
!41 = !{i32 4, !"PIC Level", i32 2}
!42 = !{i32 1, !"uwtable", i32 2}
!43 = !{i32 1, !"MaxTLSAlign", i32 65536}
!44 = distinct !DICompileUnit(language: DW_LANG_C11, file: !45, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, globals: !61, splitDebugInlining: false)
!45 = !DIFile(filename: "inetaddr.c3", directory: "C:/Compilers/C3/lib/std/net")
!46 = !{!47, !55}
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SocketOption", scope: !2, file: !2, line: 87, baseType: !48, size: 8, align: 8, elements: !49)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIEnumerator(name: "REUSEADDR", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "KEEPALIVE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "BROADCAST", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "OOBINLINE", value: 3, isUnsigned: true)
!54 = !DIEnumerator(name: "DONTROUTE", value: 4, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SocketShutdownHow", scope: !2, file: !2, line: 170, baseType: !56, size: 32, align: 32, elements: !57)
!56 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!57 = !{!58, !59, !60}
!58 = !DIEnumerator(name: "RECEIVE", value: 0)
!59 = !DIEnumerator(name: "SEND", value: 1)
!60 = !DIEnumerator(name: "BOTH", value: 2)
!61 = !{!0, !5, !9, !11, !13, !15, !17, !19, !21, !24, !26, !28, !30, !32, !34, !36}
!62 = distinct !DISubprogram(name: "to_format", linkageName: "std.net.InetAddress.to_format", scope: !45, file: !45, line: 47, type: !63, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !66, !69, !88}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !4)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !68)
!68 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "InetAddress*", baseType: !70, size: 64, align: 64, dwarfAddressSpace: 0)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "InetAddress", scope: !45, file: !45, line: 11, size: 144, align: 16, elements: !71, identifier: "std.net.InetAddress")
!71 = !{!72, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "is_ipv6", scope: !70, file: !45, line: 13, baseType: !73, size: 8, align: 8)
!73 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!74 = !DIDerivedType(tag: DW_TAG_member, scope: !70, file: !45, line: 14, baseType: !75, size: 128, align: 16, offset: 16)
!75 = !DICompositeType(tag: DW_TAG_union_type, scope: !70, file: !45, line: 14, size: 128, align: 16, elements: !76)
!76 = !{!77, !81, !82, !86, !87}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6", scope: !75, file: !45, line: 16, baseType: !78, size: 128, align: 16)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 128, align: 8, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 16, lowerBound: 0)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !75, file: !45, line: 27, baseType: !78, size: 128, align: 16)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6arr", scope: !75, file: !45, line: 31, baseType: !83, size: 128, align: 16)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 128, align: 16, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 8, lowerBound: 0)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4", scope: !75, file: !45, line: 32, baseType: !78, size: 128, align: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !75, file: !45, line: 39, baseType: !78, size: 128, align: 16)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !45, file: !45, line: 63, size: 320, align: 64, elements: !90, identifier: "std.io.Formatter")
!90 = !{!91, !93, !98}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !89, file: !45, line: 65, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !89, file: !45, line: 66, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !45, file: !45, line: 16, baseType: !95, align: 8)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !96, size: 64, align: 64, dwarfAddressSpace: 0)
!96 = !DISubroutineType(types: !97)
!97 = !{!65, !92, !92, !48}
!98 = !DIDerivedType(tag: DW_TAG_member, scope: !89, file: !45, line: 67, baseType: !99, size: 192, align: 64, offset: 128)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !89, file: !45, line: 67, size: 192, align: 64, elements: !100)
!100 = !{!101, !103, !104, !105}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !99, file: !45, line: 69, baseType: !102, size: 32, align: 32)
!102 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !99, file: !45, line: 70, baseType: !102, size: 32, align: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !99, file: !45, line: 71, baseType: !102, size: 32, align: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !99, file: !45, line: 72, baseType: !65, size: 64, align: 64, offset: 128)
!106 = !{}
!107 = !DILocalVariable(name: "addr", arg: 1, scope: !62, file: !45, line: 47, type: !69)
!108 = !DILocation(line: 47, scope: !62)
!109 = !DILocalVariable(name: "formatter", arg: 2, scope: !62, file: !45, line: 47, type: !88)
!110 = !DILocation(line: 49, scope: !62)
!111 = !DILocation(line: 52, scope: !112)
!112 = distinct !DILexicalBlock(scope: !62, file: !45, line: 50, column: 2)
!113 = !DILocation(line: 53, scope: !112)
!114 = !DILocation(line: 51, scope: !112)
!115 = !DILocation(line: 55, scope: !62)
!116 = distinct !DISubprogram(name: "to_string", linkageName: "std.net.InetAddress.to_string", scope: !45, file: !45, line: 58, type: !117, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !69, !125}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !120)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !121, identifier: "char[]")
!121 = !{!122, !124}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !120, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !48, size: 64, align: 64, dwarfAddressSpace: 0)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !120, baseType: !67, size: 64, align: 64, offset: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !126, identifier: "Allocator")
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !125, baseType: !92, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, baseType: !129, size: 64, align: 64, offset: 64)
!129 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!130 = !DILocation(line: 59, scope: !116)
!131 = !DILocalVariable(name: "self", arg: 1, scope: !116, file: !45, line: 58, type: !69)
!132 = !DILocation(line: 58, scope: !116)
!133 = !DILocalVariable(name: "allocator", arg: 2, scope: !116, file: !45, line: 58, type: !125)
!134 = !DILocation(line: 60, scope: !116)
!135 = distinct !DISubprogram(name: "to_tstring", linkageName: "std.net.InetAddress.to_tstring", scope: !45, file: !45, line: 63, type: !136, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!136 = !DISubroutineType(types: !137)
!137 = !{!119, !69}
!138 = !DILocation(line: 64, scope: !135)
!139 = !DILocalVariable(name: "self", arg: 1, scope: !135, file: !45, line: 63, type: !69)
!140 = !DILocation(line: 63, scope: !135)
!141 = !DILocation(line: 65, scope: !135)
!142 = distinct !DISubprogram(name: "is_loopback", linkageName: "std.net.InetAddress.is_loopback", scope: !45, file: !45, line: 157, type: !143, scopeLine: 157, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!143 = !DISubroutineType(types: !144)
!144 = !{!73, !69}
!145 = !DILocalVariable(name: "addr", arg: 1, scope: !142, file: !45, line: 157, type: !69)
!146 = !DILocation(line: 157, scope: !142)
!147 = !DILocation(line: 159, scope: !142)
!148 = !DILocation(line: 161, scope: !149)
!149 = distinct !DILexicalBlock(scope: !142, file: !45, line: 160, column: 2)
!150 = !DILocation(line: 163, scope: !142)
!151 = distinct !DISubprogram(name: "is_any_local", linkageName: "std.net.InetAddress.is_any_local", scope: !45, file: !45, line: 166, type: !143, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!152 = !DILocalVariable(name: "addr", arg: 1, scope: !151, file: !45, line: 166, type: !69)
!153 = !DILocation(line: 166, scope: !151)
!154 = !DILocation(line: 168, scope: !151)
!155 = !DILocation(line: 170, scope: !156)
!156 = distinct !DILexicalBlock(scope: !151, file: !45, line: 169, column: 2)
!157 = !DILocation(line: 172, scope: !151)
!158 = distinct !DISubprogram(name: "is_link_local", linkageName: "std.net.InetAddress.is_link_local", scope: !45, file: !45, line: 175, type: !143, scopeLine: 175, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!159 = !DILocalVariable(name: "addr", arg: 1, scope: !158, file: !45, line: 175, type: !69)
!160 = !DILocation(line: 175, scope: !158)
!161 = !DILocation(line: 177, scope: !158)
!162 = !DILocation(line: 179, scope: !163)
!163 = distinct !DILexicalBlock(scope: !158, file: !45, line: 178, column: 2)
!164 = !DILocation(line: 181, scope: !158)
!165 = distinct !DISubprogram(name: "is_site_local", linkageName: "std.net.InetAddress.is_site_local", scope: !45, file: !45, line: 184, type: !143, scopeLine: 184, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!166 = !DILocalVariable(name: "addr", arg: 1, scope: !165, file: !45, line: 184, type: !69)
!167 = !DILocation(line: 184, scope: !165)
!168 = !DILocation(line: 186, scope: !165)
!169 = !DILocation(line: 188, scope: !170)
!170 = distinct !DILexicalBlock(scope: !165, file: !45, line: 187, column: 2)
!171 = !DILocation(line: 193, scope: !172)
!172 = distinct !DILexicalBlock(scope: !165, file: !45, line: 191, column: 2)
!173 = !DILocation(line: 194, scope: !172)
!174 = !DILocation(line: 195, scope: !172)
!175 = !DILocation(line: 196, scope: !176)
!176 = distinct !DILexicalBlock(scope: !172, file: !45, line: 196, column: 4)
!177 = !DILocation(line: 198, scope: !178)
!178 = distinct !DILexicalBlock(scope: !172, file: !45, line: 198, column: 4)
!179 = distinct !DISubprogram(name: "is_multicast", linkageName: "std.net.InetAddress.is_multicast", scope: !45, file: !45, line: 202, type: !143, scopeLine: 202, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!180 = !DILocalVariable(name: "addr", arg: 1, scope: !179, file: !45, line: 202, type: !69)
!181 = !DILocation(line: 202, scope: !179)
!182 = !DILocation(line: 204, scope: !179)
!183 = !DILocation(line: 206, scope: !184)
!184 = distinct !DILexicalBlock(scope: !179, file: !45, line: 205, column: 2)
!185 = !DILocation(line: 208, scope: !179)
!186 = distinct !DISubprogram(name: "is_multicast_global", linkageName: "std.net.InetAddress.is_multicast_global", scope: !45, file: !45, line: 211, type: !143, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!187 = !DILocalVariable(name: "addr", arg: 1, scope: !186, file: !45, line: 211, type: !69)
!188 = !DILocation(line: 211, scope: !186)
!189 = !DILocation(line: 213, scope: !186)
!190 = !DILocation(line: 215, scope: !191)
!191 = distinct !DILexicalBlock(scope: !186, file: !45, line: 214, column: 2)
!192 = !DILocation(line: 217, scope: !186)
!193 = !DILocation(line: 218, scope: !186)
!194 = distinct !DISubprogram(name: "is_multicast_node_local", linkageName: "std.net.InetAddress.is_multicast_node_local", scope: !45, file: !45, line: 221, type: !143, scopeLine: 221, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!195 = !DILocalVariable(name: "addr", arg: 1, scope: !194, file: !45, line: 221, type: !69)
!196 = !DILocation(line: 221, scope: !194)
!197 = !DILocation(line: 223, scope: !194)
!198 = !DILocation(line: 224, scope: !194)
!199 = distinct !DISubprogram(name: "is_multicast_site_local", linkageName: "std.net.InetAddress.is_multicast_site_local", scope: !45, file: !45, line: 227, type: !143, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!200 = !DILocalVariable(name: "addr", arg: 1, scope: !199, file: !45, line: 227, type: !69)
!201 = !DILocation(line: 227, scope: !199)
!202 = !DILocation(line: 229, scope: !199)
!203 = !DILocation(line: 231, scope: !204)
!204 = distinct !DILexicalBlock(scope: !199, file: !45, line: 230, column: 2)
!205 = !DILocation(line: 233, scope: !199)
!206 = distinct !DISubprogram(name: "is_multicast_org_local", linkageName: "std.net.InetAddress.is_multicast_org_local", scope: !45, file: !45, line: 236, type: !143, scopeLine: 236, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!207 = !DILocalVariable(name: "addr", arg: 1, scope: !206, file: !45, line: 236, type: !69)
!208 = !DILocation(line: 236, scope: !206)
!209 = !DILocation(line: 238, scope: !206)
!210 = !DILocation(line: 240, scope: !211)
!211 = distinct !DILexicalBlock(scope: !206, file: !45, line: 239, column: 2)
!212 = !DILocation(line: 242, scope: !206)
!213 = distinct !DISubprogram(name: "is_multicast_link_local", linkageName: "std.net.InetAddress.is_multicast_link_local", scope: !45, file: !45, line: 245, type: !143, scopeLine: 245, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!214 = !DILocalVariable(name: "addr", arg: 1, scope: !213, file: !45, line: 245, type: !69)
!215 = !DILocation(line: 245, scope: !213)
!216 = !DILocation(line: 247, scope: !213)
!217 = !DILocation(line: 249, scope: !218)
!218 = distinct !DILexicalBlock(scope: !213, file: !45, line: 248, column: 2)
!219 = !DILocation(line: 251, scope: !213)
!220 = distinct !DISubprogram(name: "ipv6_from_str", linkageName: "std.net.ipv6_from_str", scope: !45, file: !45, line: 68, type: !221, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!221 = !DISubroutineType(types: !222)
!222 = !{!65, !69, !119}
!223 = !DILocalVariable(name: "s", arg: 1, scope: !220, file: !45, line: 68, type: !119)
!224 = !DILocation(line: 68, scope: !220)
!225 = !DILocalVariable(name: "sections", scope: !220, file: !45, line: 70, type: !102, align: 4)
!226 = !DILocation(line: 70, scope: !220)
!227 = !DILocation(line: 71, scope: !220)
!228 = !DILocation(line: 72, scope: !229)
!229 = distinct !DILexicalBlock(scope: !220, file: !45, line: 72, column: 2)
!230 = !DILocalVariable(name: ".temp", scope: !229, file: !45, line: 72, type: !67, align: 8)
!231 = !DILocalVariable(name: "c", scope: !232, file: !45, line: 72, type: !48, align: 1)
!232 = distinct !DILexicalBlock(scope: !229, file: !45, line: 72, column: 18)
!233 = !DILocation(line: 72, scope: !232)
!234 = !DILocalVariable(name: "zero_segment_len", scope: !220, file: !45, line: 73, type: !56, align: 4)
!235 = !DILocation(line: 73, scope: !220)
!236 = !DILocation(line: 74, scope: !220)
!237 = !DILocation(line: 75, scope: !220)
!238 = !DILocalVariable(name: "index", scope: !220, file: !45, line: 76, type: !67, align: 8)
!239 = !DILocation(line: 76, scope: !220)
!240 = !DILocalVariable(name: "last_was_colon", scope: !220, file: !45, line: 77, type: !73, align: 1)
!241 = !DILocation(line: 77, scope: !220)
!242 = !DILocalVariable(name: "found_zero", scope: !220, file: !45, line: 77, type: !73, align: 1)
!243 = !DILocalVariable(name: "current", scope: !220, file: !45, line: 78, type: !56, align: 4)
!244 = !DILocation(line: 78, scope: !220)
!245 = !DILocalVariable(name: "addr", scope: !220, file: !45, line: 79, type: !70, align: 2)
!246 = !DILocation(line: 79, scope: !220)
!247 = !DILocation(line: 80, scope: !248)
!248 = distinct !DILexicalBlock(scope: !220, file: !45, line: 80, column: 2)
!249 = !DILocalVariable(name: ".temp", scope: !248, file: !45, line: 80, type: !67, align: 8)
!250 = !DILocalVariable(name: "i", scope: !251, file: !45, line: 80, type: !67, align: 8)
!251 = distinct !DILexicalBlock(scope: !248, file: !45, line: 81, column: 2)
!252 = !DILocation(line: 80, scope: !251)
!253 = !DILocalVariable(name: "c", scope: !251, file: !45, line: 80, type: !48, align: 1)
!254 = !DILocation(line: 82, scope: !255)
!255 = distinct !DILexicalBlock(scope: !251, file: !45, line: 81, column: 2)
!256 = !DILocation(line: 84, scope: !257)
!257 = distinct !DILexicalBlock(scope: !255, file: !45, line: 83, column: 3)
!258 = !DILocation(line: 86, scope: !259)
!259 = distinct !DILexicalBlock(scope: !257, file: !45, line: 85, column: 4)
!260 = !DILocation(line: 88, scope: !261)
!261 = distinct !DILexicalBlock(scope: !259, file: !45, line: 87, column: 5)
!262 = !DILocation(line: 89, scope: !261)
!263 = !DILocation(line: 91, scope: !259)
!264 = !DILocation(line: 92, scope: !259)
!265 = !DILocation(line: 93, scope: !259)
!266 = !DILocation(line: 94, scope: !259)
!267 = !DILocation(line: 95, scope: !259)
!268 = !DILocation(line: 97, scope: !257)
!269 = !DILocation(line: 99, scope: !257)
!270 = !DILocation(line: 101, scope: !257)
!271 = !DILocation(line: 103, scope: !257)
!272 = !DILocation(line: 104, scope: !257)
!273 = !DILocation(line: 105, scope: !257)
!274 = !DILocation(line: 106, scope: !257)
!275 = !DILocation(line: 108, scope: !255)
!276 = !DILocation(line: 109, scope: !255)
!277 = !DILocation(line: 12, scope: !278, inlinedAt: !280)
!278 = distinct !DISubprogram(name: "@is_xdigit", linkageName: "@is_xdigit", scope: !279, file: !279, line: 12, scopeLine: 12, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44)
!279 = !DIFile(filename: "ascii.c3", directory: "C:/Compilers/C3/lib/std/core")
!280 = !DILocation(line: 47, scope: !281, inlinedAt: !276)
!281 = distinct !DISubprogram(name: "is_xdigit", linkageName: "is_xdigit", scope: !279, file: !279, line: 47, scopeLine: 47, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44)
!282 = !DILocation(line: 110, scope: !255)
!283 = !DILocation(line: 111, scope: !255)
!284 = !DILocation(line: 114, scope: !220)
!285 = !DILocation(line: 117, scope: !220)
!286 = !DILocation(line: 118, scope: !220)
!287 = !DILocation(line: 119, scope: !220)
!288 = distinct !DISubprogram(name: "ipv4_from_str", linkageName: "std.net.ipv4_from_str", scope: !45, file: !45, line: 122, type: !221, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!289 = !DILocalVariable(name: "s", arg: 1, scope: !288, file: !45, line: 122, type: !119)
!290 = !DILocation(line: 122, scope: !288)
!291 = !DILocalVariable(name: "addr", scope: !288, file: !45, line: 124, type: !70, align: 2)
!292 = !DILocation(line: 124, scope: !288)
!293 = !DILocalVariable(name: "element", scope: !288, file: !45, line: 125, type: !56, align: 4)
!294 = !DILocation(line: 125, scope: !288)
!295 = !DILocalVariable(name: "current", scope: !288, file: !45, line: 126, type: !56, align: 4)
!296 = !DILocation(line: 126, scope: !288)
!297 = !DILocation(line: 127, scope: !298)
!298 = distinct !DILexicalBlock(scope: !288, file: !45, line: 127, column: 2)
!299 = !DILocalVariable(name: ".temp", scope: !298, file: !45, line: 127, type: !67, align: 8)
!300 = !DILocalVariable(name: "c", scope: !301, file: !45, line: 127, type: !48, align: 1)
!301 = distinct !DILexicalBlock(scope: !298, file: !45, line: 128, column: 2)
!302 = !DILocation(line: 127, scope: !301)
!303 = !DILocation(line: 129, scope: !304)
!304 = distinct !DILexicalBlock(scope: !301, file: !45, line: 128, column: 2)
!305 = !DILocation(line: 131, scope: !306)
!306 = distinct !DILexicalBlock(scope: !304, file: !45, line: 130, column: 3)
!307 = !DILocation(line: 132, scope: !306)
!308 = !DILocation(line: 135, scope: !309)
!309 = distinct !DILexicalBlock(scope: !310, file: !45, line: 135, column: 13)
!310 = distinct !DILexicalBlock(scope: !306, file: !45, line: 133, column: 4)
!311 = !DILocation(line: 136, scope: !312)
!312 = distinct !DILexicalBlock(scope: !310, file: !45, line: 136, column: 13)
!313 = !DILocation(line: 137, scope: !314)
!314 = distinct !DILexicalBlock(scope: !310, file: !45, line: 137, column: 13)
!315 = !DILocation(line: 138, scope: !316)
!316 = distinct !DILexicalBlock(scope: !310, file: !45, line: 138, column: 14)
!317 = !DILocation(line: 140, scope: !306)
!318 = !DILocation(line: 141, scope: !306)
!319 = !DILocation(line: 142, scope: !306)
!320 = !DILocation(line: 144, scope: !304)
!321 = !DILocation(line: 145, scope: !304)
!322 = !DILocation(line: 147, scope: !323)
!323 = distinct !DILexicalBlock(scope: !304, file: !45, line: 146, column: 3)
!324 = !DILocation(line: 148, scope: !323)
!325 = !DILocation(line: 150, scope: !304)
!326 = !DILocation(line: 152, scope: !288)
!327 = !DILocation(line: 153, scope: !288)
!328 = !DILocation(line: 154, scope: !288)
!329 = distinct !DISubprogram(name: "addrinfo", linkageName: "std.net.addrinfo", scope: !45, file: !45, line: 254, type: !330, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!330 = !DISubroutineType(types: !331)
!331 = !{!65, !332, !119, !102, !339, !341}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "AddrInfo**", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "AddrInfo*", baseType: !334, size: 64, align: 64, dwarfAddressSpace: 0)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddrInfo", scope: !45, file: !45, line: 14, size: 384, align: 64, elements: !335, identifier: "std.net.os.AddrInfo")
!335 = !{!336, !338, !340, !342, !344, !346, !353}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !334, file: !45, line: 16, baseType: !337, size: 32, align: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIFlags", scope: !45, file: !45, line: 7, baseType: !56, align: 4)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !334, file: !45, line: 17, baseType: !339, size: 32, align: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIFamily", scope: !45, file: !45, line: 4, baseType: !56, align: 4)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !334, file: !45, line: 18, baseType: !341, size: 32, align: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "AISockType", scope: !45, file: !45, line: 6, baseType: !56, align: 4)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !334, file: !45, line: 19, baseType: !343, size: 32, align: 32, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIProtocol", scope: !45, file: !45, line: 5, baseType: !56, align: 4)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !334, file: !45, line: 20, baseType: !345, size: 64, align: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "Socklen_t", scope: !45, file: !45, line: 10, baseType: !68, align: 8)
!346 = !DIDerivedType(tag: DW_TAG_member, scope: !334, file: !45, line: 21, baseType: !347, size: 128, align: 64, offset: 192)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !334, file: !45, line: 21, size: 128, align: 64, elements: !348)
!348 = !{!349, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !347, file: !45, line: 23, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !45, file: !45, line: 12, baseType: !123, align: 8)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !347, file: !45, line: 24, baseType: !352, size: 64, align: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "SockAddrPtr", scope: !45, file: !45, line: 12, baseType: !92, align: 8)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !334, file: !45, line: 31, baseType: !333, size: 64, align: 64, offset: 320)
!354 = !DILocalVariable(name: "host", arg: 1, scope: !329, file: !45, line: 254, type: !119)
!355 = !DILocation(line: 254, scope: !329)
!356 = !DILocalVariable(name: "port", arg: 2, scope: !329, file: !45, line: 254, type: !102)
!357 = !DILocalVariable(name: "ai_family", arg: 3, scope: !329, file: !45, line: 254, type: !339)
!358 = !DILocalVariable(name: "ai_socktype", arg: 4, scope: !329, file: !45, line: 254, type: !341)
!359 = !DILocalVariable(name: "state", scope: !360, file: !45, line: 641, type: !362, align: 8)
!360 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !361, file: !361, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !106)
!361 = !DIFile(filename: "mem.c3", directory: "C:/Compilers/C3/lib/std/core")
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !45, file: !45, line: 403, baseType: !363, align: 8)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !364, size: 64, align: 64, dwarfAddressSpace: 0)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !45, file: !45, line: 31, size: 704, align: 64, elements: !365, identifier: "std.core.mem.allocator.TempAllocator")
!365 = !{!366, !367, !379, !380, !381, !382, !383, !384, !385, !386, !387}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !364, file: !45, line: 33, baseType: !125, size: 128, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !364, file: !45, line: 34, baseType: !368, size: 64, align: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !369, size: 64, align: 64, dwarfAddressSpace: 0)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !45, file: !45, line: 54, size: 256, align: 64, elements: !370, identifier: "std.core.mem.allocator.TempAllocatorPage")
!370 = !{!371, !372, !373, !374, !375}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !369, file: !45, line: 56, baseType: !368, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !369, file: !45, line: 57, baseType: !92, size: 64, align: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !369, file: !45, line: 58, baseType: !67, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !369, file: !45, line: 59, baseType: !67, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !369, file: !45, line: 60, baseType: !376, align: 8, offset: 256)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, align: 8, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 0, lowerBound: 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !364, file: !45, line: 35, baseType: !363, size: 64, align: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !364, file: !45, line: 36, baseType: !73, size: 8, align: 8, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !364, file: !45, line: 37, baseType: !67, size: 64, align: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !364, file: !45, line: 38, baseType: !67, size: 64, align: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !364, file: !45, line: 39, baseType: !67, size: 64, align: 64, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !364, file: !45, line: 40, baseType: !67, size: 64, align: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !364, file: !45, line: 41, baseType: !67, size: 64, align: 64, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !364, file: !45, line: 42, baseType: !67, size: 64, align: 64, offset: 640)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !364, file: !45, line: 43, baseType: !376, align: 8, offset: 704)
!388 = !DILocation(line: 641, scope: !360, inlinedAt: !355)
!389 = !DILocalVariable(name: "zhost", scope: !390, file: !45, line: 256, type: !350, align: 8)
!390 = distinct !DILexicalBlock(scope: !329, file: !45, line: 255, column: 1)
!391 = !DILocation(line: 256, scope: !390)
!392 = !DILocalVariable(name: "str", scope: !390, file: !45, line: 257, type: !393, align: 8)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !45, file: !45, line: 7, baseType: !394, align: 8)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !395, size: 64, align: 64, dwarfAddressSpace: 0)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !45, file: !45, line: 8, baseType: null, align: 1)
!396 = !DILocation(line: 257, scope: !390)
!397 = !DILocation(line: 258, scope: !390)
!398 = !DILocalVariable(name: "hints", scope: !390, file: !45, line: 259, type: !334, align: 8)
!399 = !DILocation(line: 259, scope: !390)
!400 = !DILocalVariable(name: "ai", scope: !390, file: !45, line: 260, type: !333, align: 8)
!401 = !DILocation(line: 260, scope: !390)
!402 = !DILocation(line: 261, scope: !390)
!403 = !DILocation(line: 644, scope: !404, inlinedAt: !355)
!404 = distinct !DILexicalBlock(scope: !360, file: !361, line: 643, column: 2)
!405 = !DILocation(line: 262, scope: !390)
!406 = !DILocation(line: 644, scope: !407, inlinedAt: !355)
!407 = distinct !DILexicalBlock(scope: !360, file: !361, line: 643, column: 2)
!408 = distinct !DISubprogram(name: "ipv4toint", linkageName: "std.net.ipv4toint", scope: !409, file: !409, line: 31, type: !410, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!409 = !DIFile(filename: "net.c3", directory: "C:/Compilers/C3/lib/std/net")
!410 = !DISubroutineType(types: !411)
!411 = !{!65, !412, !119}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "uint*", baseType: !102, size: 64, align: 64, dwarfAddressSpace: 0)
!413 = !DILocalVariable(name: "s", arg: 1, scope: !408, file: !409, line: 31, type: !119)
!414 = !DILocation(line: 31, scope: !408)
!415 = !DILocalVariable(name: "out", scope: !408, file: !409, line: 33, type: !102, align: 4)
!416 = !DILocation(line: 33, scope: !408)
!417 = !DILocalVariable(name: "element", scope: !408, file: !409, line: 34, type: !56, align: 4)
!418 = !DILocation(line: 34, scope: !408)
!419 = !DILocalVariable(name: "current", scope: !408, file: !409, line: 35, type: !56, align: 4)
!420 = !DILocation(line: 35, scope: !408)
!421 = !DILocation(line: 36, scope: !422)
!422 = distinct !DILexicalBlock(scope: !408, file: !409, line: 36, column: 2)
!423 = !DILocalVariable(name: ".temp", scope: !422, file: !409, line: 36, type: !67, align: 8)
!424 = !DILocalVariable(name: "c", scope: !425, file: !409, line: 36, type: !48, align: 1)
!425 = distinct !DILexicalBlock(scope: !422, file: !409, line: 37, column: 2)
!426 = !DILocation(line: 36, scope: !425)
!427 = !DILocation(line: 38, scope: !428)
!428 = distinct !DILexicalBlock(scope: !425, file: !409, line: 37, column: 2)
!429 = !DILocation(line: 40, scope: !430)
!430 = distinct !DILexicalBlock(scope: !428, file: !409, line: 39, column: 3)
!431 = !DILocation(line: 41, scope: !430)
!432 = !DILocation(line: 42, scope: !430)
!433 = !DILocation(line: 43, scope: !430)
!434 = !DILocation(line: 44, scope: !430)
!435 = !DILocation(line: 46, scope: !428)
!436 = !DILocation(line: 47, scope: !428)
!437 = !DILocation(line: 49, scope: !438)
!438 = distinct !DILexicalBlock(scope: !428, file: !409, line: 48, column: 3)
!439 = !DILocation(line: 50, scope: !438)
!440 = !DILocation(line: 52, scope: !428)
!441 = !DILocation(line: 54, scope: !408)
!442 = !DILocation(line: 55, scope: !408)
!443 = !DILocation(line: 56, scope: !408)
!444 = distinct !DISubprogram(name: "int_to_ipv4", linkageName: "std.net.int_to_ipv4", scope: !409, file: !409, line: 59, type: !445, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!445 = !DISubroutineType(types: !446)
!446 = !{!65, !447, !102, !125}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!448 = !DILocalVariable(name: "val", arg: 1, scope: !444, file: !409, line: 59, type: !102)
!449 = !DILocation(line: 59, scope: !444)
!450 = !DILocalVariable(name: "allocator", arg: 2, scope: !444, file: !409, line: 59, type: !125)
!451 = !DILocalVariable(name: "buffer", scope: !444, file: !409, line: 61, type: !78, align: 16)
!452 = !DILocation(line: 61, scope: !444)
!453 = !DILocalVariable(name: "res", scope: !444, file: !409, line: 62, type: !119, align: 8)
!454 = !DILocation(line: 62, scope: !444)
!455 = !DILocation(line: 63, scope: !444)
!456 = distinct !DISubprogram(name: "get_broadcast", linkageName: "std.net.Socket.get_broadcast", scope: !2, file: !2, line: 97, type: !457, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!457 = !DISubroutineType(types: !458)
!458 = !{!65, !459, !460}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "bool*", baseType: !73, size: 64, align: 64, dwarfAddressSpace: 0)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Socket*", baseType: !461, size: 64, align: 64, dwarfAddressSpace: 0)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "Socket", scope: !2, file: !2, line: 4, size: 1152, align: 64, elements: !462, identifier: "std.net.Socket")
!462 = !{!463, !465, !466}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !461, file: !2, line: 6, baseType: !464, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "NativeSocket", scope: !2, file: !2, line: 15, baseType: !92, align: 8)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !461, file: !2, line: 7, baseType: !345, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr_storage", scope: !461, file: !2, line: 10, baseType: !467, size: 1024, align: 8, offset: 128)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 1024, align: 8, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 128, lowerBound: 0)
!470 = !DILocation(line: 97, scope: !456)
!471 = !DILocalVariable(name: "self", arg: 1, scope: !456, file: !2, line: 97, type: !460)
!472 = distinct !DISubprogram(name: "get_keepalive", linkageName: "std.net.Socket.get_keepalive", scope: !2, file: !2, line: 98, type: !457, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!473 = !DILocation(line: 98, scope: !472)
!474 = !DILocalVariable(name: "self", arg: 1, scope: !472, file: !2, line: 98, type: !460)
!475 = distinct !DISubprogram(name: "get_reuseaddr", linkageName: "std.net.Socket.get_reuseaddr", scope: !2, file: !2, line: 99, type: !457, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!476 = !DILocation(line: 99, scope: !475)
!477 = !DILocalVariable(name: "self", arg: 1, scope: !475, file: !2, line: 99, type: !460)
!478 = distinct !DISubprogram(name: "get_dontroute", linkageName: "std.net.Socket.get_dontroute", scope: !2, file: !2, line: 100, type: !457, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!479 = !DILocation(line: 100, scope: !478)
!480 = !DILocalVariable(name: "self", arg: 1, scope: !478, file: !2, line: 100, type: !460)
!481 = distinct !DISubprogram(name: "get_oobinline", linkageName: "std.net.Socket.get_oobinline", scope: !2, file: !2, line: 101, type: !457, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!482 = !DILocation(line: 101, scope: !481)
!483 = !DILocalVariable(name: "self", arg: 1, scope: !481, file: !2, line: 101, type: !460)
!484 = distinct !DISubprogram(name: "set_broadcast", linkageName: "std.net.Socket.set_broadcast", scope: !2, file: !2, line: 103, type: !485, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!485 = !DISubroutineType(types: !486)
!486 = !{!65, !92, !460, !73}
!487 = !DILocation(line: 103, scope: !484)
!488 = !DILocalVariable(name: "self", arg: 1, scope: !484, file: !2, line: 103, type: !460)
!489 = !DILocalVariable(name: "value", arg: 2, scope: !484, file: !2, line: 103, type: !73)
!490 = distinct !DISubprogram(name: "set_keepalive", linkageName: "std.net.Socket.set_keepalive", scope: !2, file: !2, line: 104, type: !485, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!491 = !DILocation(line: 104, scope: !490)
!492 = !DILocalVariable(name: "self", arg: 1, scope: !490, file: !2, line: 104, type: !460)
!493 = !DILocalVariable(name: "value", arg: 2, scope: !490, file: !2, line: 104, type: !73)
!494 = distinct !DISubprogram(name: "set_reuseaddr", linkageName: "std.net.Socket.set_reuseaddr", scope: !2, file: !2, line: 105, type: !485, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!495 = !DILocation(line: 105, scope: !494)
!496 = !DILocalVariable(name: "self", arg: 1, scope: !494, file: !2, line: 105, type: !460)
!497 = !DILocalVariable(name: "value", arg: 2, scope: !494, file: !2, line: 105, type: !73)
!498 = distinct !DISubprogram(name: "set_dontroute", linkageName: "std.net.Socket.set_dontroute", scope: !2, file: !2, line: 106, type: !485, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!499 = !DILocation(line: 106, scope: !498)
!500 = !DILocalVariable(name: "self", arg: 1, scope: !498, file: !2, line: 106, type: !460)
!501 = !DILocalVariable(name: "value", arg: 2, scope: !498, file: !2, line: 106, type: !73)
!502 = distinct !DISubprogram(name: "set_oobinline", linkageName: "std.net.Socket.set_oobinline", scope: !2, file: !2, line: 107, type: !485, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!503 = !DILocation(line: 107, scope: !502)
!504 = !DILocalVariable(name: "self", arg: 1, scope: !502, file: !2, line: 107, type: !460)
!505 = !DILocalVariable(name: "value", arg: 2, scope: !502, file: !2, line: 107, type: !73)
!506 = distinct !DISubprogram(name: "set_option", linkageName: "std.net.Socket.set_option", scope: !2, file: !2, line: 109, type: !507, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!507 = !DISubroutineType(types: !508)
!508 = !{!65, !92, !460, !47, !73}
!509 = !DILocation(line: 110, scope: !506)
!510 = !DILocalVariable(name: "self", arg: 1, scope: !506, file: !2, line: 109, type: !460)
!511 = !DILocation(line: 109, scope: !506)
!512 = !DILocalVariable(name: "option", arg: 2, scope: !506, file: !2, line: 109, type: !47)
!513 = !DILocalVariable(name: "value", arg: 3, scope: !506, file: !2, line: 109, type: !73)
!514 = !DILocalVariable(name: "flag", scope: !506, file: !2, line: 111, type: !515, align: 4)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !2, file: !2, line: 21, baseType: !56, align: 4)
!516 = !DILocation(line: 111, scope: !506)
!517 = !DILocalVariable(name: "errcode", scope: !506, file: !2, line: 112, type: !56, align: 4)
!518 = !DILocation(line: 112, scope: !506)
!519 = !DILocation(line: 113, scope: !506)
!520 = distinct !DISubprogram(name: "get_option", linkageName: "std.net.Socket.get_option", scope: !2, file: !2, line: 116, type: !521, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!521 = !DISubroutineType(types: !522)
!522 = !{!65, !459, !460, !47}
!523 = !DILocation(line: 117, scope: !520)
!524 = !DILocalVariable(name: "self", arg: 1, scope: !520, file: !2, line: 116, type: !460)
!525 = !DILocation(line: 116, scope: !520)
!526 = !DILocalVariable(name: "option", arg: 2, scope: !520, file: !2, line: 116, type: !47)
!527 = !DILocalVariable(name: "flag", scope: !520, file: !2, line: 118, type: !515, align: 4)
!528 = !DILocation(line: 118, scope: !520)
!529 = !DILocalVariable(name: "errcode", scope: !520, file: !2, line: 119, type: !56, align: 4)
!530 = !DILocation(line: 119, scope: !520)
!531 = !DILocation(line: 120, scope: !520)
!532 = !DILocation(line: 121, scope: !520)
!533 = distinct !DISubprogram(name: "read", linkageName: "std.net.Socket.read", scope: !2, file: !2, line: 124, type: !534, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!534 = !DISubroutineType(types: !535)
!535 = !{!65, !66, !460, !120}
!536 = !DILocation(line: 125, scope: !533)
!537 = !DILocalVariable(name: "self", arg: 1, scope: !533, file: !2, line: 124, type: !460)
!538 = !DILocation(line: 124, scope: !533)
!539 = !DILocalVariable(name: "bytes", arg: 2, scope: !533, file: !2, line: 124, type: !120)
!540 = !DILocalVariable(name: "n", scope: !533, file: !2, line: 127, type: !541, align: 8)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !4)
!542 = !DILocation(line: 127, scope: !533)
!543 = !DILocation(line: 131, scope: !533)
!544 = !DILocation(line: 132, scope: !533)
!545 = distinct !DISubprogram(name: "read_byte", linkageName: "std.net.Socket.read_byte", scope: !2, file: !2, line: 135, type: !546, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!546 = !DISubroutineType(types: !547)
!547 = !{!65, !123, !460}
!548 = !DILocation(line: 135, scope: !545)
!549 = !DILocalVariable(name: "self", arg: 1, scope: !545, file: !2, line: 135, type: !460)
!550 = !DILocalVariable(name: "buffer", scope: !551, file: !2, line: 132, type: !553, align: 1)
!551 = distinct !DISubprogram(name: "read_byte_using_read", linkageName: "read_byte_using_read", scope: !552, file: !552, line: 130, scopeLine: 130, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !106)
!552 = !DIFile(filename: "stream.c3", directory: "C:/Compilers/C3/lib/std/io")
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, align: 8, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 1, lowerBound: 0)
!556 = !DILocation(line: 132, scope: !551, inlinedAt: !548)
!557 = !DILocalVariable(name: "read", scope: !551, file: !2, line: 133, type: !67, align: 8)
!558 = !DILocation(line: 133, scope: !551, inlinedAt: !548)
!559 = !DILocation(line: 134, scope: !551, inlinedAt: !548)
!560 = !DILocation(line: 135, scope: !551, inlinedAt: !548)
!561 = distinct !DISubprogram(name: "write", linkageName: "std.net.Socket.write", scope: !2, file: !2, line: 137, type: !534, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!562 = !DILocation(line: 138, scope: !561)
!563 = !DILocalVariable(name: "self", arg: 1, scope: !561, file: !2, line: 137, type: !460)
!564 = !DILocation(line: 137, scope: !561)
!565 = !DILocalVariable(name: "bytes", arg: 2, scope: !561, file: !2, line: 137, type: !120)
!566 = !DILocalVariable(name: "n", scope: !561, file: !2, line: 140, type: !541, align: 8)
!567 = !DILocation(line: 140, scope: !561)
!568 = !DILocation(line: 144, scope: !561)
!569 = !DILocation(line: 145, scope: !561)
!570 = distinct !DISubprogram(name: "write_byte", linkageName: "std.net.Socket.write_byte", scope: !2, file: !2, line: 148, type: !571, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!571 = !DISubroutineType(types: !572)
!572 = !{!65, !92, !460, !48}
!573 = !DILocation(line: 148, scope: !570)
!574 = !DILocalVariable(name: "self", arg: 1, scope: !570, file: !2, line: 148, type: !460)
!575 = !DILocalVariable(name: "byte", arg: 2, scope: !570, file: !2, line: 148, type: !48)
!576 = !DILocalVariable(name: "buff", scope: !577, file: !2, line: 126, type: !553, align: 1)
!577 = distinct !DISubprogram(name: "write_byte_using_write", linkageName: "write_byte_using_write", scope: !552, file: !552, line: 124, scopeLine: 124, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !106)
!578 = !DILocation(line: 126, scope: !577, inlinedAt: !573)
!579 = !DILocation(line: 127, scope: !577, inlinedAt: !573)
!580 = distinct !DISubprogram(name: "destroy", linkageName: "std.net.Socket.destroy", scope: !2, file: !2, line: 150, type: !581, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!581 = !DISubroutineType(types: !582)
!582 = !{!65, !92, !460}
!583 = !DILocation(line: 151, scope: !580)
!584 = !DILocalVariable(name: "self", arg: 1, scope: !580, file: !2, line: 150, type: !460)
!585 = !DILocation(line: 150, scope: !580)
!586 = !DILocation(line: 152, scope: !580)
!587 = distinct !DISubprogram(name: "close", linkageName: "std.net.Socket.close", scope: !2, file: !2, line: 154, type: !581, scopeLine: 154, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!588 = !DILocation(line: 155, scope: !587)
!589 = !DILocalVariable(name: "self", arg: 1, scope: !587, file: !2, line: 154, type: !460)
!590 = !DILocation(line: 154, scope: !587)
!591 = !DILocation(line: 156, scope: !587)
!592 = !DILocalVariable(name: "error", scope: !593, file: !2, line: 40, type: !595, align: 4)
!593 = distinct !DISubprogram(name: "close", linkageName: "close", scope: !594, file: !594, line: 38, scopeLine: 38, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !106)
!594 = !DIFile(filename: "win32.c3", directory: "C:/Compilers/C3/lib/std/net/os")
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "WSAError", scope: !2, file: !2, line: 5, baseType: !56, align: 4)
!596 = !DILocation(line: 40, scope: !593, inlinedAt: !591)
!597 = !DILocation(line: 41, scope: !593, inlinedAt: !591)
!598 = distinct !DISubprogram(name: "peek", linkageName: "std.net.Socket.peek", scope: !2, file: !2, line: 159, type: !534, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!599 = !DILocation(line: 160, scope: !598)
!600 = !DILocalVariable(name: "self", arg: 1, scope: !598, file: !2, line: 159, type: !460)
!601 = !DILocation(line: 159, scope: !598)
!602 = !DILocalVariable(name: "bytes", arg: 2, scope: !598, file: !2, line: 159, type: !120)
!603 = !DILocalVariable(name: "n", scope: !598, file: !2, line: 162, type: !541, align: 8)
!604 = !DILocation(line: 162, scope: !598)
!605 = !DILocation(line: 166, scope: !598)
!606 = !DILocation(line: 167, scope: !598)
!607 = distinct !DISubprogram(name: "shutdown", linkageName: "std.net.Socket.shutdown", scope: !2, file: !2, line: 177, type: !608, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!608 = !DISubroutineType(types: !609)
!609 = !{!65, !92, !460, !55}
!610 = !DILocation(line: 178, scope: !607)
!611 = !DILocalVariable(name: "self", arg: 1, scope: !607, file: !2, line: 177, type: !460)
!612 = !DILocation(line: 177, scope: !607)
!613 = !DILocalVariable(name: "how", arg: 2, scope: !607, file: !2, line: 177, type: !55)
!614 = !DILocation(line: 179, scope: !607)
!615 = !DILocation(line: 181, scope: !616)
!616 = distinct !DILexicalBlock(scope: !607, file: !2, line: 180, column: 2)
!617 = distinct !DISubprogram(name: "poll", linkageName: "std.net.poll", scope: !2, file: !2, line: 59, type: !618, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!618 = !DISubroutineType(types: !619)
!619 = !{!65, !620, !621, !3}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ulong*", baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "Poll[]", size: 128, align: 64, elements: !622, identifier: "Poll[]")
!622 = !{!623, !630}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !621, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Poll*", baseType: !625, size: 64, align: 64, dwarfAddressSpace: 0)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "Poll", scope: !2, file: !2, line: 48, size: 128, align: 64, elements: !626, identifier: "std.net.Poll")
!626 = !{!627, !628, !629}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "socket", scope: !625, file: !2, line: 50, baseType: !464, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !625, file: !2, line: 51, baseType: !7, size: 16, align: 16, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !625, file: !2, line: 52, baseType: !23, size: 16, align: 16, offset: 80)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !621, baseType: !67, size: 64, align: 64, offset: 64)
!631 = !DILocalVariable(name: "polls", arg: 1, scope: !617, file: !2, line: 59, type: !621)
!632 = !DILocation(line: 59, scope: !617)
!633 = !DILocalVariable(name: "timeout", arg: 2, scope: !617, file: !2, line: 59, type: !3)
!634 = !DILocation(line: 61, scope: !617)
!635 = distinct !DISubprogram(name: "poll_ms", linkageName: "std.net.poll_ms", scope: !2, file: !2, line: 68, type: !636, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!636 = !DISubroutineType(types: !637)
!637 = !{!65, !620, !621, !4}
!638 = !DILocalVariable(name: "polls", arg: 1, scope: !635, file: !2, line: 68, type: !621)
!639 = !DILocation(line: 68, scope: !635)
!640 = !DILocalVariable(name: "timeout_ms", arg: 2, scope: !635, file: !2, line: 68, type: !4)
!641 = !DILocation(line: 70, scope: !635)
!642 = !DILocalVariable(name: "result", scope: !635, file: !2, line: 72, type: !515, align: 4)
!643 = !DILocation(line: 72, scope: !635)
!644 = !DILocation(line: 76, scope: !635)
!645 = distinct !DISubprogram(name: "connect_from_addrinfo", linkageName: "std.net.connect_from_addrinfo", scope: !646, file: !646, line: 10, type: !647, scopeLine: 10, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !106)
!646 = !DIFile(filename: "socket_private.c3", directory: "C:/Compilers/C3/lib/std/net")
!647 = !DISubroutineType(types: !648)
!648 = !{!65, !460, !333, !649}
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "SocketOption[]", size: 128, align: 64, elements: !650, identifier: "SocketOption[]")
!650 = !{!651, !653}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !649, baseType: !652, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SocketOption*", baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !649, baseType: !67, size: 64, align: 64, offset: 64)
!654 = !DILocalVariable(name: "addrinfo", arg: 1, scope: !645, file: !646, line: 10, type: !333)
!655 = !DILocation(line: 10, scope: !645)
!656 = !DILocalVariable(name: "options", arg: 2, scope: !645, file: !646, line: 10, type: !649)
!657 = !DILocation(line: 15, scope: !658, inlinedAt: !659)
!658 = distinct !DISubprogram(name: "@loop_over_ai", linkageName: "@loop_over_ai", scope: !2, file: !2, line: 13, scopeLine: 13, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !106)
!659 = !DILocation(line: 12, scope: !645)
!660 = !DILocation(line: 15, scope: !661, inlinedAt: !659)
!661 = distinct !DILexicalBlock(scope: !658, file: !2, line: 15, column: 2)
!662 = !DILocalVariable(name: "sockfd", scope: !663, file: !646, line: 17, type: !464, align: 8)
!663 = distinct !DILexicalBlock(scope: !661, file: !2, line: 16, column: 2)
!664 = !DILocation(line: 17, scope: !663, inlinedAt: !659)
!665 = !DILocation(line: 27, scope: !666, inlinedAt: !667)
!666 = distinct !DISubprogram(name: "is_valid", linkageName: "is_valid", scope: !594, file: !594, line: 25, scopeLine: 25, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44)
!667 = !DILocation(line: 18, scope: !663, inlinedAt: !659)
!668 = !DILocalVariable(name: "sockfd", scope: !645, file: !646, line: 12, type: !464, align: 8)
!669 = !DILocalVariable(name: "ai", scope: !645, file: !646, line: 12, type: !333, align: 8)
!670 = !DILocation(line: 20, scope: !671, inlinedAt: !659)
!671 = distinct !DILexicalBlock(scope: !672, file: !2, line: 20, column: 4)
!672 = distinct !DILexicalBlock(scope: !663, file: !2, line: 19, column: 3)
!673 = !DILocalVariable(name: "sock", scope: !674, file: !646, line: 6, type: !461, align: 8)
!674 = distinct !DISubprogram(name: "apply_sockoptions", linkageName: "apply_sockoptions", scope: !646, file: !646, line: 4, scopeLine: 4, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !106)
!675 = !DILocation(line: 6, scope: !674, inlinedAt: !676)
!676 = !DILocation(line: 14, scope: !677)
!677 = distinct !DILexicalBlock(scope: !645, file: !646, line: 13, column: 2)
!678 = !DILocation(line: 7, scope: !679, inlinedAt: !676)
!679 = distinct !DILexicalBlock(scope: !674, file: !646, line: 7, column: 2)
!680 = !DILocalVariable(name: ".temp", scope: !679, file: !646, line: 7, type: !67, align: 8)
!681 = !DILocalVariable(name: "o", scope: !682, file: !646, line: 7, type: !47, align: 1)
!682 = distinct !DILexicalBlock(scope: !679, file: !646, line: 7, column: 24)
!683 = !DILocation(line: 7, scope: !682, inlinedAt: !676)
!684 = !DILocalVariable(name: "errcode", scope: !677, file: !646, line: 15, type: !56, align: 4)
!685 = !DILocation(line: 15, scope: !677)
!686 = !DILocation(line: 17, scope: !677)
!687 = !DILocalVariable(name: "sock", scope: !688, file: !646, line: 81, type: !461, align: 8)
!688 = distinct !DISubprogram(name: "new_socket", linkageName: "new_socket", scope: !2, file: !2, line: 79, scopeLine: 79, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !106)
!689 = !DILocation(line: 81, scope: !688, inlinedAt: !686)
!690 = !DILocation(line: 82, scope: !688, inlinedAt: !686)
!691 = !DILocation(line: 83, scope: !688, inlinedAt: !686)
!692 = !DILocation(line: 357, scope: !693, inlinedAt: !691)
!693 = distinct !DILexicalBlock(scope: !694, file: !361, line: 358, column: 1)
!694 = distinct !DISubprogram(name: "copy", linkageName: "copy", scope: !361, file: !361, line: 357, scopeLine: 357, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44)
!695 = !DILocation(line: 354, scope: !693, inlinedAt: !691)
!696 = !DILocation(line: 83, scope: !693, inlinedAt: !691)
!697 = !DILocation(line: 355, scope: !693, inlinedAt: !691)
!698 = !DILocation(line: 359, scope: !694, inlinedAt: !691)
!699 = !DILocation(line: 84, scope: !688, inlinedAt: !686)
!700 = !DILocation(line: 22, scope: !663, inlinedAt: !659)
