; ModuleID = 'std::os::process'
source_filename = "std::os::process"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Win32_SECURITY_ATTRIBUTES = type { i32, ptr, i32 }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%File = type { ptr }
%SubProcess = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, i8 }
%"char[][]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Win32_PROCESS_INFORMATION = type { ptr, ptr, i32, i32 }
%Win32_STARTUPINFOW = type { i32, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i16, i16, ptr, ptr, ptr, ptr }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%Win32_OVERLAPPED = type { i64, i64, %.anon, ptr }
%.anon = type { ptr }

$std.os.process.SubProcess.stdout = comdat any

$std.os.process.SubProcess.stderr = comdat any

$std.os.process.SubProcess.destroy = comdat any

$std.os.process.SubProcess.terminate = comdat any

$std.os.process.SubProcess.read_stdout = comdat any

$std.os.process.SubProcess.read_stderr = comdat any

$std.os.process.SubProcess.is_running = comdat any

$std.os.process.SubProcess.join = comdat any

$std.os.process.execute_stdout_to_buffer = comdat any

$std.os.process.create = comdat any

$"$ct.std.os.process.SubProcess" = comdat any

$"$ct.std.os.process.SubProcessOptions" = comdat any

$"$ct.int" = comdat any

$"$ct.long" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "index", linkageName: "create_named_pipe_helper.index", scope: !2, file: !2, line: 56, type: !3, isLocal: true, isDefinition: true, align: 8)
!2 = !DIFile(filename: "subprocess.c3", directory: "C:/Compilers/C3/lib/std/os")
!3 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!4 = !{i32 1, !"CodeView", i32 1}
!5 = !{i32 2, !"Debug Info Version", i32 3}
!6 = !{i32 2, !"wchar_size", i32 2}
!7 = !{i32 4, !"PIC Level", i32 2}
!8 = !{i32 1, !"uwtable", i32 2}
!9 = !{i32 1, !"MaxTLSAlign", i32 65536}
!10 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !11, splitDebugInlining: false)
!11 = !{!0}
!12 = distinct !DISubprogram(name: "stdout", linkageName: "std.os.process.SubProcess.stdout", scope: !2, file: !2, line: 397, type: !13, scopeLine: 397, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !20}
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !2, file: !2, line: 4, size: 64, align: 64, elements: !16, identifier: "std.io.File")
!16 = !{!17}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !15, file: !2, line: 6, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 379, baseType: !19, align: 8)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SubProcess*", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "SubProcess", scope: !2, file: !2, line: 17, size: 512, align: 64, elements: !22, identifier: "std.os.process.SubProcess")
!22 = !{!23, !24, !25, !26, !28, !29, !30, !31}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_file", scope: !21, file: !2, line: 19, baseType: !18, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_file", scope: !21, file: !2, line: 20, baseType: !18, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "stderr_file", scope: !21, file: !2, line: 21, baseType: !18, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "hProcess", scope: !21, file: !2, line: 23, baseType: !27, size: 64, align: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_HANDLE", scope: !2, file: !2, line: 17, baseType: !19, align: 8)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "hStdInput", scope: !21, file: !2, line: 24, baseType: !27, size: 64, align: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "hEventOutput", scope: !21, file: !2, line: 25, baseType: !27, size: 64, align: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "hEventError", scope: !21, file: !2, line: 26, baseType: !27, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "is_alive", scope: !21, file: !2, line: 31, baseType: !32, size: 8, align: 8, offset: 448)
!32 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!33 = !{}
!34 = !DILocation(line: 398, scope: !12)
!35 = !DILocalVariable(name: "self", arg: 1, scope: !12, file: !2, line: 397, type: !20)
!36 = !DILocation(line: 397, scope: !12)
!37 = !DILocation(line: 399, scope: !12)
!38 = !DILocation(line: 400, scope: !12)
!39 = distinct !DISubprogram(name: "stderr", linkageName: "std.os.process.SubProcess.stderr", scope: !2, file: !2, line: 403, type: !13, scopeLine: 403, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!40 = !DILocation(line: 404, scope: !39)
!41 = !DILocalVariable(name: "self", arg: 1, scope: !39, file: !2, line: 403, type: !20)
!42 = !DILocation(line: 403, scope: !39)
!43 = !DILocation(line: 405, scope: !39)
!44 = !DILocation(line: 406, scope: !39)
!45 = distinct !DISubprogram(name: "destroy", linkageName: "std.os.process.SubProcess.destroy", scope: !2, file: !2, line: 428, type: !46, scopeLine: 428, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!46 = !DISubroutineType(types: !47)
!47 = !{!32, !20}
!48 = !DILocation(line: 429, scope: !45)
!49 = !DILocalVariable(name: "self", arg: 1, scope: !45, file: !2, line: 428, type: !20)
!50 = !DILocation(line: 428, scope: !45)
!51 = !DILocation(line: 430, scope: !45)
!52 = !DILocation(line: 431, scope: !45)
!53 = !DILocation(line: 433, scope: !54)
!54 = distinct !DILexicalBlock(scope: !45, file: !2, line: 432, column: 2)
!55 = !DILocation(line: 434, scope: !54)
!56 = !DILocation(line: 436, scope: !45)
!57 = !DILocation(line: 438, scope: !45)
!58 = !DILocation(line: 439, scope: !45)
!59 = !DILocation(line: 440, scope: !45)
!60 = !DILocation(line: 441, scope: !45)
!61 = !DILocation(line: 442, scope: !45)
!62 = !DILocation(line: 444, scope: !45)
!63 = distinct !DISubprogram(name: "terminate", linkageName: "std.os.process.SubProcess.terminate", scope: !2, file: !2, line: 447, type: !64, scopeLine: 447, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !19, !20}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !3)
!67 = !DILocation(line: 448, scope: !63)
!68 = !DILocalVariable(name: "self", arg: 1, scope: !63, file: !2, line: 447, type: !20)
!69 = !DILocation(line: 447, scope: !63)
!70 = !DILocation(line: 450, scope: !63)
!71 = distinct !DISubprogram(name: "read_stdout", linkageName: "std.os.process.SubProcess.read_stdout", scope: !2, file: !2, line: 492, type: !72, scopeLine: 492, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!72 = !DISubroutineType(types: !73)
!73 = !{!66, !74, !20, !77, !76}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !75, size: 64, align: 64, dwarfAddressSpace: 0)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !76)
!76 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!78 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!79 = !DILocation(line: 493, scope: !71)
!80 = !DILocalVariable(name: "self", arg: 1, scope: !71, file: !2, line: 492, type: !20)
!81 = !DILocation(line: 492, scope: !71)
!82 = !DILocalVariable(name: "buffer", arg: 2, scope: !71, file: !2, line: 492, type: !77)
!83 = !DILocalVariable(name: "size", arg: 3, scope: !71, file: !2, line: 492, type: !75)
!84 = !DILocation(line: 494, scope: !71)
!85 = !DILocation(line: 497, scope: !71)
!86 = distinct !DISubprogram(name: "read_stderr", linkageName: "std.os.process.SubProcess.read_stderr", scope: !2, file: !2, line: 504, type: !72, scopeLine: 504, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!87 = !DILocation(line: 505, scope: !86)
!88 = !DILocalVariable(name: "self", arg: 1, scope: !86, file: !2, line: 504, type: !20)
!89 = !DILocation(line: 504, scope: !86)
!90 = !DILocalVariable(name: "buffer", arg: 2, scope: !86, file: !2, line: 504, type: !77)
!91 = !DILocalVariable(name: "size", arg: 3, scope: !86, file: !2, line: 504, type: !75)
!92 = !DILocation(line: 506, scope: !86)
!93 = !DILocation(line: 509, scope: !86)
!94 = distinct !DISubprogram(name: "is_running", linkageName: "std.os.process.SubProcess.is_running", scope: !2, file: !2, line: 515, type: !95, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!95 = !DISubroutineType(types: !96)
!96 = !{!66, !97, !20}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "bool*", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!98 = !DILocation(line: 516, scope: !94)
!99 = !DILocalVariable(name: "self", arg: 1, scope: !94, file: !2, line: 515, type: !20)
!100 = !DILocation(line: 515, scope: !94)
!101 = !DILocation(line: 517, scope: !94)
!102 = !DILocalVariable(name: "is_alive", scope: !94, file: !2, line: 519, type: !32, align: 1)
!103 = !DILocation(line: 519, scope: !94)
!104 = !DILocation(line: 520, scope: !94)
!105 = !DILocation(line: 521, scope: !94)
!106 = distinct !DISubprogram(name: "join", linkageName: "std.os.process.SubProcess.join", scope: !2, file: !2, line: 409, type: !107, scopeLine: 409, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!107 = !DISubroutineType(types: !108)
!108 = !{!66, !109, !20}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CInt*", baseType: !110, size: 64, align: 64, dwarfAddressSpace: 0)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !2, file: !2, line: 21, baseType: !111, align: 4)
!111 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!112 = !DILocation(line: 410, scope: !106)
!113 = !DILocalVariable(name: "self", arg: 1, scope: !106, file: !2, line: 409, type: !20)
!114 = !DILocation(line: 409, scope: !106)
!115 = !DILocation(line: 411, scope: !106)
!116 = !DILocation(line: 413, scope: !117)
!117 = distinct !DILexicalBlock(scope: !106, file: !2, line: 412, column: 2)
!118 = !DILocation(line: 414, scope: !117)
!119 = !DILocation(line: 416, scope: !106)
!120 = !DILocation(line: 418, scope: !121)
!121 = distinct !DILexicalBlock(scope: !106, file: !2, line: 417, column: 2)
!122 = !DILocation(line: 419, scope: !121)
!123 = !DILocation(line: 421, scope: !106)
!124 = !DILocalVariable(name: "return_code", scope: !106, file: !2, line: 422, type: !125, align: 4)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_DWORD", scope: !2, file: !2, line: 9, baseType: !126, align: 4)
!126 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!127 = !DILocation(line: 422, scope: !106)
!128 = !DILocation(line: 423, scope: !106)
!129 = !DILocation(line: 424, scope: !106)
!130 = !DILocation(line: 425, scope: !106)
!131 = distinct !DISubprogram(name: "execute_stdout_to_buffer", linkageName: "std.os.process.execute_stdout_to_buffer", scope: !2, file: !2, line: 290, type: !132, scopeLine: 290, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!132 = !DISubroutineType(types: !133)
!133 = !{!66, !134, !136, !140, !111, !140}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !135, size: 64, align: 64, dwarfAddressSpace: 0)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !136)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !137, identifier: "char[]")
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !136, baseType: !77, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !136, baseType: !75, size: 64, align: 64, offset: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !141, identifier: "String[]")
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !140, baseType: !134, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !140, baseType: !75, size: 64, align: 64, offset: 64)
!144 = !DILocalVariable(name: "buffer", arg: 1, scope: !131, file: !2, line: 290, type: !136)
!145 = !DILocation(line: 290, scope: !131)
!146 = !DILocalVariable(name: "command_line", arg: 2, scope: !131, file: !2, line: 290, type: !140)
!147 = !DILocalVariable(name: "options", arg: 3, scope: !131, file: !2, line: 290, type: !111)
!148 = !DILocalVariable(name: "environment", arg: 4, scope: !131, file: !2, line: 290, type: !140)
!149 = !DILocalVariable(name: "process", scope: !131, file: !2, line: 292, type: !21, align: 8)
!150 = !DILocation(line: 292, scope: !131)
!151 = !DILocation(line: 113, scope: !131)
!152 = !DILocation(line: 293, scope: !131)
!153 = !DILocalVariable(name: "len", scope: !131, file: !2, line: 294, type: !75, align: 8)
!154 = !DILocation(line: 294, scope: !131)
!155 = !DILocation(line: 295, scope: !131)
!156 = distinct !DISubprogram(name: "create_named_pipe_helper", linkageName: "std.os.process.create_named_pipe_helper.22383", scope: !2, file: !2, line: 52, type: !157, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !33)
!157 = !DISubroutineType(types: !158)
!158 = !{!66, !19, !159, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!160 = !DILocalVariable(name: "rd", arg: 1, scope: !156, file: !2, line: 52, type: !159)
!161 = !DILocation(line: 52, scope: !156)
!162 = !DILocalVariable(name: "wr", arg: 2, scope: !156, file: !2, line: 52, type: !159)
!163 = !DILocalVariable(name: "sa_attr", scope: !156, file: !2, line: 54, type: !164, align: 8)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_SECURITY_ATTRIBUTES", scope: !2, file: !2, line: 197, size: 192, align: 64, elements: !165, identifier: "std.os.win32.Win32_SECURITY_ATTRIBUTES")
!165 = !{!166, !167, !169}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nLength", scope: !164, file: !2, line: 199, baseType: !125, size: 32, align: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "lpSecurityDescriptor", scope: !164, file: !2, line: 200, baseType: !168, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LPVOID", scope: !2, file: !2, line: 80, baseType: !19, align: 8)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bInheritHandle", scope: !164, file: !2, line: 201, baseType: !170, size: 32, align: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_BOOL", scope: !2, file: !2, line: 3, baseType: !111, align: 4)
!171 = !DILocation(line: 54, scope: !156)
!172 = !DILocation(line: 56, scope: !156)
!173 = !DILocalVariable(name: "unique", scope: !156, file: !2, line: 57, type: !3, align: 8)
!174 = !DILocation(line: 57, scope: !156)
!175 = !DILocalVariable(name: "s", scope: !156, file: !2, line: 58, type: !135, align: 8)
!176 = !DILocation(line: 58, scope: !156)
!177 = !DILocalVariable(name: "str", scope: !156, file: !2, line: 59, type: !178, align: 8)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LPCSTR", scope: !2, file: !2, line: 70, baseType: !179, align: 8)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ichar*", baseType: !180, size: 64, align: 64, dwarfAddressSpace: 0)
!180 = !DIBasicType(name: "ichar", size: 8, encoding: DW_ATE_signed_char)
!181 = !DILocation(line: 59, scope: !156)
!182 = !DILocation(line: 64, scope: !156)
!183 = !DILocation(line: 60, scope: !156)
!184 = !DILocation(line: 65, scope: !156)
!185 = !DILocation(line: 68, scope: !156)
!186 = !DILocation(line: 66, scope: !156)
!187 = !DILocation(line: 69, scope: !156)
!188 = distinct !DISubprogram(name: "convert_command_line_win32", linkageName: "std.os.process.convert_command_line_win32.22391", scope: !2, file: !2, line: 72, type: !189, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !33)
!189 = !DISubroutineType(types: !190)
!190 = !{!191, !140}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "WString", scope: !2, file: !2, line: 23, baseType: !192, align: 8)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ushort*", baseType: !193, size: 64, align: 64, dwarfAddressSpace: 0)
!193 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!194 = !DILocalVariable(name: "command_line", arg: 1, scope: !188, file: !2, line: 72, type: !140)
!195 = !DILocation(line: 72, scope: !188)
!196 = !DILocalVariable(name: "str", scope: !188, file: !2, line: 74, type: !197, align: 8)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !198, align: 8)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !199, size: 64, align: 64, dwarfAddressSpace: 0)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 1)
!200 = !DILocation(line: 74, scope: !188)
!201 = !DILocation(line: 75, scope: !202)
!202 = distinct !DILexicalBlock(scope: !188, file: !2, line: 75, column: 2)
!203 = !DILocalVariable(name: ".temp", scope: !202, file: !2, line: 75, type: !75, align: 8)
!204 = !DILocalVariable(name: "i", scope: !205, file: !2, line: 75, type: !75, align: 8)
!205 = distinct !DILexicalBlock(scope: !202, file: !2, line: 76, column: 2)
!206 = !DILocation(line: 75, scope: !205)
!207 = !DILocalVariable(name: "s", scope: !205, file: !2, line: 75, type: !135, align: 8)
!208 = !DILocation(line: 77, scope: !209)
!209 = distinct !DILexicalBlock(scope: !205, file: !2, line: 76, column: 2)
!210 = !DILocation(line: 395, scope: !211, inlinedAt: !208)
!211 = distinct !DILexicalBlock(scope: !213, file: !212, line: 396, column: 1)
!212 = !DIFile(filename: "dstring.c3", directory: "C:/Compilers/C3/lib/std/core")
!213 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !212, file: !212, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!214 = !DILocation(line: 401, scope: !213, inlinedAt: !208)
!215 = !DILocation(line: 81, scope: !216)
!216 = distinct !DILexicalBlock(scope: !217, file: !2, line: 81, column: 4)
!217 = distinct !DILexicalBlock(scope: !218, file: !2, line: 80, column: 3)
!218 = distinct !DILexicalBlock(scope: !209, file: !2, line: 79, column: 3)
!219 = !DILocalVariable(name: ".temp", scope: !216, file: !2, line: 81, type: !75, align: 8)
!220 = !DILocalVariable(name: "c", scope: !221, file: !2, line: 81, type: !78, align: 1)
!221 = distinct !DILexicalBlock(scope: !216, file: !2, line: 82, column: 4)
!222 = !DILocation(line: 81, scope: !221)
!223 = !DILocation(line: 88, scope: !224)
!224 = distinct !DILexicalBlock(scope: !225, file: !2, line: 88, column: 7)
!225 = distinct !DILexicalBlock(scope: !226, file: !2, line: 83, column: 5)
!226 = distinct !DILexicalBlock(scope: !221, file: !2, line: 82, column: 4)
!227 = !DILocation(line: 395, scope: !228, inlinedAt: !230)
!228 = distinct !DILexicalBlock(scope: !229, file: !212, line: 396, column: 1)
!229 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !212, file: !212, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!230 = !DILocation(line: 91, scope: !217)
!231 = !DILocation(line: 405, scope: !229, inlinedAt: !230)
!232 = !DILocation(line: 92, scope: !217)
!233 = !DILocation(line: 395, scope: !234, inlinedAt: !236)
!234 = distinct !DILexicalBlock(scope: !235, file: !212, line: 396, column: 1)
!235 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !212, file: !212, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!236 = !DILocation(line: 94, scope: !209)
!237 = !DILocation(line: 401, scope: !235, inlinedAt: !236)
!238 = !DILocation(line: 95, scope: !239)
!239 = distinct !DILexicalBlock(scope: !209, file: !2, line: 95, column: 3)
!240 = !DILocalVariable(name: ".temp", scope: !239, file: !2, line: 95, type: !75, align: 8)
!241 = !DILocalVariable(name: "j", scope: !242, file: !2, line: 95, type: !75, align: 8)
!242 = distinct !DILexicalBlock(scope: !239, file: !2, line: 96, column: 3)
!243 = !DILocation(line: 95, scope: !242)
!244 = !DILocalVariable(name: "c", scope: !242, file: !2, line: 95, type: !78, align: 1)
!245 = !DILocation(line: 100, scope: !246)
!246 = distinct !DILexicalBlock(scope: !247, file: !2, line: 100, column: 6)
!247 = distinct !DILexicalBlock(scope: !248, file: !2, line: 97, column: 4)
!248 = distinct !DILexicalBlock(scope: !242, file: !2, line: 96, column: 3)
!249 = !DILocation(line: 395, scope: !250, inlinedAt: !245)
!250 = distinct !DILexicalBlock(scope: !251, file: !212, line: 396, column: 1)
!251 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !212, file: !212, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!252 = !DILocation(line: 401, scope: !251, inlinedAt: !245)
!253 = !DILocation(line: 395, scope: !254, inlinedAt: !256)
!254 = distinct !DILexicalBlock(scope: !255, file: !212, line: 396, column: 1)
!255 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !212, file: !212, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!256 = !DILocation(line: 102, scope: !257)
!257 = distinct !DILexicalBlock(scope: !247, file: !2, line: 102, column: 6)
!258 = !DILocation(line: 401, scope: !255, inlinedAt: !256)
!259 = !DILocation(line: 395, scope: !260, inlinedAt: !262)
!260 = distinct !DILexicalBlock(scope: !261, file: !212, line: 396, column: 1)
!261 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !212, file: !212, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!262 = !DILocation(line: 104, scope: !248)
!263 = !DILocation(line: 401, scope: !261, inlinedAt: !262)
!264 = !DILocation(line: 395, scope: !265, inlinedAt: !267)
!265 = distinct !DILexicalBlock(scope: !266, file: !212, line: 396, column: 1)
!266 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !212, file: !212, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!267 = !DILocation(line: 106, scope: !209)
!268 = !DILocation(line: 401, scope: !266, inlinedAt: !267)
!269 = !DILocation(line: 395, scope: !270, inlinedAt: !272)
!270 = distinct !DILexicalBlock(scope: !271, file: !212, line: 396, column: 1)
!271 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !212, file: !212, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!272 = !DILocation(line: 108, scope: !188)
!273 = !DILocation(line: 401, scope: !271, inlinedAt: !272)
!274 = !DILocation(line: 109, scope: !188)
!275 = distinct !DISubprogram(name: "create", linkageName: "std.os.process.create", scope: !2, file: !2, line: 115, type: !276, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!276 = !DISubroutineType(types: !277)
!277 = !{!66, !20, !140, !111, !140}
!278 = !DILocalVariable(name: "command_line", arg: 1, scope: !275, file: !2, line: 115, type: !140)
!279 = !DILocation(line: 115, scope: !275)
!280 = !DILocalVariable(name: "options", arg: 2, scope: !275, file: !2, line: 115, type: !111)
!281 = !DILocalVariable(name: "environment", arg: 3, scope: !275, file: !2, line: 115, type: !140)
!282 = !DILocation(line: 113, scope: !283)
!283 = distinct !DILexicalBlock(scope: !275, file: !2, line: 116, column: 1)
!284 = !DILocalVariable(name: "flags", scope: !275, file: !2, line: 117, type: !125, align: 4)
!285 = !DILocation(line: 117, scope: !275)
!286 = !DILocalVariable(name: "process_info", scope: !275, file: !2, line: 118, type: !287, align: 8)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_PROCESS_INFORMATION", scope: !2, file: !2, line: 263, size: 192, align: 64, elements: !288, identifier: "std.os.win32.Win32_PROCESS_INFORMATION")
!288 = !{!289, !290, !291, !292}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "hProcess", scope: !287, file: !2, line: 265, baseType: !27, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "hThread", scope: !287, file: !2, line: 266, baseType: !27, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "dwProcessId", scope: !287, file: !2, line: 267, baseType: !125, size: 32, align: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dwThreadId", scope: !287, file: !2, line: 268, baseType: !125, size: 32, align: 32, offset: 160)
!293 = !DILocation(line: 118, scope: !275)
!294 = !DILocalVariable(name: "sa_attr", scope: !275, file: !2, line: 119, type: !164, align: 8)
!295 = !DILocation(line: 119, scope: !275)
!296 = !DILocalVariable(name: "start_info", scope: !275, file: !2, line: 120, type: !297, align: 8)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_STARTUPINFOW", scope: !2, file: !2, line: 209, size: 832, align: 64, elements: !298, identifier: "std.os.win32.Win32_STARTUPINFOW")
!298 = !{!299, !300, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !314, !315, !317, !318, !319}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !297, file: !2, line: 211, baseType: !125, size: 32, align: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "lpReserved", scope: !297, file: !2, line: 212, baseType: !301, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LPWSTR", scope: !2, file: !2, line: 82, baseType: !192, align: 8)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "lpDesktop", scope: !297, file: !2, line: 213, baseType: !301, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "lpTitle", scope: !297, file: !2, line: 214, baseType: !301, size: 64, align: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dwX", scope: !297, file: !2, line: 215, baseType: !125, size: 32, align: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "dwY", scope: !297, file: !2, line: 216, baseType: !125, size: 32, align: 32, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "dwXSize", scope: !297, file: !2, line: 217, baseType: !125, size: 32, align: 32, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "dwYSize", scope: !297, file: !2, line: 218, baseType: !125, size: 32, align: 32, offset: 352)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "dwXCountChars", scope: !297, file: !2, line: 219, baseType: !125, size: 32, align: 32, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "dwYCountChars", scope: !297, file: !2, line: 220, baseType: !125, size: 32, align: 32, offset: 416)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dwFillAttribute", scope: !297, file: !2, line: 221, baseType: !125, size: 32, align: 32, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "dwFlags", scope: !297, file: !2, line: 222, baseType: !125, size: 32, align: 32, offset: 480)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "wShowWindow", scope: !297, file: !2, line: 223, baseType: !313, size: 16, align: 16, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_WORD", scope: !2, file: !2, line: 170, baseType: !193, align: 2)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "cbReserved2", scope: !297, file: !2, line: 224, baseType: !313, size: 16, align: 16, offset: 528)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "lpReserved2", scope: !297, file: !2, line: 225, baseType: !316, size: 64, align: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LPBYTE", scope: !2, file: !2, line: 68, baseType: !77, align: 8)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "hStdInput", scope: !297, file: !2, line: 226, baseType: !27, size: 64, align: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "hStdOutput", scope: !297, file: !2, line: 227, baseType: !27, size: 64, align: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "hStdError", scope: !297, file: !2, line: 228, baseType: !27, size: 64, align: 64, offset: 768)
!320 = !DILocation(line: 120, scope: !275)
!321 = !DILocation(line: 121, scope: !275)
!322 = !DILocation(line: 124, scope: !275)
!323 = !DILocation(line: 127, scope: !275)
!324 = !DILocalVariable(name: "stdin", scope: !275, file: !2, line: 129, type: !18, align: 8)
!325 = !DILocation(line: 129, scope: !275)
!326 = !DILocalVariable(name: "stdout", scope: !275, file: !2, line: 130, type: !18, align: 8)
!327 = !DILocation(line: 130, scope: !275)
!328 = !DILocalVariable(name: "stderr", scope: !275, file: !2, line: 131, type: !18, align: 8)
!329 = !DILocation(line: 131, scope: !275)
!330 = !DILocalVariable(name: "rd", scope: !275, file: !2, line: 132, type: !19, align: 8)
!331 = !DILocation(line: 132, scope: !275)
!332 = !DILocalVariable(name: "wr", scope: !275, file: !2, line: 133, type: !19, align: 8)
!333 = !DILocation(line: 133, scope: !275)
!334 = !DILocation(line: 136, scope: !275)
!335 = !DILocation(line: 138, scope: !336)
!336 = distinct !DILexicalBlock(scope: !275, file: !2, line: 137, column: 2)
!337 = !DILocation(line: 140, scope: !336)
!338 = !DILocalVariable(name: "buffer", scope: !339, file: !2, line: 572, type: !341, align: 16)
!339 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !340, file: !340, line: 570, scopeLine: 570, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !33)
!340 = !DIFile(filename: "mem.c3", directory: "C:/Compilers/C3/lib/std/core")
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 16384, align: 8, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 2048, lowerBound: 0)
!344 = !DILocation(line: 572, scope: !339, inlinedAt: !345)
!345 = !DILocation(line: 143, scope: !275)
!346 = !DILocalVariable(name: "allocator", scope: !339, file: !2, line: 573, type: !347, align: 8)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 12, size: 384, align: 64, elements: !348, identifier: "std.core.mem.allocator.OnStackAllocator")
!348 = !{!349, !355, !356, !357}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !347, file: !2, line: 14, baseType: !350, size: 128, align: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !351, identifier: "Allocator")
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !350, baseType: !19, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !350, baseType: !354, size: 64, align: 64, offset: 64)
!354 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !347, file: !2, line: 15, baseType: !136, size: 128, align: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !347, file: !2, line: 16, baseType: !75, size: 64, align: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !347, file: !2, line: 17, baseType: !358, size: 64, align: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !359, size: 64, align: 64, dwarfAddressSpace: 0)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !360, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.8319")
!360 = !{!361, !362, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !359, file: !2, line: 22, baseType: !32, size: 8, align: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !359, file: !2, line: 23, baseType: !358, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !359, file: !2, line: 24, baseType: !19, size: 64, align: 64, offset: 128)
!364 = !DILocation(line: 573, scope: !339, inlinedAt: !345)
!365 = !DILocation(line: 574, scope: !339, inlinedAt: !345)
!366 = !DILocalVariable(name: "mem", scope: !275, file: !2, line: 143, type: !350, align: 8)
!367 = !DILocation(line: 576, scope: !368, inlinedAt: !345)
!368 = distinct !DILexicalBlock(scope: !339, file: !340, line: 576, column: 2)
!369 = !DILocalVariable(name: "used_environment", scope: !370, file: !2, line: 145, type: !191, align: 8)
!370 = distinct !DILexicalBlock(scope: !275, file: !2, line: 144, column: 2)
!371 = !DILocation(line: 145, scope: !370)
!372 = !DILocation(line: 146, scope: !370)
!373 = !DILocalVariable(name: "env", scope: !374, file: !2, line: 148, type: !197, align: 8)
!374 = distinct !DILexicalBlock(scope: !370, file: !2, line: 147, column: 3)
!375 = !DILocation(line: 148, scope: !374)
!376 = !DILocation(line: 149, scope: !374)
!377 = !DILocation(line: 395, scope: !378, inlinedAt: !380)
!378 = distinct !DILexicalBlock(scope: !379, file: !212, line: 396, column: 1)
!379 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !212, file: !212, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!380 = !DILocation(line: 151, scope: !381)
!381 = distinct !DILexicalBlock(scope: !374, file: !2, line: 150, column: 4)
!382 = !DILocation(line: 405, scope: !379, inlinedAt: !380)
!383 = !DILocation(line: 153, scope: !384)
!384 = distinct !DILexicalBlock(scope: !374, file: !2, line: 153, column: 4)
!385 = !DILocalVariable(name: ".temp", scope: !384, file: !2, line: 153, type: !75, align: 8)
!386 = !DILocalVariable(name: "s", scope: !387, file: !2, line: 153, type: !135, align: 8)
!387 = distinct !DILexicalBlock(scope: !384, file: !2, line: 154, column: 4)
!388 = !DILocation(line: 153, scope: !387)
!389 = !DILocation(line: 395, scope: !390, inlinedAt: !392)
!390 = distinct !DILexicalBlock(scope: !391, file: !212, line: 396, column: 1)
!391 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !212, file: !212, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!392 = !DILocation(line: 155, scope: !393)
!393 = distinct !DILexicalBlock(scope: !387, file: !2, line: 154, column: 4)
!394 = !DILocation(line: 405, scope: !391, inlinedAt: !392)
!395 = !DILocation(line: 395, scope: !396, inlinedAt: !398)
!396 = distinct !DILexicalBlock(scope: !397, file: !212, line: 396, column: 1)
!397 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !212, file: !212, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!398 = !DILocation(line: 156, scope: !393)
!399 = !DILocation(line: 405, scope: !397, inlinedAt: !398)
!400 = !DILocation(line: 395, scope: !401, inlinedAt: !403)
!401 = distinct !DILexicalBlock(scope: !402, file: !212, line: 396, column: 1)
!402 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !212, file: !212, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!403 = !DILocation(line: 158, scope: !374)
!404 = !DILocation(line: 405, scope: !402, inlinedAt: !403)
!405 = !DILocation(line: 159, scope: !374)
!406 = !DILocation(line: 575, scope: !407, inlinedAt: !345)
!407 = distinct !DILexicalBlock(scope: !339, file: !340, line: 575, column: 8)
!408 = !DILocation(line: 163, scope: !370)
!409 = !DILocalVariable(name: "fd", scope: !410, file: !2, line: 165, type: !111, align: 4)
!410 = distinct !DILexicalBlock(scope: !370, file: !2, line: 164, column: 3)
!411 = !DILocation(line: 165, scope: !410)
!412 = !DILocation(line: 166, scope: !410)
!413 = !DILocation(line: 168, scope: !414)
!414 = distinct !DILexicalBlock(scope: !410, file: !2, line: 167, column: 4)
!415 = !DILocation(line: 169, scope: !414)
!416 = !DILocation(line: 575, scope: !417, inlinedAt: !345)
!417 = distinct !DILexicalBlock(scope: !339, file: !340, line: 575, column: 8)
!418 = !DILocation(line: 171, scope: !410)
!419 = !DILocation(line: 174, scope: !410)
!420 = !DILocation(line: 176, scope: !421)
!421 = distinct !DILexicalBlock(scope: !410, file: !2, line: 175, column: 4)
!422 = !DILocation(line: 575, scope: !423, inlinedAt: !345)
!423 = distinct !DILexicalBlock(scope: !339, file: !340, line: 575, column: 8)
!424 = !DILocation(line: 180, scope: !425)
!425 = distinct !DILexicalBlock(scope: !410, file: !2, line: 179, column: 4)
!426 = !DILocation(line: 575, scope: !427, inlinedAt: !345)
!427 = distinct !DILexicalBlock(scope: !339, file: !340, line: 575, column: 8)
!428 = !DILocation(line: 182, scope: !410)
!429 = !DILocation(line: 575, scope: !430, inlinedAt: !345)
!430 = distinct !DILexicalBlock(scope: !339, file: !340, line: 575, column: 8)
!431 = !DILocation(line: 184, scope: !410)
!432 = !DILocation(line: 185, scope: !410)
!433 = !DILocation(line: 187, scope: !434)
!434 = distinct !DILexicalBlock(scope: !410, file: !2, line: 186, column: 4)
!435 = !DILocation(line: 188, scope: !434)
!436 = !DILocation(line: 575, scope: !437, inlinedAt: !345)
!437 = distinct !DILexicalBlock(scope: !339, file: !340, line: 575, column: 8)
!438 = !DILocation(line: 191, scope: !410)
!439 = !DILocation(line: 196, scope: !440)
!440 = distinct !DILexicalBlock(scope: !441, file: !2, line: 195, column: 4)
!441 = distinct !DILexicalBlock(scope: !410, file: !2, line: 194, column: 4)
!442 = !DILocation(line: 198, scope: !443)
!443 = distinct !DILexicalBlock(scope: !440, file: !2, line: 197, column: 5)
!444 = !DILocation(line: 199, scope: !443)
!445 = !DILocation(line: 200, scope: !443)
!446 = !DILocation(line: 202, scope: !440)
!447 = !DILocation(line: 204, scope: !448)
!448 = distinct !DILexicalBlock(scope: !440, file: !2, line: 203, column: 5)
!449 = !DILocation(line: 575, scope: !450, inlinedAt: !345)
!450 = distinct !DILexicalBlock(scope: !339, file: !340, line: 575, column: 8)
!451 = !DILocation(line: 208, scope: !452)
!452 = distinct !DILexicalBlock(scope: !440, file: !2, line: 207, column: 5)
!453 = !DILocation(line: 575, scope: !454, inlinedAt: !345)
!454 = distinct !DILexicalBlock(scope: !339, file: !340, line: 575, column: 8)
!455 = !DILocation(line: 210, scope: !440)
!456 = !DILocation(line: 575, scope: !457, inlinedAt: !345)
!457 = distinct !DILexicalBlock(scope: !339, file: !340, line: 575, column: 8)
!458 = !DILocation(line: 212, scope: !440)
!459 = !DILocation(line: 213, scope: !440)
!460 = !DILocation(line: 215, scope: !461)
!461 = distinct !DILexicalBlock(scope: !440, file: !2, line: 214, column: 5)
!462 = !DILocation(line: 216, scope: !461)
!463 = !DILocation(line: 575, scope: !464, inlinedAt: !345)
!464 = distinct !DILexicalBlock(scope: !339, file: !340, line: 575, column: 8)
!465 = !DILocation(line: 218, scope: !440)
!466 = !DILocalVariable(name: "event_output", scope: !370, file: !2, line: 222, type: !19, align: 8)
!467 = !DILocation(line: 222, scope: !370)
!468 = !DILocalVariable(name: "event_error", scope: !370, file: !2, line: 223, type: !19, align: 8)
!469 = !DILocation(line: 223, scope: !370)
!470 = !DILocation(line: 224, scope: !370)
!471 = !DILocation(line: 226, scope: !472)
!472 = distinct !DILexicalBlock(scope: !370, file: !2, line: 225, column: 3)
!473 = !DILocation(line: 227, scope: !472)
!474 = !DILocation(line: 232, scope: !370)
!475 = !DILocation(line: 237, scope: !370)
!476 = !DILocation(line: 240, scope: !370)
!477 = !DILocation(line: 230, scope: !370)
!478 = !DILocation(line: 575, scope: !479, inlinedAt: !345)
!479 = distinct !DILexicalBlock(scope: !339, file: !340, line: 575, column: 8)
!480 = !DILocation(line: 575, scope: !481, inlinedAt: !345)
!481 = distinct !DILexicalBlock(scope: !339, file: !340, line: 575, column: 8)
!482 = !DILocation(line: 244, scope: !275)
!483 = !DILocation(line: 247, scope: !275)
!484 = !DILocation(line: 249, scope: !485)
!485 = distinct !DILexicalBlock(scope: !275, file: !2, line: 248, column: 2)
!486 = !DILocation(line: 250, scope: !485)
!487 = !DILocation(line: 254, scope: !275)
!488 = !DILocation(line: 255, scope: !275)
!489 = !DILocation(line: 256, scope: !275)
!490 = !DILocation(line: 257, scope: !275)
!491 = !DILocation(line: 258, scope: !275)
!492 = !DILocation(line: 259, scope: !275)
!493 = distinct !DISubprogram(name: "read_from_file_win32", linkageName: "std.os.process.read_from_file_win32.22470", scope: !2, file: !2, line: 459, type: !494, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !33)
!494 = !DISubroutineType(types: !495)
!495 = !{!66, !74, !19, !19, !77, !76}
!496 = !DILocalVariable(name: "file", arg: 1, scope: !493, file: !2, line: 459, type: !18)
!497 = !DILocation(line: 459, scope: !493)
!498 = !DILocalVariable(name: "event_handle", arg: 2, scope: !493, file: !2, line: 459, type: !27)
!499 = !DILocalVariable(name: "buffer", arg: 3, scope: !493, file: !2, line: 459, type: !77)
!500 = !DILocalVariable(name: "size", arg: 4, scope: !493, file: !2, line: 459, type: !75)
!501 = !DILocation(line: 457, scope: !502)
!502 = distinct !DILexicalBlock(scope: !493, file: !2, line: 460, column: 1)
!503 = !DILocalVariable(name: "fd", scope: !493, file: !2, line: 461, type: !110, align: 4)
!504 = !DILocation(line: 461, scope: !493)
!505 = !DILocalVariable(name: "bytes_read", scope: !493, file: !2, line: 462, type: !125, align: 4)
!506 = !DILocation(line: 462, scope: !493)
!507 = !DILocalVariable(name: "overlapped", scope: !493, file: !2, line: 463, type: !508, align: 8)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_OVERLAPPED", scope: !2, file: !2, line: 231, size: 256, align: 64, elements: !509, identifier: "std.os.win32.Win32_OVERLAPPED")
!509 = !{!510, !512, !513, !523}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !508, file: !2, line: 233, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_ULONG_PTR", scope: !2, file: !2, line: 164, baseType: !76, align: 8)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "internalHigh", scope: !508, file: !2, line: 234, baseType: !511, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, scope: !508, file: !2, line: 235, baseType: !514, size: 64, align: 64, offset: 128)
!514 = !DICompositeType(tag: DW_TAG_union_type, scope: !508, file: !2, line: 235, size: 64, align: 64, elements: !515)
!515 = !{!516, !521}
!516 = !DIDerivedType(tag: DW_TAG_member, scope: !514, file: !2, line: 236, baseType: !517, size: 64, align: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !514, file: !2, line: 236, size: 64, align: 64, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !517, file: !2, line: 237, baseType: !125, size: 32, align: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "offsetHigh", scope: !517, file: !2, line: 238, baseType: !125, size: 32, align: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !514, file: !2, line: 240, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_PVOID", scope: !2, file: !2, line: 140, baseType: !19, align: 8)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "hEvent", scope: !508, file: !2, line: 242, baseType: !27, size: 64, align: 64, offset: 192)
!524 = !DILocation(line: 463, scope: !493)
!525 = !DILocalVariable(name: "handle", scope: !493, file: !2, line: 464, type: !27, align: 8)
!526 = !DILocation(line: 464, scope: !493)
!527 = !DILocation(line: 465, scope: !493)
!528 = !DILocation(line: 468, scope: !529)
!529 = distinct !DILexicalBlock(scope: !493, file: !2, line: 466, column: 2)
!530 = !DILocation(line: 470, scope: !531)
!531 = distinct !DILexicalBlock(scope: !529, file: !2, line: 469, column: 3)
!532 = !DILocation(line: 472, scope: !533)
!533 = distinct !DILexicalBlock(scope: !534, file: !2, line: 472, column: 5)
!534 = distinct !DILexicalBlock(scope: !531, file: !2, line: 471, column: 4)
!535 = !DILocation(line: 476, scope: !536)
!536 = distinct !DILexicalBlock(scope: !533, file: !2, line: 476, column: 7)
!537 = !DILocation(line: 478, scope: !538)
!538 = distinct !DILexicalBlock(scope: !533, file: !2, line: 478, column: 7)
!539 = !DILocation(line: 483, scope: !493)
