; ModuleID = 'std::net::tcp'
source_filename = "std::net::tcp"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%Socket = type { ptr, i64, [128 x i8] }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.net.tcp.connect = comdat any

$std.net.tcp.connect_async = comdat any

$std.net.tcp.connect_to = comdat any

$std.net.tcp.connect_async_to = comdat any

$std.net.tcp.listen = comdat any

$std.net.tcp.accept = comdat any

$std.net.tcp.listen_to = comdat any

$"$ct.std.net.tcp.TcpSocket" = comdat any

$"$ct.std.net.Socket" = comdat any

$"$ct.std.net.tcp.TcpServerSocket" = comdat any

$"$ct.char" = comdat any

$"$ct.std.net.IpProtocol" = comdat any

$"std.net.IpProtocol$ai_family" = comdat any

$std.net.ACCEPT_FAILED = comdat any

$"$ct.ulong" = comdat any

$"$ct.long" = comdat any

@"$ct.std.net.tcp.TcpSocket" = linkonce global %.introspect { i8 18, i64 ptrtoint (ptr @"$ct.std.net.Socket" to i64), ptr null, i64 144, i64 ptrtoint (ptr @"$ct.std.net.Socket" to i64), i64 0, [0 x i64] zeroinitializer }, comdat, align 8
@"$ct.std.net.Socket" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 144, i64 0, i64 3, [0 x i64] zeroinitializer }, comdat, align 8

!0 = !{i32 1, !"CodeView", i32 1}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 2}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 2}
!5 = !{i32 1, !"MaxTLSAlign", i32 65536}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "tcp.c3", directory: "C:/Compilers/C3/lib/std/net")
!8 = !{!9, !17}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SocketOption", scope: !7, file: !7, line: 87, baseType: !10, size: 8, align: 8, elements: !11)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !{!12, !13, !14, !15, !16}
!12 = !DIEnumerator(name: "REUSEADDR", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "KEEPALIVE", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "BROADCAST", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OOBINLINE", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "DONTROUTE", value: 4, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IpProtocol", scope: !7, file: !7, line: 4, baseType: !10, size: 8, align: 8, elements: !18)
!18 = !{!19, !20, !21}
!19 = !DIEnumerator(name: "UNSPECIFIED", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "IPV4", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "IPV6", value: 2, isUnsigned: true)
!22 = distinct !DISubprogram(name: "connect", linkageName: "std.net.tcp.connect", scope: !7, file: !7, line: 8, type: !23, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !55)
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !27, !41, !48, !49, !50, !17}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !26)
!26 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TcpSocket*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "TcpSocket", scope: !7, file: !7, line: 5, baseType: !29, align: 8)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "Socket", scope: !7, file: !7, line: 4, size: 1152, align: 64, elements: !30, identifier: "std.net.Socket")
!30 = !{!31, !34, !37}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !29, file: !7, line: 6, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "NativeSocket", scope: !7, file: !7, line: 15, baseType: !33, align: 8)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !29, file: !7, line: 7, baseType: !35, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "Socklen_t", scope: !7, file: !7, line: 10, baseType: !36, align: 8)
!36 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr_storage", scope: !29, file: !7, line: 10, baseType: !38, size: 1024, align: 8, offset: 128)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, align: 8, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 128, lowerBound: 0)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !43, identifier: "char[]")
!43 = !{!44, !46}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !42, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !42, baseType: !47, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !36)
!48 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "Duration", scope: !7, file: !7, line: 5, baseType: !26, align: 8)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "SocketOption[]", size: 128, align: 64, elements: !51, identifier: "SocketOption[]")
!51 = !{!52, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !50, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SocketOption*", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !50, baseType: !47, size: 64, align: 64, offset: 64)
!55 = !{}
!56 = !DILocalVariable(name: "host", arg: 1, scope: !22, file: !7, line: 8, type: !41)
!57 = !DILocation(line: 8, scope: !22)
!58 = !DILocalVariable(name: "port", arg: 2, scope: !22, file: !7, line: 8, type: !48)
!59 = !DILocalVariable(name: "timeout", arg: 3, scope: !22, file: !7, line: 8, type: !49)
!60 = !DILocalVariable(name: "options", arg: 4, scope: !22, file: !7, line: 8, type: !50)
!61 = !DILocalVariable(name: "ip_protocol", arg: 5, scope: !22, file: !7, line: 8, type: !17)
!62 = !DILocalVariable(name: "ai", scope: !22, file: !7, line: 10, type: !63, align: 8)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "AddrInfo*", baseType: !64, size: 64, align: 64, dwarfAddressSpace: 0)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddrInfo", scope: !7, file: !7, line: 14, size: 384, align: 64, elements: !65, identifier: "std.net.os.AddrInfo")
!65 = !{!66, !69, !71, !73, !75, !76, !83}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !64, file: !7, line: 16, baseType: !67, size: 32, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIFlags", scope: !7, file: !7, line: 7, baseType: !68, align: 4)
!68 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !64, file: !7, line: 17, baseType: !70, size: 32, align: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIFamily", scope: !7, file: !7, line: 4, baseType: !68, align: 4)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !64, file: !7, line: 18, baseType: !72, size: 32, align: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "AISockType", scope: !7, file: !7, line: 6, baseType: !68, align: 4)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !64, file: !7, line: 19, baseType: !74, size: 32, align: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIProtocol", scope: !7, file: !7, line: 5, baseType: !68, align: 4)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !64, file: !7, line: 20, baseType: !35, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, scope: !64, file: !7, line: 21, baseType: !77, size: 128, align: 64, offset: 192)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !64, file: !7, line: 21, size: 128, align: 64, elements: !78)
!78 = !{!79, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !77, file: !7, line: 23, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !7, file: !7, line: 12, baseType: !45, align: 8)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !77, file: !7, line: 24, baseType: !82, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "SockAddrPtr", scope: !7, file: !7, line: 12, baseType: !33, align: 8)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !64, file: !7, line: 31, baseType: !63, size: 64, align: 64, offset: 320)
!84 = !DILocation(line: 10, scope: !22)
!85 = !DILocation(line: 12, scope: !22)
!86 = !DILocation(line: 14, scope: !87)
!87 = distinct !DILexicalBlock(scope: !22, file: !7, line: 13, column: 2)
!88 = !DILocation(line: 11, scope: !89)
!89 = distinct !DILexicalBlock(scope: !22, file: !7, line: 11, column: 8)
!90 = !DILocation(line: 11, scope: !91)
!91 = distinct !DILexicalBlock(scope: !22, file: !7, line: 11, column: 8)
!92 = !DILocation(line: 16, scope: !22)
!93 = !DILocation(line: 11, scope: !94)
!94 = distinct !DILexicalBlock(scope: !22, file: !7, line: 11, column: 8)
!95 = !DILocation(line: 11, scope: !96)
!96 = distinct !DILexicalBlock(scope: !22, file: !7, line: 11, column: 8)
!97 = distinct !DISubprogram(name: "connect_async", linkageName: "std.net.tcp.connect_async", scope: !7, file: !7, line: 19, type: !98, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !55)
!98 = !DISubroutineType(types: !99)
!99 = !{!25, !27, !41, !48, !50, !17}
!100 = !DILocalVariable(name: "host", arg: 1, scope: !97, file: !7, line: 19, type: !41)
!101 = !DILocation(line: 19, scope: !97)
!102 = !DILocalVariable(name: "port", arg: 2, scope: !97, file: !7, line: 19, type: !48)
!103 = !DILocalVariable(name: "options", arg: 3, scope: !97, file: !7, line: 19, type: !50)
!104 = !DILocalVariable(name: "ip_protocol", arg: 4, scope: !97, file: !7, line: 19, type: !17)
!105 = !DILocalVariable(name: "ai", scope: !97, file: !7, line: 21, type: !63, align: 8)
!106 = !DILocation(line: 21, scope: !97)
!107 = !DILocation(line: 23, scope: !97)
!108 = !DILocation(line: 22, scope: !109)
!109 = distinct !DILexicalBlock(scope: !97, file: !7, line: 22, column: 8)
!110 = !DILocation(line: 22, scope: !111)
!111 = distinct !DILexicalBlock(scope: !97, file: !7, line: 22, column: 8)
!112 = distinct !DISubprogram(name: "connect_to", linkageName: "std.net.tcp.connect_to", scope: !7, file: !7, line: 26, type: !113, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !55)
!113 = !DISubroutineType(types: !114)
!114 = !{!25, !27, !63, !50}
!115 = !DILocalVariable(name: "ai", arg: 1, scope: !112, file: !7, line: 26, type: !63)
!116 = !DILocation(line: 26, scope: !112)
!117 = !DILocalVariable(name: "options", arg: 2, scope: !112, file: !7, line: 26, type: !50)
!118 = !DILocation(line: 28, scope: !112)
!119 = distinct !DISubprogram(name: "connect_async_to", linkageName: "std.net.tcp.connect_async_to", scope: !7, file: !7, line: 31, type: !113, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !55)
!120 = !DILocalVariable(name: "ai", arg: 1, scope: !119, file: !7, line: 31, type: !63)
!121 = !DILocation(line: 31, scope: !119)
!122 = !DILocalVariable(name: "options", arg: 2, scope: !119, file: !7, line: 31, type: !50)
!123 = !DILocation(line: 33, scope: !119)
!124 = distinct !DISubprogram(name: "listen", linkageName: "std.net.tcp.listen", scope: !7, file: !7, line: 36, type: !125, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !55)
!125 = !DISubroutineType(types: !126)
!126 = !{!25, !127, !41, !48, !48, !50, !17}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TcpServerSocket*", baseType: !128, size: 64, align: 64, dwarfAddressSpace: 0)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "TcpServerSocket", scope: !7, file: !7, line: 6, baseType: !29, align: 8)
!129 = !DILocalVariable(name: "host", arg: 1, scope: !124, file: !7, line: 36, type: !41)
!130 = !DILocation(line: 36, scope: !124)
!131 = !DILocalVariable(name: "port", arg: 2, scope: !124, file: !7, line: 36, type: !48)
!132 = !DILocalVariable(name: "backlog", arg: 3, scope: !124, file: !7, line: 36, type: !48)
!133 = !DILocalVariable(name: "options", arg: 4, scope: !124, file: !7, line: 36, type: !50)
