; ModuleID = 'std::thread::threadpool'
source_filename = "std::thread::threadpool"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%FixedThreadPool = type { %NativeMutex, %"QueueItem[]", i64, i64, i8, %"void*[]", %NativeConditionVariable }
%NativeMutex = type { ptr, i32, i32 }
%"QueueItem[]" = type { ptr, i64 }
%"void*[]" = type { ptr, i64 }
%NativeConditionVariable = type { ptr }
%QueueItem = type { ptr, %"any[]" }

$std.thread.threadpool.FixedThreadPool.init = comdat any

$std.thread.threadpool.FixedThreadPool.destroy = comdat any

$std.thread.threadpool.FixedThreadPool.stop_and_destroy = comdat any

$std.thread.threadpool.FixedThreadPool.push = comdat any

$.dyn_search = comdat any

$"$ct.std.thread.threadpool.FixedThreadPool" = comdat any

$"$ct.std.thread.threadpool.QueueItem" = comdat any

$"$ct.ulong" = comdat any

$"$ct.fault" = comdat any

$"$sel.acquire" = comdat any

$std.thread.THREAD_QUEUE_FULL = comdat any

@"$ct.std.thread.threadpool.FixedThreadPool" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 80, i64 0, i64 7, [0 x i64] zeroinitializer }, comdat, align 8

!0 = !{i32 1, !"CodeView", i32 1}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 2}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 2}
!5 = !{i32 1, !"MaxTLSAlign", i32 65536}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!7 = !DIFile(filename: "fixed_pool.c3", directory: "C:/Compilers/C3/lib/std/threads")
!8 = distinct !DISubprogram(name: "init", linkageName: "std.thread.threadpool.FixedThreadPool.init", scope: !7, file: !7, line: 37, type: !9, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !71)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !13, !14, !50, !50}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !12)
!12 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "FixedThreadPool*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedThreadPool", scope: !7, file: !7, line: 11, size: 640, align: 64, elements: !16, identifier: "std.thread.threadpool.FixedThreadPool")
!16 = !{!17, !27, !53, !54, !55, !57, !65}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !15, file: !7, line: 13, baseType: !18, size: 128, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mutex", scope: !7, file: !7, line: 11, baseType: !19, align: 8)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "NativeMutex", scope: !7, file: !7, line: 6, size: 128, align: 64, elements: !20, identifier: "std.thread.os.NativeMutex")
!20 = !{!21, !23, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "srw_lock", scope: !19, file: !7, line: 8, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_SRWLOCK", scope: !7, file: !7, line: 194, baseType: !13, align: 8)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !19, file: !7, line: 9, baseType: !24, size: 32, align: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_DWORD", scope: !7, file: !7, line: 9, baseType: !25, align: 4)
!25 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, scope: !19, file: !7, line: 10, baseType: !25, size: 32, align: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !15, file: !7, line: 14, baseType: !28, size: 128, align: 64, offset: 128)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem[]", size: 128, align: 64, elements: !29, identifier: "QueueItem[]")
!29 = !{!30, !52}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !28, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "QueueItem*", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem", scope: !7, file: !7, line: 26, size: 192, align: 64, elements: !33, identifier: "std.thread.threadpool.QueueItem")
!33 = !{!34, !51}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !32, file: !7, line: 28, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadPoolFn", scope: !7, file: !7, line: 9, baseType: !36, align: 8)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ThreadPoolFn", baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !39}
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !40, identifier: "any[]")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !39, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !44, identifier: "any")
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !43, baseType: !13, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !43, baseType: !47, size: 64, align: 64, offset: 64)
!47 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !39, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !50)
!50 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !32, file: !7, line: 29, baseType: !39, size: 128, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !28, baseType: !49, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "qindex", scope: !15, file: !7, line: 15, baseType: !49, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads", scope: !15, file: !7, line: 16, baseType: !49, size: 64, align: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, scope: !15, file: !7, line: 17, baseType: !56, size: 8, align: 8, offset: 384)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !15, file: !7, line: 22, baseType: !58, size: 128, align: 64, offset: 448)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread[]", size: 128, align: 64, elements: !59, identifier: "Thread[]")
!59 = !{!60, !64}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !58, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Thread*", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "Thread", scope: !7, file: !7, line: 16, baseType: !63, align: 8)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "NativeThread", scope: !7, file: !7, line: 4, baseType: !13, align: 8)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !58, baseType: !49, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !15, file: !7, line: 23, baseType: !66, size: 64, align: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConditionVariable", scope: !7, file: !7, line: 15, baseType: !67, align: 8)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "NativeConditionVariable", scope: !7, file: !7, line: 31, size: 64, align: 64, elements: !68, identifier: "std.thread.os.NativeConditionVariable")
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "cond_var", scope: !67, file: !7, line: 33, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_CONDITION_VARIABLE", scope: !7, file: !7, line: 193, baseType: !13, align: 8)
!71 = !{}
!72 = !DILocation(line: 38, scope: !8)
!73 = !DILocalVariable(name: "self", arg: 1, scope: !8, file: !7, line: 37, type: !14)
!74 = !DILocation(line: 37, scope: !8)
!75 = !DILocalVariable(name: "threads", arg: 2, scope: !8, file: !7, line: 37, type: !49)
!76 = !DILocalVariable(name: "queue_size", arg: 3, scope: !8, file: !7, line: 37, type: !49)
!77 = !DILocation(line: 33, scope: !78)
!78 = distinct !DILexicalBlock(scope: !8, file: !7, line: 38, column: 1)
!79 = !DILocation(line: 34, scope: !78)
!80 = !DILocation(line: 35, scope: !78)
!81 = !DILocation(line: 39, scope: !8)
!82 = !DILocation(line: 41, scope: !8)
!83 = !DILocation(line: 43, scope: !8)
!84 = !DILocation(line: 44, scope: !8)
!85 = !DILocation(line: 865, scope: !86, inlinedAt: !88)
!86 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !87, file: !87, line: 863, scopeLine: 863, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!87 = !DIFile(filename: "mem.c3", directory: "C:/Compilers/C3/lib/std/core")
!88 = !DILocation(line: 45, scope: !8)
!89 = !DILocation(line: 304, scope: !90, inlinedAt: !92)
!90 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !91, file: !91, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!91 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Compilers/C3/lib/std/core")
!92 = !DILocation(line: 287, scope: !93, inlinedAt: !85)
!93 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !91, file: !91, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!94 = !DILocation(line: 80, scope: !95, inlinedAt: !89)
!95 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !91, file: !91, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!96 = !DILocation(line: 86, scope: !95, inlinedAt: !89)
!97 = !DILocation(line: 38, scope: !95, inlinedAt: !89)
!98 = !DILocation(line: 975, scope: !99, inlinedAt: !97)
!99 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !100, file: !100, line: 973, scopeLine: 973, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!100 = !DIFile(filename: "math.c3", directory: "C:/Compilers/C3/lib/std/math")
!101 = !DILocation(line: 848, scope: !102, inlinedAt: !103)
!102 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !87, file: !87, line: 846, scopeLine: 846, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!103 = !DILocation(line: 46, scope: !8)
!104 = !DILocation(line: 270, scope: !105, inlinedAt: !106)
!105 = distinct !DISubprogram(name: "new_array_try", linkageName: "new_array_try", scope: !91, file: !91, line: 268, scopeLine: 268, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!106 = !DILocation(line: 262, scope: !107, inlinedAt: !101)
!107 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !91, file: !91, line: 260, scopeLine: 260, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!108 = !DILocation(line: 97, scope: !109, inlinedAt: !104)
