; ModuleID = 'std::core::mem'
source_filename = "std::core::mem"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%Win32_SYSTEM_INFO = type { %.anon, i32, ptr, ptr, i64, i32, i32, i32, i16, i16 }
%.anon = type { i32 }
%"any[]" = type { ptr, i64 }

$std.core.mem.os_pagesize = comdat any

$std.core.mem.aligned_offset = comdat any

$std.core.mem.ptr_is_aligned = comdat any

$std.core.mem.ptr_is_page_aligned = comdat any

$std.core.mem.temp_push = comdat any

$std.core.mem.temp_pop = comdat any

$std.core.mem.malloc = comdat any

$std.core.mem.malloc_aligned = comdat any

$std.core.mem.tmalloc = comdat any

$std.core.mem.calloc = comdat any

$std.core.mem.calloc_aligned = comdat any

$std.core.mem.tcalloc = comdat any

$std.core.mem.realloc = comdat any

$std.core.mem.realloc_aligned = comdat any

$std.core.mem.free = comdat any

$std.core.mem.free_aligned = comdat any

$std.core.mem.trealloc = comdat any

$.dyn_search = comdat any

$"$ct.int" = comdat any

$"$ct.std.core.mem.AtomicOrdering" = comdat any

$std.core.mem.MAX_MEMORY_ALIGNMENT = comdat any

$std.core.mem.DEFAULT_MEM_ALIGNMENT = comdat any

$std.core.mem.KB = comdat any

$std.core.mem.MB = comdat any

$std.core.mem.GB = comdat any

$std.core.mem.TB = comdat any

$"$sel.acquire" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "MAX_MEMORY_ALIGNMENT", linkageName: "std.core.mem.MAX_MEMORY_ALIGNMENT", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "mem.c3", directory: "C:/Compilers/C3/lib/std/core")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "DEFAULT_MEM_ALIGNMENT", linkageName: "std.core.mem.DEFAULT_MEM_ALIGNMENT", scope: !2, file: !2, line: 10, type: !6, isLocal: false, isDefinition: true, align: 8)
!6 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "KB", linkageName: "std.core.mem.KB", scope: !2, file: !2, line: 11, type: !9, isLocal: false, isDefinition: true, align: 8)
!9 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "MB", linkageName: "std.core.mem.MB", scope: !2, file: !2, line: 12, type: !9, isLocal: false, isDefinition: true, align: 8)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "GB", linkageName: "std.core.mem.GB", scope: !2, file: !2, line: 13, type: !9, isLocal: false, isDefinition: true, align: 8)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "TB", linkageName: "std.core.mem.TB", scope: !2, file: !2, line: 14, type: !9, isLocal: false, isDefinition: true, align: 8)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "pagesize", linkageName: "os_pagesize.pagesize", scope: !2, file: !2, line: 31, type: !18, isLocal: true, isDefinition: true, align: 8)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !9)
!19 = !{i32 1, !"CodeView", i32 1}
!20 = !{i32 2, !"Debug Info Version", i32 3}
!21 = !{i32 2, !"wchar_size", i32 2}
!22 = !{i32 4, !"PIC Level", i32 2}
!23 = !{i32 1, !"uwtable", i32 2}
!24 = !{i32 1, !"MaxTLSAlign", i32 65536}
!25 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !26, splitDebugInlining: false)
!26 = !{!0, !4, !7, !10, !12, !14, !16}
!27 = distinct !DISubprogram(name: "os_pagesize", linkageName: "std.core.mem.os_pagesize", scope: !2, file: !2, line: 23, type: !28, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !30)
!28 = !DISubroutineType(types: !29)
!29 = !{!18}
!30 = !{}
!31 = !DILocation(line: 32, scope: !27)
!32 = !DILocalVariable(name: "info", scope: !27, file: !2, line: 33, type: !33, align: 8)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_SYSTEM_INFO", scope: !2, file: !2, line: 274, size: 384, align: 64, elements: !34, identifier: "std.os.win32.Win32_SYSTEM_INFO")
!34 = !{!35, !47, !48, !51, !52, !54, !55, !56, !57, !58}
!35 = !DIDerivedType(tag: DW_TAG_member, scope: !33, file: !2, line: 276, baseType: !36, size: 32, align: 32)
!36 = !DICompositeType(tag: DW_TAG_union_type, scope: !33, file: !2, line: 276, size: 32, align: 32, elements: !37)
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "dwOemId", scope: !36, file: !2, line: 278, baseType: !39, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_DWORD", scope: !2, file: !2, line: 9, baseType: !3, align: 4)
!40 = !DIDerivedType(tag: DW_TAG_member, scope: !36, file: !2, line: 279, baseType: !41, size: 32, align: 32)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !36, file: !2, line: 279, size: 32, align: 32, elements: !42)
!42 = !{!43, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "wProcessorArchitecture", scope: !41, file: !2, line: 281, baseType: !44, size: 16, align: 16)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_WORD", scope: !2, file: !2, line: 170, baseType: !45, align: 2)
!45 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "wReserved", scope: !41, file: !2, line: 282, baseType: !44, size: 16, align: 16, offset: 16)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "dwPageSize", scope: !33, file: !2, line: 285, baseType: !39, size: 32, align: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "lpMinimumApplicationAddress", scope: !33, file: !2, line: 286, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LPVOID", scope: !2, file: !2, line: 80, baseType: !50, align: 8)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "lpMaximumApplicationAddress", scope: !33, file: !2, line: 287, baseType: !49, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "dwActiveProcessorMask", scope: !33, file: !2, line: 288, baseType: !53, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_DWORD_PTR", scope: !2, file: !2, line: 11, baseType: !9, align: 8)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "dwNumberOfProcessors", scope: !33, file: !2, line: 289, baseType: !39, size: 32, align: 32, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "dwProcessorType", scope: !33, file: !2, line: 290, baseType: !39, size: 32, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "dwAllocationGranularity", scope: !33, file: !2, line: 291, baseType: !39, size: 32, align: 32, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "wProcessorLevel", scope: !33, file: !2, line: 292, baseType: !44, size: 16, align: 16, offset: 352)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "wProcessorRevision", scope: !33, file: !2, line: 293, baseType: !44, size: 16, align: 16, offset: 368)
!59 = !DILocation(line: 33, scope: !27)
!60 = !DILocation(line: 34, scope: !27)
!61 = !DILocation(line: 35, scope: !27)
!62 = distinct !DISubprogram(name: "aligned_offset", linkageName: "std.core.mem.aligned_offset", scope: !2, file: !2, line: 306, type: !63, scopeLine: 306, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !30)
!63 = !DISubroutineType(types: !64)
!64 = !{!18, !9, !9}
!65 = !DILocalVariable(name: "offset", arg: 1, scope: !62, file: !2, line: 306, type: !18)
!66 = !DILocation(line: 306, scope: !62)
!67 = !DILocalVariable(name: "alignment", arg: 2, scope: !62, file: !2, line: 306, type: !18)
!68 = !DILocation(line: 975, scope: !69, inlinedAt: !71)
!69 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !70, file: !70, line: 973, scopeLine: 973, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!70 = !DIFile(filename: "math.c3", directory: "C:/Compilers/C3/lib/std/math")
!71 = !DILocation(line: 304, scope: !72)
!72 = distinct !DILexicalBlock(scope: !62, file: !2, line: 307, column: 1)
!73 = !DILocation(line: 308, scope: !62)
!74 = distinct !DISubprogram(name: "ptr_is_aligned", linkageName: "std.core.mem.ptr_is_aligned", scope: !2, file: !2, line: 319, type: !75, scopeLine: 319, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !30)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !50, !9}
!77 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!78 = !DILocalVariable(name: "ptr", arg: 1, scope: !74, file: !2, line: 319, type: !50)
!79 = !DILocation(line: 319, scope: !74)
!80 = !DILocalVariable(name: "alignment", arg: 2, scope: !74, file: !2, line: 319, type: !18)
!81 = !DILocation(line: 975, scope: !82, inlinedAt: !83)
!82 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !70, file: !70, line: 973, scopeLine: 973, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!83 = !DILocation(line: 317, scope: !84)
!84 = distinct !DILexicalBlock(scope: !74, file: !2, line: 320, column: 1)
!85 = !DILocation(line: 321, scope: !74)
!86 = distinct !DISubprogram(name: "ptr_is_page_aligned", linkageName: "std.core.mem.ptr_is_page_aligned", scope: !2, file: !2, line: 324, type: !87, scopeLine: 324, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !30)
!87 = !DISubroutineType(types: !88)
!88 = !{!77, !50}
!89 = !DILocalVariable(name: "ptr", arg: 1, scope: !86, file: !2, line: 324, type: !50)
!90 = !DILocation(line: 324, scope: !86)
!91 = !DILocation(line: 326, scope: !86)
!92 = distinct !DISubprogram(name: "temp_push", linkageName: "std.core.mem.temp_push", scope: !2, file: !2, line: 594, type: !93, scopeLine: 594, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25)
!93 = !DISubroutineType(types: !94)
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 403, baseType: !96, align: 8)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !98, identifier: "std.core.mem.allocator.TempAllocator")
!98 = !{!99, !105, !118, !119, !120, !121, !122, !123, !124, !125, !126}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !97, file: !2, line: 33, baseType: !100, size: 128, align: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !101, identifier: "Allocator")
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !100, baseType: !50, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, baseType: !104, size: 64, align: 64, offset: 64)
!104 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !97, file: !2, line: 34, baseType: !106, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !107, size: 64, align: 64, dwarfAddressSpace: 0)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !108, identifier: "std.core.mem.allocator.TempAllocatorPage")
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !107, file: !2, line: 56, baseType: !106, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !107, file: !2, line: 57, baseType: !50, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !107, file: !2, line: 58, baseType: !18, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !107, file: !2, line: 59, baseType: !18, size: 64, align: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !107, file: !2, line: 60, baseType: !114, align: 8, offset: 256)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, align: 8, elements: !116)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !{!117}
!117 = !DISubrange(count: 0, lowerBound: 0)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !97, file: !2, line: 35, baseType: !96, size: 64, align: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !97, file: !2, line: 36, baseType: !77, size: 8, align: 8, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !97, file: !2, line: 37, baseType: !18, size: 64, align: 64, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !97, file: !2, line: 38, baseType: !18, size: 64, align: 64, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !97, file: !2, line: 39, baseType: !18, size: 64, align: 64, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !97, file: !2, line: 40, baseType: !18, size: 64, align: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !97, file: !2, line: 41, baseType: !18, size: 64, align: 64, offset: 576)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !97, file: !2, line: 42, baseType: !18, size: 64, align: 64, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !97, file: !2, line: 43, baseType: !114, align: 8, offset: 704)
!127 = !DILocation(line: 596, scope: !92)
!128 = distinct !DISubprogram(name: "temp_pop", linkageName: "std.core.mem.temp_pop", scope: !2, file: !2, line: 602, type: !129, scopeLine: 602, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !30)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !95}
!131 = !DILocalVariable(name: "old_state", arg: 1, scope: !128, file: !2, line: 602, type: !95)
!132 = !DILocation(line: 602, scope: !128)
!133 = !DILocation(line: 604, scope: !128)
!134 = distinct !DISubprogram(name: "malloc", linkageName: "std.core.mem.malloc", scope: !2, file: !2, line: 709, type: !135, scopeLine: 709, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !30)
!135 = !DISubroutineType(types: !136)
!136 = !{!50, !9}
!137 = !DILocalVariable(name: "size", arg: 1, scope: !134, file: !2, line: 709, type: !18)
!138 = !DILocation(line: 709, scope: !134)
!139 = !DILocation(line: 711, scope: !134)
!140 = !DILocation(line: 80, scope: !141, inlinedAt: !143)
!141 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !142, file: !142, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!142 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Compilers/C3/lib/std/core")
!143 = !DILocation(line: 75, scope: !144, inlinedAt: !139)
!144 = distinct !DISubprogram(name: "malloc", linkageName: "malloc", scope: !142, file: !142, line: 73, scopeLine: 73, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!145 = !DILocation(line: 86, scope: !141, inlinedAt: !143)
!146 = !DILocation(line: 38, scope: !141, inlinedAt: !143)
!147 = !DILocation(line: 975, scope: !148, inlinedAt: !146)
!148 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !70, file: !70, line: 973, scopeLine: 973, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!149 = distinct !DISubprogram(name: "malloc_aligned", linkageName: "std.core.mem.malloc_aligned", scope: !2, file: !2, line: 718, type: !150, scopeLine: 718, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !30)
!150 = !DISubroutineType(types: !151)
!151 = !{!50, !9, !9}
!152 = !DILocalVariable(name: "size", arg: 1, scope: !149, file: !2, line: 718, type: !18)
!153 = !DILocation(line: 718, scope: !149)
!154 = !DILocalVariable(name: "alignment", arg: 2, scope: !149, file: !2, line: 718, type: !18)
!155 = !DILocation(line: 720, scope: !149)
!156 = !DILocation(line: 128, scope: !157, inlinedAt: !155)
!157 = distinct !DISubprogram(name: "malloc_aligned", linkageName: "malloc_aligned", scope: !142, file: !142, line: 126, scopeLine: 126, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!158 = !DILocation(line: 134, scope: !157, inlinedAt: !155)
!159 = !DILocation(line: 38, scope: !157, inlinedAt: !155)
!160 = !DILocation(line: 975, scope: !161, inlinedAt: !159)
!161 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !70, file: !70, line: 973, scopeLine: 973, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!162 = distinct !DISubprogram(name: "tmalloc", linkageName: "std.core.mem.tmalloc", scope: !2, file: !2, line: 723, type: !150, scopeLine: 723, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !30)
!163 = !DILocalVariable(name: "size", arg: 1, scope: !162, file: !2, line: 723, type: !18)
!164 = !DILocation(line: 723, scope: !162)
!165 = !DILocalVariable(name: "alignment", arg: 2, scope: !162, file: !2, line: 723, type: !18)
!166 = !DILocation(line: 725, scope: !162)
!167 = !DILocation(line: 726, scope: !162)
!168 = !DILocation(line: 38, scope: !162)
!169 = !DILocation(line: 975, scope: !170, inlinedAt: !168)
