; ModuleID = 'std::hash::md5'
source_filename = "std::hash::md5"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Md5 = type { i32, i32, i32, i32, i32, i32, [64 x i8], [16 x i32] }

$std.hash.md5.Md5.init = comdat any

$std.hash.md5.Md5.update = comdat any

$std.hash.md5.Md5.final = comdat any

$std.hash.md5.hash = comdat any

$"$ct.std.hash.md5.Md5" = comdat any

$std.hash.md5.BLOCK_BYTES = comdat any

$std.hash.md5.HASH_BYTES = comdat any

$"$ct.ulong" = comdat any

$"$ct.long" = comdat any

$"$ct.uint" = comdat any

@"$ct.std.hash.md5.Md5" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 152, i64 0, i64 8, [0 x i64] zeroinitializer }, comdat, align 8
@std.hash.md5.BLOCK_BYTES = weak_odr local_unnamed_addr constant i32 64, comdat, align 4, !dbg !0
@std.hash.md5.HASH_BYTES = weak_odr local_unnamed_addr constant i32 16, comdat, align 4, !dbg !4
@.panic_msg = internal constant [63 x i8] c"Reference parameter 'self' was passed a null pointer argument.\00", align 1
@.file = internal constant [7 x i8] c"md5.c3\00", align 1
@.func = internal constant [5 x i8] c"init\00", align 1
@std.core.builtin.panic = external global ptr, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BLOCK_BYTES", linkageName: "std.hash.md5.BLOCK_BYTES", scope: !2, file: !2, line: 5, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "md5.c3", directory: "C:/Compilers/C3/lib/std/hash")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "HASH_BYTES", linkageName: "std.hash.md5.HASH_BYTES", scope: !2, file: !2, line: 6, type: !3, isLocal: false, isDefinition: true, align: 4)
!6 = !{i32 1, !"CodeView", i32 1}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 2, !"wchar_size", i32 2}
!9 = !{i32 4, !"PIC Level", i32 2}
!10 = !{i32 1, !"uwtable", i32 2}
!11 = !{i32 1, !"MaxTLSAlign", i32 65536}
!12 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !13, splitDebugInlining: false)
!13 = !{!0, !4}
!14 = distinct !DISubprogram(name: "init", linkageName: "std.hash.md5.Md5.init", scope: !2, file: !2, line: 28, type: !15, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !36)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Md5*", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "Md5", scope: !2, file: !2, line: 8, size: 1216, align: 32, elements: !19, identifier: "std.hash.md5.Md5")
!19 = !{!20, !22, !23, !24, !25, !26, !27, !32}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !18, file: !2, line: 10, baseType: !21, size: 32, align: 32)
!21 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !18, file: !2, line: 10, baseType: !21, size: 32, align: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !18, file: !2, line: 11, baseType: !21, size: 32, align: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !18, file: !2, line: 11, baseType: !21, size: 32, align: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !18, file: !2, line: 11, baseType: !21, size: 32, align: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !18, file: !2, line: 11, baseType: !21, size: 32, align: 32, offset: 160)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !18, file: !2, line: 12, baseType: !28, size: 512, align: 8, offset: 192)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, align: 8, elements: !30)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !{!31}
!31 = !DISubrange(count: 64, lowerBound: 0)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !18, file: !2, line: 13, baseType: !33, size: 512, align: 32, offset: 704)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, align: 32, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 16, lowerBound: 0)
!36 = !{}
!37 = !DILocation(line: 29, scope: !14)
!38 = !DILocalVariable(name: "self", arg: 1, scope: !14, file: !2, line: 28, type: !17)
!39 = !DILocation(line: 28, scope: !14)
!40 = !DILocation(line: 30, scope: !14)
!41 = !DILocation(line: 31, scope: !14)
!42 = !DILocation(line: 32, scope: !14)
!43 = !DILocation(line: 33, scope: !14)
!44 = !DILocation(line: 35, scope: !14)
!45 = !DILocation(line: 36, scope: !14)
!46 = distinct !DISubprogram(name: "update", linkageName: "std.hash.md5.Md5.update", scope: !2, file: !2, line: 40, type: !47, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !36)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !17, !49}
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !50, identifier: "char[]")
!50 = !{!51, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !49, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, baseType: !54, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !55)
!55 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!56 = !DILocation(line: 41, scope: !46)
!57 = !DILocalVariable(name: "ctx", arg: 1, scope: !46, file: !2, line: 40, type: !17)
!58 = !DILocation(line: 40, scope: !46)
!59 = !DILocalVariable(name: "data", arg: 2, scope: !46, file: !2, line: 40, type: !49)
!60 = !DILocalVariable(name: "saved_lo", scope: !46, file: !2, line: 42, type: !21, align: 4)
!61 = !DILocation(line: 42, scope: !46)
!62 = !DILocation(line: 43, scope: !46)
!63 = !DILocation(line: 44, scope: !46)
!64 = !DILocalVariable(name: "used", scope: !46, file: !2, line: 46, type: !54, align: 8)
!65 = !DILocation(line: 46, scope: !46)
!66 = !DILocation(line: 48, scope: !46)
!67 = !DILocalVariable(name: "available", scope: !68, file: !2, line: 50, type: !54, align: 8)
!68 = distinct !DILexicalBlock(scope: !46, file: !2, line: 49, column: 2)
!69 = !DILocation(line: 50, scope: !68)
!70 = !DILocation(line: 52, scope: !68)
!71 = !DILocation(line: 54, scope: !72)
!72 = distinct !DILexicalBlock(scope: !68, file: !2, line: 53, column: 3)
!73 = !DILocation(line: 55, scope: !72)
!74 = !DILocation(line: 57, scope: !68)
!75 = !DILocation(line: 58, scope: !68)
!76 = !DILocation(line: 59, scope: !68)
!77 = !DILocation(line: 62, scope: !46)
!78 = !DILocation(line: 64, scope: !79)
!79 = distinct !DILexicalBlock(scope: !46, file: !2, line: 63, column: 2)
!80 = !DILocation(line: 66, scope: !46)
!81 = distinct !DISubprogram(name: "final", linkageName: "std.hash.md5.Md5.final", scope: !2, file: !2, line: 69, type: !82, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !36)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !17}
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 128, align: 8, elements: !34)
!85 = !DILocation(line: 70, scope: !81)
!86 = !DILocalVariable(name: "ctx", arg: 1, scope: !81, file: !2, line: 69, type: !17)
!87 = !DILocation(line: 69, scope: !81)
!88 = !DILocalVariable(name: "used", scope: !81, file: !2, line: 71, type: !54, align: 8)
!89 = !DILocation(line: 71, scope: !81)
!90 = !DILocation(line: 72, scope: !81)
!91 = !DILocalVariable(name: "available", scope: !81, file: !2, line: 74, type: !54, align: 8)
!92 = !DILocation(line: 74, scope: !81)
!93 = !DILocation(line: 76, scope: !81)
!94 = !DILocation(line: 78, scope: !95)
!95 = distinct !DILexicalBlock(scope: !81, file: !2, line: 77, column: 2)
!96 = !DILocation(line: 79, scope: !95)
!97 = !DILocation(line: 80, scope: !95)
!98 = !DILocation(line: 81, scope: !95)
!99 = !DILocation(line: 83, scope: !81)
!100 = !DILocation(line: 85, scope: !81)
!101 = !DILocation(line: 86, scope: !81)
!102 = !DILocation(line: 281, scope: !103, inlinedAt: !101)
!103 = distinct !DISubprogram(name: "bitcast", linkageName: "bitcast", scope: !104, file: !104, line: 278, scopeLine: 278, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12)
!104 = !DIFile(filename: "builtin.c3", directory: "C:/Compilers/C3/lib/std/core")
!105 = !DILocation(line: 87, scope: !81)
!106 = !DILocation(line: 281, scope: !107, inlinedAt: !105)
!107 = distinct !DISubprogram(name: "bitcast", linkageName: "bitcast", scope: !104, file: !104, line: 278, scopeLine: 278, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12)
!108 = !DILocation(line: 89, scope: !81)
!109 = !DILocalVariable(name: "res", scope: !81, file: !2, line: 91, type: !84, align: 16)
!110 = !DILocation(line: 91, scope: !81)
!111 = !DILocation(line: 92, scope: !81)
!112 = !DILocation(line: 281, scope: !113, inlinedAt: !111)
!113 = distinct !DISubprogram(name: "bitcast", linkageName: "bitcast", scope: !104, file: !104, line: 278, scopeLine: 278, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12)
!114 = !DILocation(line: 93, scope: !81)
