; ModuleID = 'std::os::backtrace'
source_filename = "std::os::backtrace"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Backtrace = type { i64, %"char[]", %"char[]", %"char[]", i32, %any, i8 }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"void*[]" = type { ptr, i64 }

$std.os.backtrace.Backtrace.has_file = comdat any

$std.os.backtrace.Backtrace.is_unknown = comdat any

$std.os.backtrace.Backtrace.to_format = comdat any

$std.os.backtrace.Backtrace.free = comdat any

$std.os.backtrace.Backtrace.init = comdat any

$std.os.backtrace.capture_current = comdat any

$.dyn_search = comdat any

$"$ct.std.os.backtrace.Backtrace" = comdat any

$"$ct.void" = comdat any

$std.os.backtrace.BACKTRACE_UNKNOWN = comdat any

$"$ct.long" = comdat any

$"$ct.ulong" = comdat any

$"$ct.String" = comdat any

$"$ct.sa$char" = comdat any

$"$ct.char" = comdat any

$"$ct.uint" = comdat any

$"$sel.release" = comdat any

$"$ct.dyn.std.os.backtrace.Backtrace.to_format" = comdat any

$"$sel.to_format" = comdat any

@"$ct.std.os.backtrace.Backtrace" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 88, i64 0, i64 7, [0 x i64] zeroinitializer }, comdat, align 8
@.emptystr = internal constant [1 x i8] zeroinitializer, align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BACKTRACE_UNKNOWN", linkageName: "std.os.backtrace.BACKTRACE_UNKNOWN", scope: !2, file: !2, line: 7, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "backtrace.c3", directory: "C:/Compilers/C3/lib/std/os")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 9, size: 704, align: 64, elements: !4, identifier: "std.os.backtrace.Backtrace")
!4 = !{!5, !8, !17, !18, !19, !21, !28}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3, file: !2, line: 11, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !7)
!7 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !3, file: !2, line: 12, baseType: !9, size: 128, align: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !10)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !11, identifier: "char[]")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !10, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !10, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !7)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !3, file: !2, line: 13, baseType: !9, size: 128, align: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !3, file: !2, line: 14, baseType: !9, size: 128, align: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !3, file: !2, line: 15, baseType: !20, size: 32, align: 32, offset: 448)
!20 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 16, baseType: !22, size: 128, align: 64, offset: 512)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !23, identifier: "Allocator")
!23 = !{!24, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !3, file: !2, line: 17, baseType: !29, size: 8, align: 8, offset: 640)
!29 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!30 = !{i32 1, !"CodeView", i32 1}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{i32 2, !"wchar_size", i32 2}
!33 = !{i32 4, !"PIC Level", i32 2}
!34 = !{i32 1, !"uwtable", i32 2}
!35 = !{i32 1, !"MaxTLSAlign", i32 65536}
!36 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !37, splitDebugInlining: false)
!37 = !{!0}
!38 = distinct !DISubprogram(name: "has_file", linkageName: "std.os.backtrace.Backtrace.has_file", scope: !2, file: !2, line: 21, type: !39, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!39 = !DISubroutineType(types: !40)
!40 = !{!29, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Backtrace*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !{}
!43 = !DILocation(line: 22, scope: !38)
!44 = !DILocalVariable(name: "self", arg: 1, scope: !38, file: !2, line: 21, type: !41)
!45 = !DILocation(line: 21, scope: !38)
!46 = !DILocation(line: 23, scope: !38)
!47 = distinct !DISubprogram(name: "is_unknown", linkageName: "std.os.backtrace.Backtrace.is_unknown", scope: !2, file: !2, line: 26, type: !39, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!48 = !DILocation(line: 27, scope: !47)
!49 = !DILocalVariable(name: "self", arg: 1, scope: !47, file: !2, line: 26, type: !41)
!50 = !DILocation(line: 26, scope: !47)
!51 = !DILocation(line: 28, scope: !47)
!52 = distinct !DISubprogram(name: "to_format", linkageName: "std.os.backtrace.Backtrace.to_format", scope: !2, file: !2, line: 31, type: !53, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !57, !41, !58}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !56)
!56 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 63, size: 320, align: 64, elements: !60, identifier: "std.io.Formatter")
!60 = !{!61, !62, !67}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !2, line: 65, baseType: !25, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !59, file: !2, line: 66, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 16, baseType: !64, align: 8)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DISubroutineType(types: !66)
!66 = !{!55, !25, !25, !14}
!67 = !DIDerivedType(tag: DW_TAG_member, scope: !59, file: !2, line: 67, baseType: !68, size: 192, align: 64, offset: 128)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !59, file: !2, line: 67, size: 192, align: 64, elements: !69)
!69 = !{!70, !71, !72, !73}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !68, file: !2, line: 69, baseType: !20, size: 32, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !68, file: !2, line: 70, baseType: !20, size: 32, align: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !68, file: !2, line: 71, baseType: !20, size: 32, align: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !68, file: !2, line: 72, baseType: !55, size: 64, align: 64, offset: 128)
!74 = !DILocation(line: 32, scope: !52)
!75 = !DILocalVariable(name: "self", arg: 1, scope: !52, file: !2, line: 31, type: !41)
!76 = !DILocation(line: 31, scope: !52)
!77 = !DILocalVariable(name: "formatter", arg: 2, scope: !52, file: !2, line: 31, type: !58)
!78 = !DILocalVariable(name: "inline_suffix", scope: !52, file: !2, line: 33, type: !9, align: 8)
!79 = !DILocation(line: 33, scope: !52)
!80 = !DILocation(line: 34, scope: !52)
!81 = !DILocation(line: 36, scope: !82)
!82 = distinct !DILexicalBlock(scope: !52, file: !2, line: 35, column: 2)
!83 = !DILocation(line: 38, scope: !52)
!84 = !DILocation(line: 40, scope: !85)
!85 = distinct !DILexicalBlock(scope: !52, file: !2, line: 39, column: 2)
!86 = !DILocation(line: 42, scope: !52)
!87 = distinct !DISubprogram(name: "free", linkageName: "std.os.backtrace.Backtrace.free", scope: !2, file: !2, line: 44, type: !88, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !41}
!90 = !DILocation(line: 45, scope: !87)
!91 = !DILocalVariable(name: "self", arg: 1, scope: !87, file: !2, line: 44, type: !41)
!92 = !DILocation(line: 44, scope: !87)
!93 = !DILocation(line: 46, scope: !87)
!94 = !DILocation(line: 47, scope: !87)
!95 = !DILocation(line: 119, scope: !96, inlinedAt: !94)
!96 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !97, file: !97, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!97 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Compilers/C3/lib/std/core")
!98 = !DILocation(line: 123, scope: !96, inlinedAt: !94)
!99 = !DILocation(line: 48, scope: !87)
!100 = !DILocation(line: 119, scope: !101, inlinedAt: !99)
!101 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !97, file: !97, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!102 = !DILocation(line: 123, scope: !101, inlinedAt: !99)
!103 = !DILocation(line: 49, scope: !87)
!104 = !DILocation(line: 119, scope: !105, inlinedAt: !103)
!105 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !97, file: !97, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!106 = !DILocation(line: 123, scope: !105, inlinedAt: !103)
!107 = distinct !DISubprogram(name: "init", linkageName: "std.os.backtrace.Backtrace.init", scope: !2, file: !2, line: 52, type: !108, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!108 = !DISubroutineType(types: !109)
!109 = !{!41, !41, !22, !7, !9, !9, !9, !20}
!110 = !DILocation(line: 53, scope: !107)
!111 = !DILocalVariable(name: "self", arg: 1, scope: !107, file: !2, line: 52, type: !41)
!112 = !DILocation(line: 52, scope: !107)
!113 = !DILocalVariable(name: "allocator", arg: 2, scope: !107, file: !2, line: 52, type: !22)
!114 = !DILocalVariable(name: "offset", arg: 3, scope: !107, file: !2, line: 52, type: !6)
!115 = !DILocalVariable(name: "function", arg: 4, scope: !107, file: !2, line: 52, type: !9)
!116 = !DILocalVariable(name: "object_file", arg: 5, scope: !107, file: !2, line: 52, type: !9)
!117 = !DILocalVariable(name: "file", arg: 6, scope: !107, file: !2, line: 52, type: !9)
!118 = !DILocalVariable(name: "line", arg: 7, scope: !107, file: !2, line: 52, type: !20)
!119 = !DILocation(line: 54, scope: !107)
!120 = !DILocation(line: 56, scope: !121)
!121 = distinct !DILexicalBlock(scope: !107, file: !2, line: 55, column: 2)
!122 = !DILocation(line: 57, scope: !121)
!123 = !DILocation(line: 58, scope: !121)
!124 = !DILocation(line: 59, scope: !121)
!125 = !DILocation(line: 60, scope: !121)
!126 = !DILocation(line: 61, scope: !121)
!127 = !DILocation(line: 62, scope: !121)
!128 = !DILocation(line: 64, scope: !107)
!129 = !DILocation(line: 65, scope: !107)
!130 = !DILocation(line: 66, scope: !107)
!131 = !DILocation(line: 67, scope: !107)
!132 = !DILocation(line: 68, scope: !107)
!133 = !DILocation(line: 69, scope: !107)
!134 = !DILocation(line: 70, scope: !107)
!135 = distinct !DISubprogram(name: "capture_current", linkageName: "std.os.backtrace.capture_current", scope: !2, file: !2, line: 73, type: !136, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !138}
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !139, identifier: "void*[]")
!139 = !{!140, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !138, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !138, baseType: !16, size: 64, align: 64, offset: 64)
!143 = !DILocalVariable(name: "buffer", arg: 1, scope: !135, file: !2, line: 73, type: !138)
!144 = !DILocation(line: 73, scope: !135)
!145 = !DILocation(line: 75, scope: !135)
!146 = !DILocalVariable(name: "len", scope: !135, file: !2, line: 81, type: !147, align: 2)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_WORD", scope: !2, file: !2, line: 170, baseType: !148, align: 2)
!148 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!149 = !DILocation(line: 81, scope: !135)
!150 = !DILocation(line: 82, scope: !135)
