; ModuleID = 'std::encoding::csv'
source_filename = "std::encoding::csv"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"char[][]" = type { ptr, i64 }
%CsvRow = type { %"char[][]", %"char[]", %any }
%CsvReader = type { %any, %"char[]" }

$std.encoding.csv.CsvRow.to_format = comdat any

$std.encoding.csv.CsvRow.len = comdat any

$std.encoding.csv.CsvRow.get_col = comdat any

$std.encoding.csv.CsvReader.init = comdat any

$std.encoding.csv.CsvReader.read_row = comdat any

$std.encoding.csv.CsvReader.tread_row = comdat any

$std.encoding.csv.CsvRow.free = comdat any

$std.encoding.csv.CsvReader.skip_row = comdat any

$.dyn_search = comdat any

$"$ct.std.encoding.csv.CsvReader" = comdat any

$"$ct.std.encoding.csv.CsvRow" = comdat any

$"$ct.sa$String" = comdat any

$"$ct.String" = comdat any

$"$ct.sa$char" = comdat any

$"$ct.char" = comdat any

$"$ct.ulong" = comdat any

$"$sel.read_byte" = comdat any

$std.io.EOF = comdat any

$"$sel.release" = comdat any

$"$ct.void" = comdat any

$"$ct.dyn.std.encoding.csv.CsvRow.to_format" = comdat any

$"$sel.to_format" = comdat any

@"$ct.std.encoding.csv.CsvReader" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 32, i64 0, i64 2, [0 x i64] zeroinitializer }, comdat, align 8

!0 = !{i32 1, !"CodeView", i32 1}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 2}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 2}
!5 = !{i32 1, !"MaxTLSAlign", i32 65536}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!7 = !DIFile(filename: "csv.c3", directory: "C:/Compilers/C3/lib/std/encoding")
!8 = distinct !DISubprogram(name: "to_format", linkageName: "std.encoding.csv.CsvRow.to_format", scope: !7, file: !7, line: 18, type: !9, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !57)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !13, !16, !40}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !12)
!12 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !15)
!15 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CsvRow*", baseType: !17, size: 64, align: 64, dwarfAddressSpace: 0)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "CsvRow", scope: !7, file: !7, line: 11, size: 384, align: 64, elements: !18, identifier: "std.encoding.csv.CsvRow")
!18 = !{!19, !32, !33}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !17, file: !7, line: 13, baseType: !20, size: 128, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !21, identifier: "String[]")
!21 = !{!22, !31}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !20, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !26, identifier: "char[]")
!26 = !{!27, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !25, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !25, baseType: !14, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !20, baseType: !14, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !17, file: !7, line: 14, baseType: !24, size: 128, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !17, file: !7, line: 15, baseType: !34, size: 128, align: 64, offset: 256)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !35, identifier: "Allocator")
!35 = !{!36, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !34, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, baseType: !39, size: 64, align: 64, offset: 64)
!39 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !41, size: 64, align: 64, dwarfAddressSpace: 0)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !7, file: !7, line: 63, size: 320, align: 64, elements: !42, identifier: "std.io.Formatter")
!42 = !{!43, !44, !49}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !41, file: !7, line: 65, baseType: !37, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !41, file: !7, line: 66, baseType: !45, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !7, file: !7, line: 16, baseType: !46, align: 8)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!47 = !DISubroutineType(types: !48)
!48 = !{!11, !37, !37, !29}
!49 = !DIDerivedType(tag: DW_TAG_member, scope: !41, file: !7, line: 67, baseType: !50, size: 192, align: 64, offset: 128)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !41, file: !7, line: 67, size: 192, align: 64, elements: !51)
!51 = !{!52, !54, !55, !56}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !50, file: !7, line: 69, baseType: !53, size: 32, align: 32)
!53 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !50, file: !7, line: 70, baseType: !53, size: 32, align: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !50, file: !7, line: 71, baseType: !53, size: 32, align: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !50, file: !7, line: 72, baseType: !11, size: 64, align: 64, offset: 128)
!57 = !{}
!58 = !DILocation(line: 19, scope: !8)
!59 = !DILocalVariable(name: "self", arg: 1, scope: !8, file: !7, line: 18, type: !16)
!60 = !DILocation(line: 18, scope: !8)
!61 = !DILocalVariable(name: "f", arg: 2, scope: !8, file: !7, line: 18, type: !40)
!62 = !DILocation(line: 20, scope: !8)
!63 = distinct !DISubprogram(name: "len", linkageName: "std.encoding.csv.CsvRow.len", scope: !7, file: !7, line: 23, type: !64, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !57)
!64 = !DISubroutineType(types: !65)
!65 = !{!14, !16}
!66 = !DILocation(line: 24, scope: !63)
!67 = !DILocalVariable(name: "self", arg: 1, scope: !63, file: !7, line: 23, type: !16)
!68 = !DILocation(line: 23, scope: !63)
!69 = !DILocation(line: 25, scope: !63)
!70 = distinct !DISubprogram(name: "get_col", linkageName: "std.encoding.csv.CsvRow.get_col", scope: !7, file: !7, line: 31, type: !71, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !57)
!71 = !DISubroutineType(types: !72)
!72 = !{!24, !16, !15}
!73 = !DILocation(line: 32, scope: !70)
!74 = !DILocalVariable(name: "self", arg: 1, scope: !70, file: !7, line: 31, type: !16)
!75 = !DILocation(line: 31, scope: !70)
!76 = !DILocalVariable(name: "col", arg: 2, scope: !70, file: !7, line: 31, type: !14)
!77 = !DILocation(line: 29, scope: !78)
!78 = distinct !DILexicalBlock(scope: !70, file: !7, line: 32, column: 1)
!79 = !DILocation(line: 33, scope: !70)
!80 = distinct !DISubprogram(name: "init", linkageName: "std.encoding.csv.CsvReader.init", scope: !7, file: !7, line: 36, type: !81, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !57)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !83, !87, !24}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CsvReader*", baseType: !84, size: 64, align: 64, dwarfAddressSpace: 0)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "CsvReader", scope: !7, file: !7, line: 5, size: 256, align: 64, elements: !85, identifier: "std.encoding.csv.CsvReader")
!85 = !{!86, !91}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !84, file: !7, line: 7, baseType: !87, size: 128, align: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !88, identifier: "InStream")
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !87, baseType: !37, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, baseType: !39, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "separator", scope: !84, file: !7, line: 8, baseType: !24, size: 128, align: 64, offset: 128)
!92 = !DILocation(line: 37, scope: !80)
!93 = !DILocalVariable(name: "self", arg: 1, scope: !80, file: !7, line: 36, type: !83)
!94 = !DILocation(line: 36, scope: !80)
!95 = !DILocalVariable(name: "stream", arg: 2, scope: !80, file: !7, line: 36, type: !87)
!96 = !DILocalVariable(name: "separator", arg: 3, scope: !80, file: !7, line: 36, type: !24)
!97 = !DILocation(line: 38, scope: !80)
!98 = !DILocation(line: 39, scope: !80)
!99 = distinct !DISubprogram(name: "read_row", linkageName: "std.encoding.csv.CsvReader.read_row", scope: !7, file: !7, line: 44, type: !100, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !57)
!100 = !DISubroutineType(types: !101)
!101 = !{!11, !16, !84, !34}
!102 = !DILocalVariable(name: "self", arg: 1, scope: !99, file: !7, line: 44, type: !84)
!103 = !DILocation(line: 44, scope: !99)
!104 = !DILocalVariable(name: "allocator", arg: 2, scope: !99, file: !7, line: 44, type: !34)
!105 = !DILocalVariable(name: "row", scope: !99, file: !7, line: 46, type: !24, align: 8)
!106 = !DILocation(line: 46, scope: !99)
!107 = !DILocation(line: 60, scope: !108, inlinedAt: !106)
!108 = distinct !DISubprogram(name: "readline", linkageName: "readline", scope: !109, file: !109, line: 58, scopeLine: 58, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !57)
!109 = !DIFile(filename: "io.c3", directory: "C:/Compilers/C3/lib/std/io")
!110 = !DILocalVariable(name: "str", scope: !111, file: !7, line: 62, type: !112, align: 8)
!111 = distinct !DILexicalBlock(scope: !108, file: !109, line: 61, column: 2)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !7, file: !7, line: 7, baseType: !113, align: 8)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !114, size: 64, align: 64, dwarfAddressSpace: 0)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !7, file: !7, line: 8, baseType: null, align: 1)
!115 = !DILocation(line: 62, scope: !111, inlinedAt: !106)
!116 = !DILocalVariable(name: "func", scope: !117, file: !7, line: 103, type: !118, align: 8)
!117 = distinct !DISubprogram(name: "readline_to_stream", linkageName: "readline_to_stream", scope: !109, file: !109, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !57)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "read_byte", baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!119 = !DISubroutineType(types: !120)
!120 = !{!11, !28, !37}
!121 = !DILocation(line: 103, scope: !117, inlinedAt: !122)
!122 = !DILocation(line: 63, scope: !111, inlinedAt: !106)
!123 = !DILocalVariable(name: "val", scope: !117, file: !7, line: 104, type: !29, align: 1)
!124 = !DILocation(line: 104, scope: !117, inlinedAt: !122)
!125 = !DILocation(line: 113, scope: !117, inlinedAt: !122)
!126 = !DILocalVariable(name: "len", scope: !117, file: !7, line: 114, type: !14, align: 8)
!127 = !DILocation(line: 114, scope: !117, inlinedAt: !122)
!128 = !DILocation(line: 115, scope: !117, inlinedAt: !122)
!129 = !DILocation(line: 120, scope: !130, inlinedAt: !122)
!130 = distinct !DILexicalBlock(scope: !117, file: !109, line: 116, column: 2)
!131 = !DILocation(line: 122, scope: !130, inlinedAt: !122)
!132 = !DILocation(line: 124, scope: !117, inlinedAt: !122)
!133 = !DILocalVariable(name: "c", scope: !134, file: !7, line: 127, type: !29, align: 1)
!134 = distinct !DILexicalBlock(scope: !135, file: !109, line: 125, column: 2)
!135 = distinct !DILexicalBlock(scope: !117, file: !109, line: 124, column: 2)
!136 = !DILocation(line: 127, scope: !134, inlinedAt: !122)
!137 = !DILocalVariable(name: "err", scope: !134, file: !7, line: 131, type: !11, align: 8)
!138 = !DILocation(line: 131, scope: !134, inlinedAt: !122)
!139 = !DILocation(line: 133, scope: !140, inlinedAt: !122)
!140 = distinct !DILexicalBlock(scope: !134, file: !109, line: 132, column: 3)
!141 = !DILocation(line: 134, scope: !140, inlinedAt: !122)
!142 = !DILocation(line: 136, scope: !134, inlinedAt: !122)
!143 = !DILocation(line: 137, scope: !134, inlinedAt: !122)
!144 = !DILocation(line: 141, scope: !134, inlinedAt: !122)
!145 = !DILocation(line: 143, scope: !134, inlinedAt: !122)
!146 = !DILocation(line: 145, scope: !117, inlinedAt: !122)
!147 = !DILocation(line: 64, scope: !111, inlinedAt: !106)
!148 = !DILocalVariable(name: "state", scope: !149, file: !7, line: 641, type: !151, align: 8)
!149 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !150, file: !150, line: 639, scopeLine: 639, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !57)
!150 = !DIFile(filename: "mem.c3", directory: "C:/Compilers/C3/lib/std/core")
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !7, file: !7, line: 403, baseType: !152, align: 8)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !153, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !7, file: !7, line: 31, size: 704, align: 64, elements: !154, identifier: "std.core.mem.allocator.TempAllocator")
!154 = !{!155, !156, !168, !169, !171, !172, !173, !174, !175, !176, !177}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !153, file: !7, line: 33, baseType: !34, size: 128, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !153, file: !7, line: 34, baseType: !157, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !158, size: 64, align: 64, dwarfAddressSpace: 0)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !7, file: !7, line: 54, size: 256, align: 64, elements: !159, identifier: "std.core.mem.allocator.TempAllocatorPage")
!159 = !{!160, !161, !162, !163, !164}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !158, file: !7, line: 56, baseType: !157, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !158, file: !7, line: 57, baseType: !37, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !158, file: !7, line: 58, baseType: !14, size: 64, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !158, file: !7, line: 59, baseType: !14, size: 64, align: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !158, file: !7, line: 60, baseType: !165, align: 8, offset: 256)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, align: 8, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 0, lowerBound: 0)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !153, file: !7, line: 35, baseType: !152, size: 64, align: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !153, file: !7, line: 36, baseType: !170, size: 8, align: 8, offset: 256)
!170 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !153, file: !7, line: 37, baseType: !14, size: 64, align: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !153, file: !7, line: 38, baseType: !14, size: 64, align: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !153, file: !7, line: 39, baseType: !14, size: 64, align: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !153, file: !7, line: 40, baseType: !14, size: 64, align: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !153, file: !7, line: 41, baseType: !14, size: 64, align: 64, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !153, file: !7, line: 42, baseType: !14, size: 64, align: 64, offset: 640)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !7, line: 43, baseType: !165, align: 8, offset: 704)
!178 = !DILocation(line: 641, scope: !149, inlinedAt: !179)
!179 = !DILocation(line: 66, scope: !108, inlinedAt: !106)
!180 = !DILocalVariable(name: "str", scope: !181, file: !7, line: 68, type: !112, align: 8)
!181 = distinct !DILexicalBlock(scope: !108, file: !109, line: 67, column: 2)
!182 = !DILocation(line: 68, scope: !181, inlinedAt: !106)
!183 = !DILocalVariable(name: "func", scope: !184, file: !7, line: 103, type: !118, align: 8)
!184 = distinct !DISubprogram(name: "readline_to_stream", linkageName: "readline_to_stream", scope: !109, file: !109, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !57)
!185 = !DILocation(line: 103, scope: !184, inlinedAt: !186)
!186 = !DILocation(line: 69, scope: !181, inlinedAt: !106)
!187 = !DILocalVariable(name: "val", scope: !184, file: !7, line: 104, type: !29, align: 1)
!188 = !DILocation(line: 104, scope: !184, inlinedAt: !186)
!189 = !DILocation(line: 113, scope: !184, inlinedAt: !186)
!190 = !DILocalVariable(name: "len", scope: !184, file: !7, line: 114, type: !14, align: 8)
!191 = !DILocation(line: 114, scope: !184, inlinedAt: !186)
!192 = !DILocation(line: 115, scope: !184, inlinedAt: !186)
!193 = !DILocation(line: 120, scope: !194, inlinedAt: !186)
!194 = distinct !DILexicalBlock(scope: !184, file: !109, line: 116, column: 2)
!195 = !DILocation(line: 122, scope: !194, inlinedAt: !186)
!196 = !DILocation(line: 124, scope: !184, inlinedAt: !186)
!197 = !DILocalVariable(name: "c", scope: !198, file: !7, line: 127, type: !29, align: 1)
!198 = distinct !DILexicalBlock(scope: !199, file: !109, line: 125, column: 2)
!199 = distinct !DILexicalBlock(scope: !184, file: !109, line: 124, column: 2)
!200 = !DILocation(line: 127, scope: !198, inlinedAt: !186)
!201 = !DILocalVariable(name: "err", scope: !198, file: !7, line: 131, type: !11, align: 8)
!202 = !DILocation(line: 131, scope: !198, inlinedAt: !186)
!203 = !DILocation(line: 133, scope: !204, inlinedAt: !186)
!204 = distinct !DILexicalBlock(scope: !198, file: !109, line: 132, column: 3)
!205 = !DILocation(line: 134, scope: !204, inlinedAt: !186)
!206 = !DILocation(line: 136, scope: !198, inlinedAt: !186)
!207 = !DILocation(line: 137, scope: !198, inlinedAt: !186)
!208 = !DILocation(line: 141, scope: !198, inlinedAt: !186)
!209 = !DILocation(line: 143, scope: !198, inlinedAt: !186)
!210 = !DILocation(line: 145, scope: !184, inlinedAt: !186)
!211 = !DILocation(line: 644, scope: !212, inlinedAt: !179)
!212 = distinct !DILexicalBlock(scope: !149, file: !150, line: 643, column: 2)
!213 = !DILocation(line: 70, scope: !181, inlinedAt: !106)
!214 = !DILocation(line: 644, scope: !215, inlinedAt: !179)
!215 = distinct !DILexicalBlock(scope: !149, file: !150, line: 643, column: 2)
!216 = !DILocation(line: 644, scope: !217, inlinedAt: !179)
!217 = distinct !DILexicalBlock(scope: !149, file: !150, line: 643, column: 2)
!218 = !DILocalVariable(name: "list", scope: !99, file: !7, line: 48, type: !20, align: 8)
!219 = !DILocation(line: 48, scope: !99)
!220 = !DILocation(line: 322, scope: !99)
!221 = !DILocation(line: 49, scope: !99)
!222 = distinct !DISubprogram(name: "tread_row", linkageName: "std.encoding.csv.CsvReader.tread_row", scope: !7, file: !7, line: 52, type: !223, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !57)
!223 = !DISubroutineType(types: !224)
!224 = !{!11, !16, !84}
!225 = !DILocalVariable(name: "self", arg: 1, scope: !222, file: !7, line: 52, type: !84)
!226 = !DILocation(line: 52, scope: !222)
!227 = !DILocation(line: 54, scope: !222)
!228 = distinct !DISubprogram(name: "free", linkageName: "std.encoding.csv.CsvRow.free", scope: !7, file: !7, line: 60, type: !229, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !57)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !16}
