; ModuleID = 'std_collections_list$cforms.TimerInfo$'
source_filename = "std_collections_list$cforms.TimerInfo$"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }
%"char[]" = type { ptr, i64 }
%"TimerInfo[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%TimerInfo = type { i64, ptr }

$"std_collections_list$cforms.TimerInfo$.List.init" = comdat any

$"std_collections_list$cforms.TimerInfo$.List.tinit" = comdat any

$"std_collections_list$cforms.TimerInfo$.List.init_with_array" = comdat any

$"std_collections_list$cforms.TimerInfo$.List.tinit_with_array" = comdat any

$"std_collections_list$cforms.TimerInfo$.List.init_wrapping_array" = comdat any

$"std_collections_list$cforms.TimerInfo$.List.is_initialized" = comdat any

$"std_collections_list$cforms.TimerInfo$.List.to_format" = comdat any

$"std_collections_list$cforms.TimerInfo$.List.push" = comdat any

$"std_collections_list$cforms.TimerInfo$.List.pop" = comdat any

$"std_collections_list$cforms.TimerInfo$.List.clear" = comdat any

$"std_collections_list$cforms.TimerInfo$.List.pop_first" = comdat any

$"std_collections_list$cforms.TimerInfo$.List.remove_at" = comdat any

$"std_collections_list$cforms.TimerInfo$.List.add_all" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ELEMENT_IS_EQUATABLE", linkageName: "std_collections_list$cforms.TimerInfo$.ELEMENT_IS_EQUATABLE", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 1)
!2 = !DIFile(filename: "list.c3", directory: "C:/Compilers/C3/lib/std/collections")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "ELEMENT_IS_POINTER", linkageName: "std_collections_list$cforms.TimerInfo$.ELEMENT_IS_POINTER", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 1)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "LIST_HEAP_ALLOCATOR", linkageName: "std_collections_list$cforms.TimerInfo$.LIST_HEAP_ALLOCATOR", scope: !2, file: !2, line: 12, type: !8, isLocal: false, isDefinition: true, align: 8)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !9, identifier: "Allocator")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !8, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "ONHEAP", linkageName: "std_collections_list$cforms.TimerInfo$.ONHEAP", scope: !2, file: !2, line: 14, type: !16, isLocal: false, isDefinition: true, align: 8)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !17, identifier: "std_collections_list$cforms.TimerInfo$.List")
!17 = !{!18, !21, !22, !23}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !16, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !20)
!20 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !16, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !16, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !16, file: !2, line: 23, baseType: !24, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 64, baseType: !26, align: 8)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "TimerInfo", scope: !2, file: !2, line: 60, size: 128, align: 64, elements: !27, identifier: "cforms.TimerInfo")
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "timerID", scope: !26, file: !2, line: 60, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uintptr", scope: !2, file: !2, line: 31, baseType: !20, align: 8)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "pTimer", scope: !26, file: !2, line: 60, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Timer*", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timer", scope: !2, file: !2, line: 20, size: 320, align: 64, elements: !33, identifier: "cforms.Timer")
!33 = !{!34, !36, !669, !670, !671}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !32, file: !2, line: 22, baseType: !35, size: 32, align: 32)
!35 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "onTick", scope: !32, file: !2, line: 23, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "EventHandler", scope: !2, file: !2, line: 4, baseType: !38, align: 8)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "EventHandler", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !41, !337}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Control*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "Control", scope: !2, file: !2, line: 55, size: 2496, align: 64, elements: !43, identifier: "cforms.Control")
!43 = !{!44, !64, !68, !75, !78, !84, !85, !87, !88, !89, !90, !93, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !445, !446, !447, !448, !449, !450, !451, !452, !453, !475, !476, !477, !478, !479, !480, !667, !668}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !42, file: !2, line: 57, baseType: !45, size: 8, align: 8)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ControlType", scope: !42, file: !2, line: 25, baseType: !46, size: 8, align: 8, elements: !47)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!48 = !DIEnumerator(name: "NONE", value: 0, isUnsigned: true)
!49 = !DIEnumerator(name: "BUTTON", value: 1, isUnsigned: true)
!50 = !DIEnumerator(name: "CALENDAR", value: 2, isUnsigned: true)
!51 = !DIEnumerator(name: "CHECK_BOX", value: 3, isUnsigned: true)
!52 = !DIEnumerator(name: "COMBO_BOX", value: 4, isUnsigned: true)
!53 = !DIEnumerator(name: "DATE_TIME_PICKER", value: 5, isUnsigned: true)
!54 = !DIEnumerator(name: "GROUP_BOX", value: 6, isUnsigned: true)
!55 = !DIEnumerator(name: "LABEL", value: 7, isUnsigned: true)
!56 = !DIEnumerator(name: "LIST_BOX", value: 8, isUnsigned: true)
!57 = !DIEnumerator(name: "LIST_VIEW", value: 9, isUnsigned: true)
!58 = !DIEnumerator(name: "NUM_PICKER", value: 10, isUnsigned: true)
!59 = !DIEnumerator(name: "PROGRESS_BAR", value: 11, isUnsigned: true)
!60 = !DIEnumerator(name: "RADIO_BUTTON", value: 12, isUnsigned: true)
!61 = !DIEnumerator(name: "TEXT_BOX", value: 13, isUnsigned: true)
!62 = !DIEnumerator(name: "TRACK_BAR", value: 14, isUnsigned: true)
!63 = !DIEnumerator(name: "TREE_VIEW", value: 15, isUnsigned: true)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !2, line: 58, baseType: !65, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !66, align: 8)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 1)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !42, file: !2, line: 59, baseType: !69, size: 128, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !71, identifier: "char[]")
!71 = !{!72, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !70, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !70, baseType: !19, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !42, file: !2, line: 60, baseType: !76, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hwnd", scope: !2, file: !2, line: 19, baseType: !77, align: 8)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "Handle", scope: !2, file: !2, line: 6, baseType: !11, align: 8)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", scope: !42, file: !2, line: 61, baseType: !79, size: 64, align: 32, offset: 320)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", scope: !42, file: !2, line: 14, size: 64, align: 32, elements: !80, identifier: "cforms.Color")
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !79, file: !2, line: 16, baseType: !35, size: 32, align: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !79, file: !2, line: 17, baseType: !83, size: 32, align: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colorref", scope: !2, file: !2, line: 36, baseType: !35, align: 4)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", scope: !42, file: !2, line: 62, baseType: !79, size: 64, align: 32, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !42, file: !2, line: 63, baseType: !86, size: 32, align: 32, offset: 448)
!86 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !42, file: !2, line: 64, baseType: !86, size: 32, align: 32, offset: 480)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "xpos", scope: !42, file: !2, line: 65, baseType: !86, size: 32, align: 32, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ypos", scope: !42, file: !2, line: 66, baseType: !86, size: 32, align: 32, offset: 544)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ctlID", scope: !42, file: !2, line: 67, baseType: !91, size: 64, align: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "iptr", baseType: !92)
!92 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "contextMenu", scope: !42, file: !2, line: 68, baseType: !94, size: 64, align: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ContextMenu*", baseType: !95, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "ContextMenu", scope: !2, file: !2, line: 23, size: 1600, align: 64, elements: !96, identifier: "cforms.ContextMenu")
!96 = !{!97, !341, !342, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !95, file: !2, line: 25, baseType: !98, size: 768, align: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuBase", scope: !95, file: !2, line: 56, size: 768, align: 64, elements: !99, identifier: "cforms.MenuBase")
!99 = !{!100, !102, !125, !126}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !98, file: !2, line: 58, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hmenu", scope: !2, file: !2, line: 16, baseType: !77, align: 8)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !98, file: !2, line: 59, baseType: !103, size: 320, align: 64, offset: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "Font", scope: !98, file: !2, line: 5, size: 320, align: 64, elements: !104, identifier: "cforms.Font")
!104 = !{!105, !106, !107, !119, !120, !121, !122, !123}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !103, file: !2, line: 7, baseType: !69, size: 128, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !103, file: !2, line: 8, baseType: !86, size: 32, align: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !103, file: !2, line: 9, baseType: !108, size: 32, align: 32, offset: 160)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FontWeight", scope: !103, file: !2, line: 45, baseType: !86, size: 32, align: 32, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118}
!110 = !DIEnumerator(name: "THIN", value: 0)
!111 = !DIEnumerator(name: "EXTRA_LIGHT", value: 1)
!112 = !DIEnumerator(name: "LIGHT", value: 2)
!113 = !DIEnumerator(name: "NORMAL", value: 3)
!114 = !DIEnumerator(name: "MEDIUM", value: 4)
!115 = !DIEnumerator(name: "SEMI_BOLD", value: 5)
!116 = !DIEnumerator(name: "BOLD", value: 6)
!117 = !DIEnumerator(name: "EXTRA_BOLD", value: 7)
!118 = !DIEnumerator(name: "THICK", value: 8)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "italics", scope: !103, file: !2, line: 10, baseType: !3, size: 8, align: 8, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "underline", scope: !103, file: !2, line: 11, baseType: !3, size: 8, align: 8, offset: 200)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "strikeout", scope: !103, file: !2, line: 12, baseType: !3, size: 8, align: 8, offset: 208)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_isCreated", scope: !103, file: !2, line: 13, baseType: !3, size: 8, align: 8, offset: 216)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !103, file: !2, line: 14, baseType: !124, size: 64, align: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hfont", scope: !2, file: !2, line: 12, baseType: !77, align: 8)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_menuCount", scope: !98, file: !2, line: 60, baseType: !35, size: 32, align: 32, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_menuList", scope: !98, file: !2, line: 62, baseType: !127, size: 320, align: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "MenuItemList", scope: !2, file: !2, line: 47, baseType: !128, align: 8)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !129, identifier: "std_collections_list$p$cforms.MenuItem$.List")
!129 = !{!130, !131, !132, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !128, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !128, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !128, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !128, file: !2, line: 23, baseType: !134, size: 64, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !135, size: 64, align: 64, dwarfAddressSpace: 0)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 47, baseType: !136, align: 8)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MenuItem*", baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuItem", scope: !2, file: !2, line: 112, size: 1920, align: 64, elements: !138, identifier: "cforms.MenuItem")
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !158, !165, !166, !167, !332, !338, !339, !340}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !137, file: !2, line: 114, baseType: !98, size: 768, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "parentHandle", scope: !137, file: !2, line: 115, baseType: !101, size: 64, align: 64, offset: 768)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_formHwnd", scope: !137, file: !2, line: 116, baseType: !76, size: 64, align: 64, offset: 832)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "bgColor", scope: !137, file: !2, line: 117, baseType: !79, size: 64, align: 32, offset: 896)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "fgColor", scope: !137, file: !2, line: 118, baseType: !79, size: 64, align: 32, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "idNum", scope: !137, file: !2, line: 119, baseType: !35, size: 32, align: 32, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_index", scope: !137, file: !2, line: 121, baseType: !35, size: 32, align: 32, offset: 1056)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_evtFlag", scope: !137, file: !2, line: 122, baseType: !35, size: 32, align: 32, offset: 1088)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "iLevel", scope: !137, file: !2, line: 123, baseType: !86, size: 32, align: 32, offset: 1120)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "hasCheckMark", scope: !137, file: !2, line: 124, baseType: !3, size: 8, align: 8, offset: 1152)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_isCreated", scope: !137, file: !2, line: 125, baseType: !3, size: 8, align: 8, offset: 1160)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_isEnabled", scope: !137, file: !2, line: 126, baseType: !3, size: 8, align: 8, offset: 1168)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_popup", scope: !137, file: !2, line: 127, baseType: !3, size: 8, align: 8, offset: 1176)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_formMenu", scope: !137, file: !2, line: 128, baseType: !3, size: 8, align: 8, offset: 1184)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !137, file: !2, line: 129, baseType: !69, size: 128, align: 64, offset: 1216)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_wideText", scope: !137, file: !2, line: 130, baseType: !155, size: 64, align: 64, offset: 1344)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Char16*", baseType: !156, size: 64, align: 64, dwarfAddressSpace: 0)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char16", scope: !2, file: !2, line: 33, baseType: !157, align: 2)
!157 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !137, file: !2, line: 131, baseType: !159, size: 8, align: 8, offset: 1408)
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MenuType", scope: !137, file: !2, line: 49, baseType: !46, size: 8, align: 8, elements: !160)
!160 = !{!161, !162, !163, !164}
!161 = !DIEnumerator(name: "BASE_MENU", value: 0, isUnsigned: true)
!162 = !DIEnumerator(name: "MENU_ITEM", value: 1, isUnsigned: true)
!163 = !DIEnumerator(name: "POPUP", value: 2, isUnsigned: true)
!164 = !DIEnumerator(name: "SEPRATOR", value: 3, isUnsigned: true)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_parent", scope: !137, file: !2, line: 132, baseType: !136, size: 64, align: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "uFlag", scope: !137, file: !2, line: 133, baseType: !35, size: 32, align: 32, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_mbar", scope: !137, file: !2, line: 134, baseType: !168, size: 64, align: 64, offset: 1600)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MenuBar*", baseType: !169, size: 64, align: 64, dwarfAddressSpace: 0)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuBar", scope: !2, file: !2, line: 98, size: 1216, align: 64, elements: !170, identifier: "cforms.MenuBar")
!170 = !{!171, !172, !173, !327, !328, !329, !330, !331}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !169, file: !2, line: 100, baseType: !98, size: 768, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_formHwnd", scope: !169, file: !2, line: 101, baseType: !76, size: 64, align: 64, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_pForm", scope: !169, file: !2, line: 102, baseType: !174, size: 64, align: 64, offset: 832)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Form*", baseType: !175, size: 64, align: 64, dwarfAddressSpace: 0)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", scope: !2, file: !2, line: 69, size: 5632, align: 64, elements: !176, identifier: "cforms.Form")
!176 = !{!177, !178, !191, !202, !208, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !239, !253, !263, !265, !267, !268, !269, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !321, !322}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !175, file: !2, line: 71, baseType: !42, size: 2496, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "formPos", scope: !175, file: !2, line: 72, baseType: !179, size: 32, align: 32, offset: 2496)
!179 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormPos", scope: !175, file: !2, line: 58, baseType: !86, size: 32, align: 32, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!181 = !DIEnumerator(name: "CENTER", value: 0)
!182 = !DIEnumerator(name: "TOP_LEFT", value: 1)
!183 = !DIEnumerator(name: "TOP_MID", value: 2)
!184 = !DIEnumerator(name: "TOP_RIGHT", value: 3)
!185 = !DIEnumerator(name: "MID_LEFT", value: 4)
!186 = !DIEnumerator(name: "MID_RIGHT", value: 5)
!187 = !DIEnumerator(name: "BOTTOM_LEFT", value: 6)
!188 = !DIEnumerator(name: "BOTTOM_MID", value: 7)
!189 = !DIEnumerator(name: "BOTTOM_RIGHT", value: 8)
!190 = !DIEnumerator(name: "MANUAL", value: 9)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "formStyle", scope: !175, file: !2, line: 73, baseType: !192, size: 32, align: 32, offset: 2528)
!192 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormStyle", scope: !175, file: !2, line: 72, baseType: !86, size: 32, align: 32, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201}
!194 = !DIEnumerator(name: "NONE", value: 0)
!195 = !DIEnumerator(name: "FIXED_SINGLE", value: 1)
!196 = !DIEnumerator(name: "FIXED_3D", value: 2)
!197 = !DIEnumerator(name: "FIXED_DIALOG", value: 3)
!198 = !DIEnumerator(name: "NORMAL_WINDOW", value: 4)
!199 = !DIEnumerator(name: "FIXED_TOOL", value: 5)
!200 = !DIEnumerator(name: "SIZABLE_TOOL", value: 6)
!201 = !DIEnumerator(name: "HIDDEN", value: 7)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "formState", scope: !175, file: !2, line: 74, baseType: !203, size: 32, align: 32, offset: 2560)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormState", scope: !175, file: !2, line: 84, baseType: !86, size: 32, align: 32, elements: !204)
!204 = !{!205, !206, !207}
!205 = !DIEnumerator(name: "NORMAL", value: 0)
!206 = !DIEnumerator(name: "MAXIMIZED", value: 1)
!207 = !DIEnumerator(name: "MINIMIZED", value: 2)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_fDrawMode", scope: !175, file: !2, line: 75, baseType: !209, size: 32, align: 32, offset: 2592)
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormDrawMode", scope: !175, file: !2, line: 90, baseType: !86, size: 32, align: 32, elements: !210)
!210 = !{!211, !212, !213}
!211 = !DIEnumerator(name: "DEFAULT", value: 0)
!212 = !DIEnumerator(name: "FLAT_COLOR", value: 1)
!213 = !DIEnumerator(name: "GRADIENT", value: 2)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "topMost", scope: !175, file: !2, line: 76, baseType: !3, size: 8, align: 8, offset: 2624)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "createChilds", scope: !175, file: !2, line: 77, baseType: !3, size: 8, align: 8, offset: 2632)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "maximizeBox", scope: !175, file: !2, line: 78, baseType: !3, size: 8, align: 8, offset: 2640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "minimizeBox", scope: !175, file: !2, line: 79, baseType: !3, size: 8, align: 8, offset: 2648)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_isLoaded", scope: !175, file: !2, line: 80, baseType: !3, size: 8, align: 8, offset: 2656)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_isMainWindow", scope: !175, file: !2, line: 81, baseType: !3, size: 8, align: 8, offset: 2664)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_isMouseTracking", scope: !175, file: !2, line: 82, baseType: !3, size: 8, align: 8, offset: 2672)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_isSizing", scope: !175, file: !2, line: 83, baseType: !3, size: 8, align: 8, offset: 2680)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_menuMapInited", scope: !175, file: !2, line: 84, baseType: !3, size: 8, align: 8, offset: 2688)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_menubarCreated", scope: !175, file: !2, line: 85, baseType: !3, size: 8, align: 8, offset: 2696)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_formID", scope: !175, file: !2, line: 86, baseType: !86, size: 32, align: 32, offset: 2720)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_comboList", scope: !175, file: !2, line: 87, baseType: !226, size: 320, align: 64, offset: 2752)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "CmbList", scope: !2, file: !2, line: 65, baseType: !227, align: 8)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !228, identifier: "std_collections_list$cforms.ComboInfo$.List")
!228 = !{!229, !230, !231, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !227, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !227, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !227, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !227, file: !2, line: 23, baseType: !233, size: 64, align: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !234, size: 64, align: 64, dwarfAddressSpace: 0)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 65, baseType: !235, align: 8)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComboInfo", scope: !2, file: !2, line: 61, size: 128, align: 64, elements: !236, identifier: "cforms.ComboInfo")
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "listHwnd", scope: !235, file: !2, line: 61, baseType: !76, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cmbHwnd", scope: !235, file: !2, line: 61, baseType: !76, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_menuItemList", scope: !175, file: !2, line: 88, baseType: !240, size: 320, align: 64, offset: 3072)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "MenuItems", scope: !2, file: !2, line: 66, baseType: !241, align: 8)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !242, identifier: "std_collections_list$cforms.MenuInfo$.List")
!242 = !{!243, !244, !245, !246}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !241, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !241, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !241, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !241, file: !2, line: 23, baseType: !247, size: 64, align: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !248, size: 64, align: 64, dwarfAddressSpace: 0)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 66, baseType: !249, align: 8)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuInfo", scope: !2, file: !2, line: 62, size: 128, align: 64, elements: !250, identifier: "cforms.MenuInfo")
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "menuID", scope: !249, file: !2, line: 62, baseType: !35, size: 32, align: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pMenuItem", scope: !249, file: !2, line: 62, baseType: !136, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "controls", scope: !175, file: !2, line: 89, baseType: !254, size: 320, align: 64, offset: 3392)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ControlList", scope: !2, file: !2, line: 56, baseType: !255, align: 8)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !256, identifier: "std_collections_list$p$cforms.Control$.List")
!256 = !{!257, !258, !259, !260}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !255, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !255, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !255, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !255, file: !2, line: 23, baseType: !261, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !262, size: 64, align: 64, dwarfAddressSpace: 0)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 56, baseType: !41, align: 8)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_timerList", scope: !175, file: !2, line: 90, baseType: !264, size: 320, align: 64, offset: 3712)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerList", scope: !2, file: !2, line: 64, baseType: !16, align: 8)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "hinst", scope: !175, file: !2, line: 91, baseType: !266, size: 64, align: 64, offset: 4032)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hinstance", scope: !2, file: !2, line: 15, baseType: !77, align: 8)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "menubar", scope: !175, file: !2, line: 92, baseType: !168, size: 64, align: 64, offset: 4096)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_menuFont", scope: !175, file: !2, line: 93, baseType: !103, size: 320, align: 64, offset: 4160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayBrush", scope: !175, file: !2, line: 94, baseType: !270, size: 64, align: 64, offset: 4480)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hbrush", scope: !2, file: !2, line: 9, baseType: !77, align: 8)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_menuDefBgBrush", scope: !175, file: !2, line: 95, baseType: !270, size: 64, align: 64, offset: 4544)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_menuHotBgBrush", scope: !175, file: !2, line: 96, baseType: !270, size: 64, align: 64, offset: 4608)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_menuFrameBrush", scope: !175, file: !2, line: 97, baseType: !270, size: 64, align: 64, offset: 4672)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayCref", scope: !175, file: !2, line: 98, baseType: !83, size: 32, align: 32, offset: 4736)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "onLoad", scope: !175, file: !2, line: 101, baseType: !37, size: 64, align: 64, offset: 4800)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "onActivate", scope: !175, file: !2, line: 102, baseType: !37, size: 64, align: 64, offset: 4864)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "onDeActivate", scope: !175, file: !2, line: 103, baseType: !37, size: 64, align: 64, offset: 4928)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "onMoving", scope: !175, file: !2, line: 104, baseType: !37, size: 64, align: 64, offset: 4992)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "onMoved", scope: !175, file: !2, line: 105, baseType: !37, size: 64, align: 64, offset: 5056)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "onMinimized", scope: !175, file: !2, line: 106, baseType: !37, size: 64, align: 64, offset: 5120)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "onMaximized", scope: !175, file: !2, line: 107, baseType: !37, size: 64, align: 64, offset: 5184)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "onRestored", scope: !175, file: !2, line: 108, baseType: !37, size: 64, align: 64, offset: 5248)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "onClosing", scope: !175, file: !2, line: 109, baseType: !37, size: 64, align: 64, offset: 5312)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "onClosed", scope: !175, file: !2, line: 110, baseType: !37, size: 64, align: 64, offset: 5376)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "onSizing", scope: !175, file: !2, line: 113, baseType: !286, size: 64, align: 64, offset: 5440)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "SizeEventHandler", scope: !2, file: !2, line: 6, baseType: !287, align: 8)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SizeEventHandler", baseType: !288, size: 64, align: 64, dwarfAddressSpace: 0)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !41, !290}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SizeEventArgs*", baseType: !291, size: 64, align: 64, dwarfAddressSpace: 0)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "SizeEventArgs", scope: !2, file: !2, line: 39, size: 256, align: 32, elements: !292, identifier: "cforms.SizeEventArgs")
!292 = !{!293, !297, !305, !316}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "eventArgs", scope: !291, file: !2, line: 41, baseType: !294, size: 8, align: 8)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "EventArgs", scope: !291, file: !2, line: 23, size: 8, align: 8, elements: !295, identifier: "cforms.EventArgs")
!295 = !{!296}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "handled", scope: !294, file: !2, line: 25, baseType: !3, size: 8, align: 8)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "formRect", scope: !291, file: !2, line: 42, baseType: !298, size: 128, align: 32, offset: 32)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rect", scope: !291, file: !2, line: 62, size: 128, align: 32, elements: !299, identifier: "cforms.Rect")
!299 = !{!300, !302, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !298, file: !2, line: 63, baseType: !301, size: 32, align: 32)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "Long", scope: !2, file: !2, line: 24, baseType: !86, align: 4)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !298, file: !2, line: 64, baseType: !301, size: 32, align: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !298, file: !2, line: 65, baseType: !301, size: 32, align: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !298, file: !2, line: 66, baseType: !301, size: 32, align: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sizedOn", scope: !291, file: !2, line: 43, baseType: !306, size: 32, align: 32, offset: 160)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SizedPosition", scope: !291, file: !2, line: 123, baseType: !86, size: 32, align: 32, elements: !307)
!307 = !{!194, !308, !309, !310, !311, !312, !313, !314, !315}
!308 = !DIEnumerator(name: "LEFTEDGE", value: 1)
!309 = !DIEnumerator(name: "RIGHTEDGE", value: 2)
!310 = !DIEnumerator(name: "TOPEDGE", value: 3)
!311 = !DIEnumerator(name: "TOPLEFTCORNER", value: 4)
!312 = !DIEnumerator(name: "TOPRIGHTCORNER", value: 5)
!313 = !DIEnumerator(name: "BOTTOMEDGE", value: 6)
!314 = !DIEnumerator(name: "BOTTOMLEFTCORNER", value: 7)
!315 = !DIEnumerator(name: "BOTTOMRIGHTCORNER", value: 8)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "clientArea", scope: !291, file: !2, line: 44, baseType: !317, size: 64, align: 32, offset: 192)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "Area", scope: !291, file: !2, line: 17, size: 64, align: 32, elements: !318, identifier: "cforms.Area")
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !317, file: !2, line: 19, baseType: !86, size: 32, align: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !317, file: !2, line: 20, baseType: !86, size: 32, align: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "onSized", scope: !175, file: !2, line: 114, baseType: !286, size: 64, align: 64, offset: 5504)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "onThreadMsg", scope: !175, file: !2, line: 115, baseType: !323, size: 64, align: 64, offset: 5568)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadMsgHandler", scope: !2, file: !2, line: 9, baseType: !324, align: 8)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ThreadMsgHandler", baseType: !325, size: 64, align: 64, dwarfAddressSpace: 0)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !20, !92}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayCref", scope: !169, file: !2, line: 103, baseType: !83, size: 32, align: 32, offset: 896)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_menuDefBgBrush", scope: !169, file: !2, line: 104, baseType: !270, size: 64, align: 64, offset: 960)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_menuHotBgBrush", scope: !169, file: !2, line: 105, baseType: !270, size: 64, align: 64, offset: 1024)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_menuFrameBrush", scope: !169, file: !2, line: 106, baseType: !270, size: 64, align: 64, offset: 1088)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayBrush", scope: !169, file: !2, line: 107, baseType: !270, size: 64, align: 64, offset: 1152)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "onClick", scope: !137, file: !2, line: 136, baseType: !333, size: 64, align: 64, offset: 1664)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "MenuEventHandler", scope: !2, file: !2, line: 11, baseType: !334, align: 8)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MenuEventHandler", baseType: !335, size: 64, align: 64, dwarfAddressSpace: 0)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !136, !337}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "EventArgs*", baseType: !294, size: 64, align: 64, dwarfAddressSpace: 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "onPopup", scope: !137, file: !2, line: 137, baseType: !333, size: 64, align: 64, offset: 1728)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "onCloseup", scope: !137, file: !2, line: 138, baseType: !333, size: 64, align: 64, offset: 1792)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "onFocus", scope: !137, file: !2, line: 139, baseType: !333, size: 64, align: 64, offset: 1856)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !95, file: !2, line: 26, baseType: !41, size: 64, align: 64, offset: 768)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tray", scope: !95, file: !2, line: 27, baseType: !343, size: 64, align: 64, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TrayIcon*", baseType: !344, size: 64, align: 64, dwarfAddressSpace: 0)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "TrayIcon", scope: !2, file: !2, line: 40, size: 8640, align: 64, elements: !345, identifier: "cforms.TrayIcon")
!345 = !{!346, !347, !348, !349, !356, !358, !359, !360, !366, !392, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_resetIcon", scope: !344, file: !2, line: 42, baseType: !3, size: 8, align: 8)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_cmenuUsed", scope: !344, file: !2, line: 43, baseType: !3, size: 8, align: 8, offset: 8)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_retainIcon", scope: !344, file: !2, line: 44, baseType: !3, size: 8, align: 8, offset: 16)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "menuTrigger", scope: !344, file: !2, line: 45, baseType: !350, size: 32, align: 32, offset: 32)
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TrayMenuTrigger", scope: !344, file: !2, line: 145, baseType: !86, size: 32, align: 32, elements: !351)
!351 = !{!194, !352, !353, !354, !355}
!352 = !DIEnumerator(name: "LEFT_CLICK", value: 1)
!353 = !DIEnumerator(name: "LEFT_DOUBLE_CLICK", value: 2)
!354 = !DIEnumerator(name: "RIGHT_CLICK", value: 3)
!355 = !DIEnumerator(name: "ANY_CLICK", value: 4)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_hTrayIcon", scope: !344, file: !2, line: 46, baseType: !357, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hicon", scope: !2, file: !2, line: 14, baseType: !77, align: 8)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_msgWinHwnd", scope: !344, file: !2, line: 47, baseType: !76, size: 64, align: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "contextMenu", scope: !344, file: !2, line: 48, baseType: !94, size: 64, align: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !344, file: !2, line: 49, baseType: !361, size: 64, align: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !362, size: 64, align: 64, dwarfAddressSpace: 0)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !363, identifier: "any")
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !362, baseType: !11, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !362, baseType: !13, size: 64, align: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_nid", scope: !344, file: !2, line: 50, baseType: !367, size: 7616, align: 64, offset: 320)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "NotifyIconData", scope: !344, file: !2, line: 423, size: 7616, align: 64, elements: !368, identifier: "cforms.NotifyIconData")
!368 = !{!369, !371, !372, !373, !374, !375, !376, !380, !381, !382, !386, !387, !391}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cbSize", scope: !367, file: !2, line: 425, baseType: !370, size: 32, align: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dword", scope: !2, file: !2, line: 34, baseType: !35, align: 4)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", scope: !367, file: !2, line: 426, baseType: !76, size: 64, align: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "uID", scope: !367, file: !2, line: 427, baseType: !35, size: 32, align: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "uFlags", scope: !367, file: !2, line: 428, baseType: !35, size: 32, align: 32, offset: 160)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "uCallbackMessage", scope: !367, file: !2, line: 429, baseType: !35, size: 32, align: 32, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "hIcon", scope: !367, file: !2, line: 430, baseType: !357, size: 64, align: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "toolTipText", scope: !367, file: !2, line: 431, baseType: !377, size: 2048, align: 16, offset: 320)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 2048, align: 16, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 128, lowerBound: 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dwState", scope: !367, file: !2, line: 432, baseType: !370, size: 32, align: 32, offset: 2368)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dwStateMask", scope: !367, file: !2, line: 433, baseType: !370, size: 32, align: 32, offset: 2400)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "balloonText", scope: !367, file: !2, line: 434, baseType: !383, size: 4096, align: 16, offset: 2432)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 4096, align: 16, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 256, lowerBound: 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "uVersionOrTimeout", scope: !367, file: !2, line: 435, baseType: !35, size: 32, align: 32, offset: 6528)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "balloonTitle", scope: !367, file: !2, line: 436, baseType: !388, size: 1024, align: 16, offset: 6560)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 1024, align: 16, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 64, lowerBound: 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "dwInfoFlags", scope: !367, file: !2, line: 437, baseType: !370, size: 32, align: 32, offset: 7584)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "onBalloonShow", scope: !344, file: !2, line: 52, baseType: !393, size: 64, align: 64, offset: 7936)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "TrayIconEventHandler", scope: !2, file: !2, line: 10, baseType: !394, align: 8)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TrayIconEventHandler", baseType: !395, size: 64, align: 64, dwarfAddressSpace: 0)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !343, !337}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "onBalloonClose", scope: !344, file: !2, line: 53, baseType: !393, size: 64, align: 64, offset: 8000)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "onBalloonClick", scope: !344, file: !2, line: 54, baseType: !393, size: 64, align: 64, offset: 8064)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseMove", scope: !344, file: !2, line: 55, baseType: !393, size: 64, align: 64, offset: 8128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftMouseDown", scope: !344, file: !2, line: 56, baseType: !393, size: 64, align: 64, offset: 8192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftMouseUp", scope: !344, file: !2, line: 57, baseType: !393, size: 64, align: 64, offset: 8256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseDown", scope: !344, file: !2, line: 58, baseType: !393, size: 64, align: 64, offset: 8320)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseUp", scope: !344, file: !2, line: 59, baseType: !393, size: 64, align: 64, offset: 8384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftClick", scope: !344, file: !2, line: 60, baseType: !393, size: 64, align: 64, offset: 8448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "onRightClick", scope: !344, file: !2, line: 61, baseType: !393, size: 64, align: 64, offset: 8512)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftDoubleClick", scope: !344, file: !2, line: 62, baseType: !393, size: 64, align: 64, offset: 8576)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !95, file: !2, line: 28, baseType: !86, size: 32, align: 32, offset: 896)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !95, file: !2, line: 28, baseType: !86, size: 32, align: 32, offset: 928)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "rightClick", scope: !95, file: !2, line: 29, baseType: !3, size: 8, align: 8, offset: 960)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_menuInserted", scope: !95, file: !2, line: 30, baseType: !3, size: 8, align: 8, offset: 968)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_trayParent", scope: !95, file: !2, line: 31, baseType: !3, size: 8, align: 8, offset: 976)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_grayCref", scope: !95, file: !2, line: 32, baseType: !83, size: 32, align: 32, offset: 992)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_dummyHwnd", scope: !95, file: !2, line: 33, baseType: !76, size: 64, align: 64, offset: 1024)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_defBgBrush", scope: !95, file: !2, line: 34, baseType: !270, size: 64, align: 64, offset: 1088)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_hotBgBrush", scope: !95, file: !2, line: 34, baseType: !270, size: 64, align: 64, offset: 1152)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_borderBrush", scope: !95, file: !2, line: 34, baseType: !270, size: 64, align: 64, offset: 1216)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_grayBrush", scope: !95, file: !2, line: 34, baseType: !270, size: 64, align: 64, offset: 1280)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "onMenuShown", scope: !95, file: !2, line: 37, baseType: !37, size: 64, align: 64, offset: 1344)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "onMenuClose", scope: !95, file: !2, line: 37, baseType: !37, size: 64, align: 64, offset: 1408)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "onTrayMenuShown", scope: !95, file: !2, line: 38, baseType: !393, size: 64, align: 64, offset: 1472)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "onTrayMenuClose", scope: !95, file: !2, line: 38, baseType: !393, size: 64, align: 64, offset: 1536)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_className", scope: !42, file: !2, line: 69, baseType: !155, size: 64, align: 64, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_style", scope: !42, file: !2, line: 70, baseType: !370, size: 32, align: 32, offset: 768)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_exStyle", scope: !42, file: !2, line: 71, baseType: !370, size: 32, align: 32, offset: 800)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_drawMode", scope: !42, file: !2, line: 72, baseType: !35, size: 32, align: 32, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_isCreated", scope: !42, file: !2, line: 73, baseType: !3, size: 8, align: 8, offset: 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_lbDown", scope: !42, file: !2, line: 74, baseType: !3, size: 8, align: 8, offset: 872)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_rbDown", scope: !42, file: !2, line: 75, baseType: !3, size: 8, align: 8, offset: 880)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_isMouseEntered", scope: !42, file: !2, line: 76, baseType: !3, size: 8, align: 8, offset: 888)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_textable", scope: !42, file: !2, line: 77, baseType: !3, size: 8, align: 8, offset: 896)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_autoSizable", scope: !42, file: !2, line: 78, baseType: !3, size: 8, align: 8, offset: 904)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_cmenuUsed", scope: !42, file: !2, line: 79, baseType: !3, size: 8, align: 8, offset: 912)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_bkBrush", scope: !42, file: !2, line: 80, baseType: !270, size: 64, align: 64, offset: 960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_wideText", scope: !42, file: !2, line: 81, baseType: !155, size: 64, align: 64, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_wtext", scope: !42, file: !2, line: 82, baseType: !436, size: 64, align: 64, offset: 1088)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "WideString*", baseType: !437, size: 64, align: 64, dwarfAddressSpace: 0)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "WideString", scope: !2, file: !2, line: 6, size: 256, align: 64, elements: !438, identifier: "cforms.WideString")
!438 = !{!439, !442, !443, !444}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !437, file: !2, line: 7, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "WString", scope: !2, file: !2, line: 23, baseType: !441, align: 8)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ushort*", baseType: !157, size: 64, align: 64, dwarfAddressSpace: 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_inpLen", scope: !437, file: !2, line: 8, baseType: !86, size: 32, align: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_wcLen", scope: !437, file: !2, line: 9, baseType: !86, size: 32, align: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_inpStr", scope: !437, file: !2, line: 10, baseType: !69, size: 128, align: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !42, file: !2, line: 83, baseType: !103, size: 320, align: 64, offset: 1152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_parent", scope: !42, file: !2, line: 84, baseType: !174, size: 64, align: 64, offset: 1472)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "onGotFocus", scope: !42, file: !2, line: 86, baseType: !37, size: 64, align: 64, offset: 1536)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "onLostFocus", scope: !42, file: !2, line: 87, baseType: !37, size: 64, align: 64, offset: 1600)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "onClick", scope: !42, file: !2, line: 88, baseType: !37, size: 64, align: 64, offset: 1664)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "onRightClick", scope: !42, file: !2, line: 89, baseType: !37, size: 64, align: 64, offset: 1728)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseEnter", scope: !42, file: !2, line: 90, baseType: !37, size: 64, align: 64, offset: 1792)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseLeave", scope: !42, file: !2, line: 91, baseType: !37, size: 64, align: 64, offset: 1856)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseDown", scope: !42, file: !2, line: 92, baseType: !454, size: 64, align: 64, offset: 1920)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "MouseEventHandler", scope: !2, file: !2, line: 5, baseType: !455, align: 8)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MouseEventHandler", baseType: !456, size: 64, align: 64, dwarfAddressSpace: 0)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !41, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MouseEventArgs*", baseType: !459, size: 64, align: 64, dwarfAddressSpace: 0)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "MouseEventArgs", scope: !2, file: !2, line: 28, size: 192, align: 32, elements: !460, identifier: "cforms.MouseEventArgs")
!460 = !{!461, !462, !470, !471, !472, !473, !474}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "eventArgs", scope: !459, file: !2, line: 30, baseType: !294, size: 8, align: 8)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !459, file: !2, line: 31, baseType: !463, size: 32, align: 32, offset: 32)
!463 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MouseButton", scope: !459, file: !2, line: 113, baseType: !86, size: 32, align: 32, elements: !464)
!464 = !{!194, !465, !466, !467, !468, !469}
!465 = !DIEnumerator(name: "RIGHT", value: 1)
!466 = !DIEnumerator(name: "MIDDLE", value: 2)
!467 = !DIEnumerator(name: "LEFT", value: 3)
!468 = !DIEnumerator(name: "XBUTTON1", value: 4)
!469 = !DIEnumerator(name: "XBUTTON2", value: 5)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "isShiftPressed", scope: !459, file: !2, line: 32, baseType: !3, size: 8, align: 8, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "isCtrlPressed", scope: !459, file: !2, line: 33, baseType: !3, size: 8, align: 8, offset: 72)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !459, file: !2, line: 34, baseType: !86, size: 32, align: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !459, file: !2, line: 35, baseType: !86, size: 32, align: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !459, file: !2, line: 36, baseType: !86, size: 32, align: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseUp", scope: !42, file: !2, line: 93, baseType: !454, size: 64, align: 64, offset: 1984)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseDown", scope: !42, file: !2, line: 94, baseType: !454, size: 64, align: 64, offset: 2048)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseUp", scope: !42, file: !2, line: 95, baseType: !454, size: 64, align: 64, offset: 2112)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseWheel", scope: !42, file: !2, line: 96, baseType: !454, size: 64, align: 64, offset: 2176)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseMove", scope: !42, file: !2, line: 97, baseType: !454, size: 64, align: 64, offset: 2240)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "onKeyDown", scope: !42, file: !2, line: 98, baseType: !481, size: 64, align: 64, offset: 2304)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "KeyEventHandler", scope: !2, file: !2, line: 7, baseType: !482, align: 8)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "KeyEventHandler", baseType: !483, size: 64, align: 64, dwarfAddressSpace: 0)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !41, !485}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "KeyEventArgs*", baseType: !486, size: 64, align: 64, dwarfAddressSpace: 0)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyEventArgs", scope: !2, file: !2, line: 47, size: 160, align: 32, elements: !487, identifier: "cforms.KeyEventArgs")
!487 = !{!488, !489, !661, !662, !663, !664, !665, !666}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "eventArgs", scope: !486, file: !2, line: 49, baseType: !294, size: 8, align: 8)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "keyCode", scope: !486, file: !2, line: 50, baseType: !490, size: 32, align: 32, offset: 32)
!490 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Keys", scope: !486, file: !2, line: 165, baseType: !86, size: 32, align: 32, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!492 = !DIEnumerator(name: "MODIFIER", value: 0)
!493 = !DIEnumerator(name: "NOKEY", value: 1)
!494 = !DIEnumerator(name: "LBUTTON", value: 2)
!495 = !DIEnumerator(name: "RBUTTON", value: 3)
!496 = !DIEnumerator(name: "CANCEL", value: 4)
!497 = !DIEnumerator(name: "MBUTTON", value: 5)
!498 = !DIEnumerator(name: "XBUTTO1", value: 6)
!499 = !DIEnumerator(name: "XBUTTON2", value: 7)
!500 = !DIEnumerator(name: "BACK_SPACE", value: 8)
!501 = !DIEnumerator(name: "TAB", value: 9)
!502 = !DIEnumerator(name: "LINE_FEED", value: 10)
!503 = !DIEnumerator(name: "CLEAR", value: 11)
!504 = !DIEnumerator(name: "ENTER", value: 12)
!505 = !DIEnumerator(name: "SHIFT", value: 13)
!506 = !DIEnumerator(name: "CTRL", value: 14)
!507 = !DIEnumerator(name: "ALT", value: 15)
!508 = !DIEnumerator(name: "PAUSE", value: 16)
!509 = !DIEnumerator(name: "CAPS_LOCK", value: 17)
!510 = !DIEnumerator(name: "ESCAPE", value: 18)
!511 = !DIEnumerator(name: "SPACE", value: 19)
!512 = !DIEnumerator(name: "PAGE_UP", value: 20)
!513 = !DIEnumerator(name: "PAGE_DOWN", value: 21)
!514 = !DIEnumerator(name: "END", value: 22)
!515 = !DIEnumerator(name: "HOME", value: 23)
!516 = !DIEnumerator(name: "LEFTA_RROW", value: 24)
!517 = !DIEnumerator(name: "UP_ARROW", value: 25)
!518 = !DIEnumerator(name: "RIGHT_ARROW", value: 26)
!519 = !DIEnumerator(name: "DOWN_ARROW", value: 27)
!520 = !DIEnumerator(name: "SELECT", value: 28)
!521 = !DIEnumerator(name: "PRINT", value: 29)
!522 = !DIEnumerator(name: "EXECUTE", value: 30)
!523 = !DIEnumerator(name: "PRINT_SCREEN", value: 31)
!524 = !DIEnumerator(name: "INSERT", value: 32)
!525 = !DIEnumerator(name: "DEL", value: 33)
!526 = !DIEnumerator(name: "HELP", value: 34)
!527 = !DIEnumerator(name: "D0", value: 35)
!528 = !DIEnumerator(name: "D1", value: 36)
!529 = !DIEnumerator(name: "D2", value: 37)
!530 = !DIEnumerator(name: "D3", value: 38)
!531 = !DIEnumerator(name: "D4", value: 39)
!532 = !DIEnumerator(name: "D5", value: 40)
!533 = !DIEnumerator(name: "D6", value: 41)
!534 = !DIEnumerator(name: "D7", value: 42)
!535 = !DIEnumerator(name: "D8", value: 43)
!536 = !DIEnumerator(name: "D9", value: 44)
!537 = !DIEnumerator(name: "A", value: 45)
!538 = !DIEnumerator(name: "B", value: 46)
!539 = !DIEnumerator(name: "C", value: 47)
!540 = !DIEnumerator(name: "D", value: 48)
!541 = !DIEnumerator(name: "E", value: 49)
!542 = !DIEnumerator(name: "F", value: 50)
!543 = !DIEnumerator(name: "G", value: 51)
!544 = !DIEnumerator(name: "H", value: 52)
!545 = !DIEnumerator(name: "I", value: 53)
!546 = !DIEnumerator(name: "J", value: 54)
!547 = !DIEnumerator(name: "K", value: 55)
!548 = !DIEnumerator(name: "L", value: 56)
!549 = !DIEnumerator(name: "M", value: 57)
!550 = !DIEnumerator(name: "N", value: 58)
!551 = !DIEnumerator(name: "O", value: 59)
!552 = !DIEnumerator(name: "P", value: 60)
!553 = !DIEnumerator(name: "Q", value: 61)
!554 = !DIEnumerator(name: "R", value: 62)
!555 = !DIEnumerator(name: "S", value: 63)
!556 = !DIEnumerator(name: "T", value: 64)
!557 = !DIEnumerator(name: "U", value: 65)
!558 = !DIEnumerator(name: "V", value: 66)
!559 = !DIEnumerator(name: "W", value: 67)
!560 = !DIEnumerator(name: "X", value: 68)
!561 = !DIEnumerator(name: "Y", value: 69)
!562 = !DIEnumerator(name: "Z", value: 70)
!563 = !DIEnumerator(name: "LEFT_WIN", value: 71)
!564 = !DIEnumerator(name: "RIGH_TWIN", value: 72)
!565 = !DIEnumerator(name: "APPS", value: 73)
!566 = !DIEnumerator(name: "SLEEP", value: 74)
!567 = !DIEnumerator(name: "NUM_PAD0", value: 75)
!568 = !DIEnumerator(name: "NUM_PAD1", value: 76)
!569 = !DIEnumerator(name: "NUM_PAD2", value: 77)
!570 = !DIEnumerator(name: "NUM_PAD3", value: 78)
!571 = !DIEnumerator(name: "NUM_PAD4", value: 79)
!572 = !DIEnumerator(name: "NUM_PAD5", value: 80)
!573 = !DIEnumerator(name: "NUM_PAD6", value: 81)
!574 = !DIEnumerator(name: "NUM_PAD7", value: 82)
!575 = !DIEnumerator(name: "NUM_PAD8", value: 83)
!576 = !DIEnumerator(name: "NUM_PAD9", value: 84)
!577 = !DIEnumerator(name: "MULTIPLY", value: 85)
!578 = !DIEnumerator(name: "ADD", value: 86)
!579 = !DIEnumerator(name: "SEPERATOR", value: 87)
!580 = !DIEnumerator(name: "SUBTRACT", value: 88)
!581 = !DIEnumerator(name: "DECIMAL", value: 89)
!582 = !DIEnumerator(name: "DIVIDE", value: 90)
!583 = !DIEnumerator(name: "F1", value: 91)
!584 = !DIEnumerator(name: "F2", value: 92)
!585 = !DIEnumerator(name: "F3", value: 93)
!586 = !DIEnumerator(name: "F4", value: 94)
!587 = !DIEnumerator(name: "F5", value: 95)
!588 = !DIEnumerator(name: "F6", value: 96)
!589 = !DIEnumerator(name: "F7", value: 97)
!590 = !DIEnumerator(name: "F8", value: 98)
!591 = !DIEnumerator(name: "F9", value: 99)
!592 = !DIEnumerator(name: "F10", value: 100)
!593 = !DIEnumerator(name: "F11", value: 101)
!594 = !DIEnumerator(name: "F12", value: 102)
!595 = !DIEnumerator(name: "F13", value: 103)
!596 = !DIEnumerator(name: "F14", value: 104)
!597 = !DIEnumerator(name: "F15", value: 105)
!598 = !DIEnumerator(name: "F16", value: 106)
!599 = !DIEnumerator(name: "F17", value: 107)
!600 = !DIEnumerator(name: "F18", value: 108)
!601 = !DIEnumerator(name: "F19", value: 109)
!602 = !DIEnumerator(name: "F20", value: 110)
!603 = !DIEnumerator(name: "F21", value: 111)
!604 = !DIEnumerator(name: "F22", value: 112)
!605 = !DIEnumerator(name: "F23", value: 113)
!606 = !DIEnumerator(name: "F24", value: 114)
!607 = !DIEnumerator(name: "NUM_LOCK", value: 115)
!608 = !DIEnumerator(name: "SCROLL", value: 116)
!609 = !DIEnumerator(name: "LEFT_SHIFT", value: 117)
!610 = !DIEnumerator(name: "RIGHT_SHIFT", value: 118)
!611 = !DIEnumerator(name: "LEFT_CTRL", value: 119)
!612 = !DIEnumerator(name: "RIGHT_CTRL", value: 120)
!613 = !DIEnumerator(name: "LEFT_MENU", value: 121)
!614 = !DIEnumerator(name: "RIGHT_MENU", value: 122)
!615 = !DIEnumerator(name: "BROWSER_BACK", value: 123)
!616 = !DIEnumerator(name: "BROWSER_FORWARD", value: 124)
!617 = !DIEnumerator(name: "BROWER_REFRESH", value: 125)
!618 = !DIEnumerator(name: "BROWSER_STOP", value: 126)
!619 = !DIEnumerator(name: "BROWSER_SEARCH", value: 127)
!620 = !DIEnumerator(name: "BROWSER_FAVORITES", value: 128)
!621 = !DIEnumerator(name: "BROWSER_HOME", value: 129)
!622 = !DIEnumerator(name: "VOLUME_MUTE", value: 130)
!623 = !DIEnumerator(name: "VOLUME_DOWN", value: 131)
!624 = !DIEnumerator(name: "VOLUME_UP", value: 132)
!625 = !DIEnumerator(name: "MEDIA_NEXT_TRACK", value: 133)
!626 = !DIEnumerator(name: "MEDIA_PRE_VTRACK", value: 134)
!627 = !DIEnumerator(name: "MEDIA_STOP", value: 135)
!628 = !DIEnumerator(name: "MEDIA_PLAY_PAUSE", value: 136)
!629 = !DIEnumerator(name: "LAUNCH_MAIL", value: 137)
!630 = !DIEnumerator(name: "SELECT_MEDIA", value: 138)
!631 = !DIEnumerator(name: "LAUNCH_APP1", value: 139)
!632 = !DIEnumerator(name: "LAUNCH_APP2", value: 140)
!633 = !DIEnumerator(name: "OEM1", value: 141)
!634 = !DIEnumerator(name: "OEM_PLUS", value: 142)
!635 = !DIEnumerator(name: "OEM_COMMA", value: 143)
!636 = !DIEnumerator(name: "OEM_MINUS", value: 144)
!637 = !DIEnumerator(name: "OEM_PERIOD", value: 145)
!638 = !DIEnumerator(name: "OEM_QUESTION", value: 146)
!639 = !DIEnumerator(name: "OEM_TILDE", value: 147)
!640 = !DIEnumerator(name: "OEM_OPEN_BRACKET", value: 148)
!641 = !DIEnumerator(name: "OEM_PIPE", value: 149)
!642 = !DIEnumerator(name: "OEM_CLOSE_BRACKET", value: 150)
!643 = !DIEnumerator(name: "OEM_QUOTES", value: 151)
!644 = !DIEnumerator(name: "OEM8", value: 152)
!645 = !DIEnumerator(name: "OEM_BACK_SLASH", value: 153)
!646 = !DIEnumerator(name: "PROCESS", value: 154)
!647 = !DIEnumerator(name: "PACKET", value: 155)
!648 = !DIEnumerator(name: "ATTN", value: 156)
!649 = !DIEnumerator(name: "CRSEL", value: 157)
!650 = !DIEnumerator(name: "EXSEL", value: 158)
!651 = !DIEnumerator(name: "ERASE_EOF", value: 159)
!652 = !DIEnumerator(name: "PLAY", value: 160)
!653 = !DIEnumerator(name: "ZOOM", value: 161)
!654 = !DIEnumerator(name: "NONAME", value: 162)
!655 = !DIEnumerator(name: "PA1", value: 163)
!656 = !DIEnumerator(name: "OEM_CLEAR", value: 164)
!657 = !DIEnumerator(name: "KEY_CODE", value: 165)
!658 = !DIEnumerator(name: "SHIFT_MODIFIER", value: 166)
!659 = !DIEnumerator(name: "CTRL_MODIFIER", value: 167)
!660 = !DIEnumerator(name: "ALT_MODIFIER", value: 168)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !486, file: !2, line: 51, baseType: !490, size: 32, align: 32, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "keyValue", scope: !486, file: !2, line: 52, baseType: !86, size: 32, align: 32, offset: 96)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "altPressed", scope: !486, file: !2, line: 53, baseType: !3, size: 8, align: 8, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ctrlPressed", scope: !486, file: !2, line: 54, baseType: !3, size: 8, align: 8, offset: 136)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "shiftPressed", scope: !486, file: !2, line: 55, baseType: !3, size: 8, align: 8, offset: 144)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "supressKey", scope: !486, file: !2, line: 56, baseType: !3, size: 8, align: 8, offset: 152)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "onKeyUp", scope: !42, file: !2, line: 99, baseType: !481, size: 64, align: 64, offset: 2368)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "onKeyPress", scope: !42, file: !2, line: 100, baseType: !481, size: 64, align: 64, offset: 2432)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_idNum", scope: !32, file: !2, line: 24, baseType: !29, size: 64, align: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_parentHwnd", scope: !32, file: !2, line: 25, baseType: !76, size: 64, align: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_isEnabled", scope: !32, file: !2, line: 26, baseType: !3, size: 8, align: 8, offset: 256)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "dummy", linkageName: "std_collections_list$cforms.TimerInfo$.dummy.27878", scope: !2, file: !2, line: 558, type: !86, isLocal: true, isDefinition: true, align: 4)
!674 = !{i32 1, !"CodeView", i32 1}
!675 = !{i32 2, !"Debug Info Version", i32 3}
!676 = !{i32 2, !"wchar_size", i32 2}
!677 = !{i32 4, !"PIC Level", i32 2}
!678 = !{i32 1, !"uwtable", i32 2}
!679 = !{i32 1, !"MaxTLSAlign", i32 65536}
!680 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !681, globals: !682, splitDebugInlining: false)
!681 = !{!45, !108, !159, !179, !192, !203, !209, !306, !350, !463, !490}
!682 = !{!0, !4, !6, !14, !672}
!683 = distinct !DISubprogram(name: "init", linkageName: "std_collections_list$cforms.TimerInfo$.List.init", scope: !2, file: !2, line: 30, type: !684, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!684 = !DISubroutineType(types: !685)
!685 = !{!686, !686, !8, !20}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "List*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!687 = !{}
!688 = !DILocation(line: 31, scope: !683)
!689 = !DILocalVariable(name: "self", arg: 1, scope: !683, file: !2, line: 30, type: !686)
!690 = !DILocation(line: 30, scope: !683)
!691 = !DILocalVariable(name: "allocator", arg: 2, scope: !683, file: !2, line: 30, type: !8)
!692 = !DILocalVariable(name: "initial_capacity", arg: 3, scope: !683, file: !2, line: 30, type: !19)
!693 = !DILocation(line: 32, scope: !683)
!694 = !DILocation(line: 33, scope: !683)
!695 = !DILocation(line: 34, scope: !683)
!696 = !DILocation(line: 35, scope: !683)
!697 = !DILocation(line: 36, scope: !683)
!698 = !DILocation(line: 37, scope: !683)
!699 = distinct !DISubprogram(name: "tinit", linkageName: "std_collections_list$cforms.TimerInfo$.List.tinit", scope: !2, file: !2, line: 46, type: !700, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!700 = !DISubroutineType(types: !701)
!701 = !{!686, !686, !20}
!702 = !DILocation(line: 47, scope: !699)
!703 = !DILocalVariable(name: "self", arg: 1, scope: !699, file: !2, line: 46, type: !686)
!704 = !DILocation(line: 46, scope: !699)
!705 = !DILocalVariable(name: "initial_capacity", arg: 2, scope: !699, file: !2, line: 46, type: !19)
!706 = !DILocation(line: 48, scope: !699)
!707 = distinct !DISubprogram(name: "init_with_array", linkageName: "std_collections_list$cforms.TimerInfo$.List.init_with_array", scope: !2, file: !2, line: 57, type: !708, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!708 = !DISubroutineType(types: !709)
!709 = !{!686, !686, !8, !710}
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "TimerInfo[]", size: 128, align: 64, elements: !711, identifier: "TimerInfo[]")
!711 = !{!712, !714}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !710, baseType: !713, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TimerInfo*", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !710, baseType: !19, size: 64, align: 64, offset: 64)
!715 = !DILocation(line: 58, scope: !707)
!716 = !DILocalVariable(name: "self", arg: 1, scope: !707, file: !2, line: 57, type: !686)
!717 = !DILocation(line: 57, scope: !707)
!718 = !DILocalVariable(name: "allocator", arg: 2, scope: !707, file: !2, line: 57, type: !8)
!719 = !DILocalVariable(name: "values", arg: 3, scope: !707, file: !2, line: 57, type: !720)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type[]", size: 128, align: 64, elements: !721, identifier: "Type[]")
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !720, baseType: !24, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !720, baseType: !19, size: 64, align: 64, offset: 64)
!724 = !DILocation(line: 55, scope: !725)
!725 = distinct !DILexicalBlock(scope: !707, file: !2, line: 58, column: 1)
!726 = !DILocation(line: 59, scope: !707)
!727 = !DILocation(line: 60, scope: !707)
!728 = !DILocation(line: 61, scope: !707)
!729 = distinct !DISubprogram(name: "tinit_with_array", linkageName: "std_collections_list$cforms.TimerInfo$.List.tinit_with_array", scope: !2, file: !2, line: 70, type: !730, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!730 = !DISubroutineType(types: !731)
!731 = !{!686, !686, !710}
!732 = !DILocation(line: 71, scope: !729)
!733 = !DILocalVariable(name: "self", arg: 1, scope: !729, file: !2, line: 70, type: !686)
!734 = !DILocation(line: 70, scope: !729)
!735 = !DILocalVariable(name: "values", arg: 2, scope: !729, file: !2, line: 70, type: !720)
!736 = !DILocation(line: 68, scope: !737)
!737 = distinct !DILexicalBlock(scope: !729, file: !2, line: 71, column: 1)
!738 = !DILocation(line: 72, scope: !729)
!739 = !DILocation(line: 73, scope: !729)
!740 = !DILocation(line: 74, scope: !729)
!741 = distinct !DISubprogram(name: "init_wrapping_array", linkageName: "std_collections_list$cforms.TimerInfo$.List.init_wrapping_array", scope: !2, file: !2, line: 80, type: !742, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !686, !8, !710}
!744 = !DILocation(line: 81, scope: !741)
!745 = !DILocalVariable(name: "self", arg: 1, scope: !741, file: !2, line: 80, type: !686)
!746 = !DILocation(line: 80, scope: !741)
!747 = !DILocalVariable(name: "allocator", arg: 2, scope: !741, file: !2, line: 80, type: !8)
!748 = !DILocalVariable(name: "types", arg: 3, scope: !741, file: !2, line: 80, type: !720)
!749 = !DILocation(line: 78, scope: !750)
!750 = distinct !DILexicalBlock(scope: !741, file: !2, line: 81, column: 1)
!751 = !DILocation(line: 82, scope: !741)
!752 = !DILocation(line: 83, scope: !741)
!753 = !DILocation(line: 84, scope: !741)
!754 = !DILocation(line: 85, scope: !741)
!755 = !DILocation(line: 422, scope: !741)
!756 = distinct !DISubprogram(name: "is_initialized", linkageName: "std_collections_list$cforms.TimerInfo$.List.is_initialized", scope: !2, file: !2, line: 88, type: !757, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!757 = !DISubroutineType(types: !758)
!758 = !{!3, !686}
!759 = !DILocation(line: 88, scope: !756)
!760 = !DILocalVariable(name: "self", arg: 1, scope: !756, file: !2, line: 88, type: !686)
!761 = distinct !DISubprogram(name: "to_format", linkageName: "std_collections_list$cforms.TimerInfo$.List.to_format", scope: !2, file: !2, line: 90, type: !762, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!762 = !DISubroutineType(types: !763)
!763 = !{!764, !765, !686, !766}
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !92)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !767, size: 64, align: 64, dwarfAddressSpace: 0)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 63, size: 320, align: 64, elements: !768, identifier: "std.io.Formatter")
!768 = !{!769, !770, !775}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !767, file: !2, line: 65, baseType: !11, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !767, file: !2, line: 66, baseType: !771, size: 64, align: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 16, baseType: !772, align: 8)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !773, size: 64, align: 64, dwarfAddressSpace: 0)
!773 = !DISubroutineType(types: !774)
!774 = !{!764, !11, !11, !46}
!775 = !DIDerivedType(tag: DW_TAG_member, scope: !767, file: !2, line: 67, baseType: !776, size: 192, align: 64, offset: 128)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !767, file: !2, line: 67, size: 192, align: 64, elements: !777)
!777 = !{!778, !779, !780, !781}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !776, file: !2, line: 69, baseType: !35, size: 32, align: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !776, file: !2, line: 70, baseType: !35, size: 32, align: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !776, file: !2, line: 71, baseType: !35, size: 32, align: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !776, file: !2, line: 72, baseType: !764, size: 64, align: 64, offset: 128)
!782 = !DILocation(line: 91, scope: !761)
!783 = !DILocalVariable(name: "self", arg: 1, scope: !761, file: !2, line: 90, type: !686)
!784 = !DILocation(line: 90, scope: !761)
!785 = !DILocalVariable(name: "formatter", arg: 2, scope: !761, file: !2, line: 90, type: !766)
!786 = !DILocation(line: 92, scope: !787)
!787 = distinct !DILexicalBlock(scope: !761, file: !2, line: 92, column: 2)
!788 = !DILocation(line: 95, scope: !789)
!789 = distinct !DILexicalBlock(scope: !787, file: !2, line: 95, column: 4)
!790 = !DILocation(line: 97, scope: !791)
!791 = distinct !DILexicalBlock(scope: !787, file: !2, line: 97, column: 4)
!792 = !DILocalVariable(name: "n", scope: !793, file: !2, line: 99, type: !19, align: 8)
!793 = distinct !DILexicalBlock(scope: !787, file: !2, line: 99, column: 4)
!794 = !DILocation(line: 99, scope: !793)
!795 = !DILocation(line: 100, scope: !796)
!796 = distinct !DILexicalBlock(scope: !793, file: !2, line: 100, column: 4)
!797 = !DILocalVariable(name: ".temp", scope: !796, file: !2, line: 100, type: !19, align: 8)
!798 = !DILocalVariable(name: "i", scope: !799, file: !2, line: 100, type: !19, align: 8)
!799 = distinct !DILexicalBlock(scope: !796, file: !2, line: 101, column: 4)
!800 = !DILocation(line: 100, scope: !799)
!801 = !DILocalVariable(name: "element", scope: !799, file: !2, line: 100, type: !26, align: 8)
!802 = !DILocation(line: 102, scope: !803)
!803 = distinct !DILexicalBlock(scope: !799, file: !2, line: 101, column: 4)
!804 = !DILocation(line: 103, scope: !803)
!805 = !DILocation(line: 105, scope: !793)
!806 = !DILocation(line: 106, scope: !793)
!807 = distinct !DISubprogram(name: "push", linkageName: "std_collections_list$cforms.TimerInfo$.List.push", scope: !2, file: !2, line: 110, type: !808, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !686, !26}
!810 = !DILocation(line: 111, scope: !807)
!811 = !DILocalVariable(name: "self", arg: 1, scope: !807, file: !2, line: 110, type: !686)
!812 = !DILocation(line: 110, scope: !807)
!813 = !DILocalVariable(name: "element", arg: 2, scope: !807, file: !2, line: 110, type: !25)
!814 = !DILocation(line: 112, scope: !807)
!815 = !DILocation(line: 113, scope: !807)
!816 = !DILocation(line: 422, scope: !807)
!817 = distinct !DISubprogram(name: "pop", linkageName: "std_collections_list$cforms.TimerInfo$.List.pop", scope: !2, file: !2, line: 116, type: !818, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!818 = !DISubroutineType(types: !819)
!819 = !{!764, !24, !686}
!820 = !DILocation(line: 117, scope: !817)
!821 = !DILocalVariable(name: "self", arg: 1, scope: !817, file: !2, line: 116, type: !686)
!822 = !DILocation(line: 116, scope: !817)
!823 = !DILocation(line: 118, scope: !817)
!824 = !DILocation(line: 120, scope: !817)
!825 = !DILocation(line: 119, scope: !826)
!826 = distinct !DILexicalBlock(scope: !817, file: !2, line: 119, column: 8)
!827 = !DILocation(line: 422, scope: !826)
!828 = distinct !DISubprogram(name: "clear", linkageName: "std_collections_list$cforms.TimerInfo$.List.clear", scope: !2, file: !2, line: 123, type: !829, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !686}
!831 = !DILocation(line: 124, scope: !828)
!832 = !DILocalVariable(name: "self", arg: 1, scope: !828, file: !2, line: 123, type: !686)
!833 = !DILocation(line: 123, scope: !828)
!834 = !DILocation(line: 125, scope: !828)
!835 = !DILocation(line: 422, scope: !828)
