; ModuleID = 'std_collections_list$p$cforms.ListViewColumn$'
source_filename = "std_collections_list$p$cforms.ListViewColumn$"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }
%"char[]" = type { ptr, i64 }
%"ListViewColumn*[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$"std_collections_list$p$cforms.ListViewColumn$.List.init" = comdat any

$"std_collections_list$p$cforms.ListViewColumn$.List.tinit" = comdat any

$"std_collections_list$p$cforms.ListViewColumn$.List.init_with_array" = comdat any

$"std_collections_list$p$cforms.ListViewColumn$.List.tinit_with_array" = comdat any

$"std_collections_list$p$cforms.ListViewColumn$.List.init_wrapping_array" = comdat any

$"std_collections_list$p$cforms.ListViewColumn$.List.is_initialized" = comdat any

$"std_collections_list$p$cforms.ListViewColumn$.List.to_format" = comdat any

$"std_collections_list$p$cforms.ListViewColumn$.List.push" = comdat any

$"std_collections_list$p$cforms.ListViewColumn$.List.pop" = comdat any

$"std_collections_list$p$cforms.ListViewColumn$.List.clear" = comdat any

$"std_collections_list$p$cforms.ListViewColumn$.List.pop_first" = comdat any

$"std_collections_list$p$cforms.ListViewColumn$.List.remove_at" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ELEMENT_IS_EQUATABLE", linkageName: "std_collections_list$p$cforms.ListViewColumn$.ELEMENT_IS_EQUATABLE", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 1)
!2 = !DIFile(filename: "list.c3", directory: "C:/Compilers/C3/lib/std/collections")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "ELEMENT_IS_POINTER", linkageName: "std_collections_list$p$cforms.ListViewColumn$.ELEMENT_IS_POINTER", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 1)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "LIST_HEAP_ALLOCATOR", linkageName: "std_collections_list$p$cforms.ListViewColumn$.LIST_HEAP_ALLOCATOR", scope: !2, file: !2, line: 12, type: !8, isLocal: false, isDefinition: true, align: 8)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !9, identifier: "Allocator")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !8, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "ONHEAP", linkageName: "std_collections_list$p$cforms.ListViewColumn$.ONHEAP", scope: !2, file: !2, line: 14, type: !16, isLocal: false, isDefinition: true, align: 8)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !17, identifier: "std_collections_list$p$cforms.ListViewColumn$.List")
!17 = !{!18, !21, !22, !23}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !16, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !20)
!20 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !16, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !16, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !16, file: !2, line: 23, baseType: !24, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 50, baseType: !26, align: 8)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ListViewColumn*", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "ListViewColumn", scope: !2, file: !2, line: 109, size: 640, align: 64, elements: !28, identifier: "cforms.ListViewColumn")
!28 = !{!29, !30, !31, !32, !33, !40, !41, !48, !49, !56, !58, !59, !60, !61, !63, !67}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_drawNeeded", scope: !27, file: !2, line: 111, baseType: !3, size: 8, align: 8)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_isHotItem", scope: !27, file: !2, line: 112, baseType: !3, size: 8, align: 8, offset: 8)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "imgOnRight", scope: !27, file: !2, line: 113, baseType: !3, size: 8, align: 8, offset: 16)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hasImage", scope: !27, file: !2, line: 114, baseType: !3, size: 8, align: 8, offset: 24)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "textAlign", scope: !27, file: !2, line: 115, baseType: !34, size: 8, align: 8, offset: 32)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !27, file: !2, line: 170, baseType: !35, size: 8, align: 8, elements: !36)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "LEFT", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "RIGHT", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "CENTER", value: 2, isUnsigned: true)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "hdrTextAlign", scope: !27, file: !2, line: 116, baseType: !34, size: 8, align: 8, offset: 40)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", scope: !27, file: !2, line: 117, baseType: !42, size: 64, align: 32, offset: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", scope: !27, file: !2, line: 14, size: 64, align: 32, elements: !43, identifier: "cforms.Color")
!43 = !{!44, !46}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !42, file: !2, line: 16, baseType: !45, size: 32, align: 32)
!45 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !42, file: !2, line: 17, baseType: !47, size: 32, align: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colorref", scope: !2, file: !2, line: 36, baseType: !45, align: 4)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", scope: !27, file: !2, line: 118, baseType: !42, size: 64, align: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !27, file: !2, line: 119, baseType: !50, size: 128, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !52, identifier: "char[]")
!52 = !{!53, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !51, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !51, baseType: !19, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !27, file: !2, line: 120, baseType: !57, size: 32, align: 32, offset: 320)
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !27, file: !2, line: 121, baseType: !57, size: 32, align: 32, offset: 352)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "imgIndex", scope: !27, file: !2, line: 122, baseType: !57, size: 32, align: 32, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_order", scope: !27, file: !2, line: 123, baseType: !57, size: 32, align: 32, offset: 416)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_hdrTxtFlag", scope: !27, file: !2, line: 124, baseType: !62, size: 32, align: 32, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dword", scope: !2, file: !2, line: 34, baseType: !45, align: 4)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_wideText", scope: !27, file: !2, line: 125, baseType: !64, size: 64, align: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Char16*", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char16", scope: !2, file: !2, line: 33, baseType: !66, align: 2)
!66 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "lvc", scope: !27, file: !2, line: 126, baseType: !68, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "LVColumn*", baseType: !69, size: 64, align: 64, dwarfAddressSpace: 0)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "LVColumn", scope: !2, file: !2, line: 226, size: 448, align: 64, elements: !70, identifier: "cforms.LVColumn")
!70 = !{!71, !72, !73, !74, !77, !78, !79, !80, !81, !82, !83}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !69, file: !2, line: 227, baseType: !45, size: 32, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !69, file: !2, line: 228, baseType: !57, size: 32, align: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !69, file: !2, line: 229, baseType: !57, size: 32, align: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pszText", scope: !69, file: !2, line: 230, baseType: !75, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lpcwstr", scope: !2, file: !2, line: 27, baseType: !76, align: 8)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ushort*", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "cchTextMax", scope: !69, file: !2, line: 231, baseType: !57, size: 32, align: 32, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "iSubItem", scope: !69, file: !2, line: 232, baseType: !57, size: 32, align: 32, offset: 224)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "iImage", scope: !69, file: !2, line: 233, baseType: !57, size: 32, align: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "iOrder", scope: !69, file: !2, line: 234, baseType: !57, size: 32, align: 32, offset: 288)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cxMin", scope: !69, file: !2, line: 235, baseType: !57, size: 32, align: 32, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "cxDefault", scope: !69, file: !2, line: 236, baseType: !57, size: 32, align: 32, offset: 352)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "cxIdeal", scope: !69, file: !2, line: 237, baseType: !57, size: 32, align: 32, offset: 384)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "dummy", linkageName: "std_collections_list$p$cforms.ListViewColumn$.dummy.28618", scope: !2, file: !2, line: 558, type: !57, isLocal: true, isDefinition: true, align: 4)
!86 = !{i32 1, !"CodeView", i32 1}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{i32 2, !"wchar_size", i32 2}
!89 = !{i32 4, !"PIC Level", i32 2}
!90 = !{i32 1, !"uwtable", i32 2}
!91 = !{i32 1, !"MaxTLSAlign", i32 65536}
!92 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !93, globals: !94, splitDebugInlining: false)
!93 = !{!34}
!94 = !{!0, !4, !6, !14, !84}
!95 = distinct !DISubprogram(name: "init", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.init", scope: !2, file: !2, line: 30, type: !96, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !98, !8, !20}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "List*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!99 = !{}
!100 = !DILocation(line: 31, scope: !95)
!101 = !DILocalVariable(name: "self", arg: 1, scope: !95, file: !2, line: 30, type: !98)
!102 = !DILocation(line: 30, scope: !95)
!103 = !DILocalVariable(name: "allocator", arg: 2, scope: !95, file: !2, line: 30, type: !8)
!104 = !DILocalVariable(name: "initial_capacity", arg: 3, scope: !95, file: !2, line: 30, type: !19)
!105 = !DILocation(line: 32, scope: !95)
!106 = !DILocation(line: 33, scope: !95)
!107 = !DILocation(line: 34, scope: !95)
!108 = !DILocation(line: 35, scope: !95)
!109 = !DILocation(line: 36, scope: !95)
!110 = !DILocation(line: 37, scope: !95)
!111 = distinct !DISubprogram(name: "tinit", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.tinit", scope: !2, file: !2, line: 46, type: !112, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!112 = !DISubroutineType(types: !113)
!113 = !{!98, !98, !20}
!114 = !DILocation(line: 47, scope: !111)
!115 = !DILocalVariable(name: "self", arg: 1, scope: !111, file: !2, line: 46, type: !98)
!116 = !DILocation(line: 46, scope: !111)
!117 = !DILocalVariable(name: "initial_capacity", arg: 2, scope: !111, file: !2, line: 46, type: !19)
!118 = !DILocation(line: 48, scope: !111)
!119 = distinct !DISubprogram(name: "init_with_array", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.init_with_array", scope: !2, file: !2, line: 57, type: !120, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!120 = !DISubroutineType(types: !121)
!121 = !{!98, !98, !8, !122}
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "ListViewColumn*[]", size: 128, align: 64, elements: !123, identifier: "ListViewColumn*[]")
!123 = !{!124, !126}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !122, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ListViewColumn**", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !122, baseType: !19, size: 64, align: 64, offset: 64)
!127 = !DILocation(line: 58, scope: !119)
!128 = !DILocalVariable(name: "self", arg: 1, scope: !119, file: !2, line: 57, type: !98)
!129 = !DILocation(line: 57, scope: !119)
!130 = !DILocalVariable(name: "allocator", arg: 2, scope: !119, file: !2, line: 57, type: !8)
!131 = !DILocalVariable(name: "values", arg: 3, scope: !119, file: !2, line: 57, type: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type[]", size: 128, align: 64, elements: !133, identifier: "Type[]")
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !132, baseType: !24, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !132, baseType: !19, size: 64, align: 64, offset: 64)
!136 = !DILocation(line: 55, scope: !137)
!137 = distinct !DILexicalBlock(scope: !119, file: !2, line: 58, column: 1)
!138 = !DILocation(line: 59, scope: !119)
!139 = !DILocation(line: 60, scope: !119)
!140 = !DILocation(line: 61, scope: !119)
!141 = distinct !DISubprogram(name: "tinit_with_array", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.tinit_with_array", scope: !2, file: !2, line: 70, type: !142, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!142 = !DISubroutineType(types: !143)
!143 = !{!98, !98, !122}
!144 = !DILocation(line: 71, scope: !141)
!145 = !DILocalVariable(name: "self", arg: 1, scope: !141, file: !2, line: 70, type: !98)
!146 = !DILocation(line: 70, scope: !141)
!147 = !DILocalVariable(name: "values", arg: 2, scope: !141, file: !2, line: 70, type: !132)
!148 = !DILocation(line: 68, scope: !149)
!149 = distinct !DILexicalBlock(scope: !141, file: !2, line: 71, column: 1)
!150 = !DILocation(line: 72, scope: !141)
!151 = !DILocation(line: 73, scope: !141)
!152 = !DILocation(line: 74, scope: !141)
!153 = distinct !DISubprogram(name: "init_wrapping_array", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.init_wrapping_array", scope: !2, file: !2, line: 80, type: !154, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !98, !8, !122}
!156 = !DILocation(line: 81, scope: !153)
!157 = !DILocalVariable(name: "self", arg: 1, scope: !153, file: !2, line: 80, type: !98)
!158 = !DILocation(line: 80, scope: !153)
!159 = !DILocalVariable(name: "allocator", arg: 2, scope: !153, file: !2, line: 80, type: !8)
!160 = !DILocalVariable(name: "types", arg: 3, scope: !153, file: !2, line: 80, type: !132)
!161 = !DILocation(line: 78, scope: !162)
!162 = distinct !DILexicalBlock(scope: !153, file: !2, line: 81, column: 1)
!163 = !DILocation(line: 82, scope: !153)
!164 = !DILocation(line: 83, scope: !153)
!165 = !DILocation(line: 84, scope: !153)
!166 = !DILocation(line: 85, scope: !153)
!167 = !DILocation(line: 422, scope: !153)
!168 = distinct !DISubprogram(name: "is_initialized", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.is_initialized", scope: !2, file: !2, line: 88, type: !169, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!169 = !DISubroutineType(types: !170)
!170 = !{!3, !98}
!171 = !DILocation(line: 88, scope: !168)
!172 = !DILocalVariable(name: "self", arg: 1, scope: !168, file: !2, line: 88, type: !98)
!173 = distinct !DISubprogram(name: "to_format", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.to_format", scope: !2, file: !2, line: 90, type: !174, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !178, !98, !179}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !177)
!177 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !180, size: 64, align: 64, dwarfAddressSpace: 0)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 63, size: 320, align: 64, elements: !181, identifier: "std.io.Formatter")
!181 = !{!182, !183, !188}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !180, file: !2, line: 65, baseType: !11, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !180, file: !2, line: 66, baseType: !184, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 16, baseType: !185, align: 8)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !186, size: 64, align: 64, dwarfAddressSpace: 0)
!186 = !DISubroutineType(types: !187)
!187 = !{!176, !11, !11, !35}
!188 = !DIDerivedType(tag: DW_TAG_member, scope: !180, file: !2, line: 67, baseType: !189, size: 192, align: 64, offset: 128)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !180, file: !2, line: 67, size: 192, align: 64, elements: !190)
!190 = !{!191, !192, !193, !194}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !189, file: !2, line: 69, baseType: !45, size: 32, align: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !189, file: !2, line: 70, baseType: !45, size: 32, align: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !189, file: !2, line: 71, baseType: !45, size: 32, align: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !189, file: !2, line: 72, baseType: !176, size: 64, align: 64, offset: 128)
!195 = !DILocation(line: 91, scope: !173)
!196 = !DILocalVariable(name: "self", arg: 1, scope: !173, file: !2, line: 90, type: !98)
!197 = !DILocation(line: 90, scope: !173)
!198 = !DILocalVariable(name: "formatter", arg: 2, scope: !173, file: !2, line: 90, type: !179)
!199 = !DILocation(line: 92, scope: !200)
!200 = distinct !DILexicalBlock(scope: !173, file: !2, line: 92, column: 2)
!201 = !DILocation(line: 95, scope: !202)
!202 = distinct !DILexicalBlock(scope: !200, file: !2, line: 95, column: 4)
!203 = !DILocation(line: 97, scope: !204)
!204 = distinct !DILexicalBlock(scope: !200, file: !2, line: 97, column: 4)
!205 = !DILocalVariable(name: "n", scope: !206, file: !2, line: 99, type: !19, align: 8)
!206 = distinct !DILexicalBlock(scope: !200, file: !2, line: 99, column: 4)
!207 = !DILocation(line: 99, scope: !206)
!208 = !DILocation(line: 100, scope: !209)
!209 = distinct !DILexicalBlock(scope: !206, file: !2, line: 100, column: 4)
!210 = !DILocalVariable(name: ".temp", scope: !209, file: !2, line: 100, type: !19, align: 8)
!211 = !DILocalVariable(name: "i", scope: !212, file: !2, line: 100, type: !19, align: 8)
!212 = distinct !DILexicalBlock(scope: !209, file: !2, line: 101, column: 4)
!213 = !DILocation(line: 100, scope: !212)
!214 = !DILocalVariable(name: "element", scope: !212, file: !2, line: 100, type: !26, align: 8)
!215 = !DILocation(line: 102, scope: !216)
!216 = distinct !DILexicalBlock(scope: !212, file: !2, line: 101, column: 4)
!217 = !DILocation(line: 103, scope: !216)
!218 = !DILocation(line: 105, scope: !206)
!219 = !DILocation(line: 106, scope: !206)
!220 = distinct !DISubprogram(name: "push", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.push", scope: !2, file: !2, line: 110, type: !221, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !98, !26}
!223 = !DILocation(line: 111, scope: !220)
!224 = !DILocalVariable(name: "self", arg: 1, scope: !220, file: !2, line: 110, type: !98)
!225 = !DILocation(line: 110, scope: !220)
!226 = !DILocalVariable(name: "element", arg: 2, scope: !220, file: !2, line: 110, type: !25)
!227 = !DILocation(line: 112, scope: !220)
!228 = !DILocation(line: 113, scope: !220)
!229 = !DILocation(line: 422, scope: !220)
!230 = distinct !DISubprogram(name: "pop", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.pop", scope: !2, file: !2, line: 116, type: !231, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!231 = !DISubroutineType(types: !232)
!232 = !{!176, !24, !98}
!233 = !DILocation(line: 117, scope: !230)
!234 = !DILocalVariable(name: "self", arg: 1, scope: !230, file: !2, line: 116, type: !98)
!235 = !DILocation(line: 116, scope: !230)
!236 = !DILocation(line: 118, scope: !230)
!237 = !DILocation(line: 120, scope: !230)
!238 = !DILocation(line: 119, scope: !239)
!239 = distinct !DILexicalBlock(scope: !230, file: !2, line: 119, column: 8)
!240 = !DILocation(line: 422, scope: !239)
!241 = distinct !DISubprogram(name: "clear", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.clear", scope: !2, file: !2, line: 123, type: !242, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !98}
!244 = !DILocation(line: 124, scope: !241)
!245 = !DILocalVariable(name: "self", arg: 1, scope: !241, file: !2, line: 123, type: !98)
!246 = !DILocation(line: 123, scope: !241)
!247 = !DILocation(line: 125, scope: !241)
!248 = !DILocation(line: 422, scope: !241)
!249 = distinct !DISubprogram(name: "pop_first", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.pop_first", scope: !2, file: !2, line: 128, type: !231, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!250 = !DILocation(line: 129, scope: !249)
!251 = !DILocalVariable(name: "self", arg: 1, scope: !249, file: !2, line: 128, type: !98)
!252 = !DILocation(line: 128, scope: !249)
!253 = !DILocation(line: 130, scope: !249)
!254 = !DILocation(line: 132, scope: !249)
!255 = !DILocation(line: 131, scope: !256)
!256 = distinct !DILexicalBlock(scope: !249, file: !2, line: 131, column: 8)
!257 = !DILocation(line: 136, scope: !256)
!258 = distinct !DISubprogram(name: "remove_at", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.remove_at", scope: !2, file: !2, line: 138, type: !259, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !98, !20}
!261 = !DILocation(line: 139, scope: !258)
!262 = !DILocalVariable(name: "self", arg: 1, scope: !258, file: !2, line: 138, type: !98)
!263 = !DILocation(line: 138, scope: !258)
!264 = !DILocalVariable(name: "index", arg: 2, scope: !258, file: !2, line: 138, type: !19)
!265 = !DILocation(line: 136, scope: !266)
!266 = distinct !DILexicalBlock(scope: !258, file: !2, line: 139, column: 1)
!267 = !DILocation(line: 140, scope: !258)
!268 = !DILocation(line: 422, scope: !258)
!269 = !DILocation(line: 141, scope: !258)
!270 = !DILocation(line: 142, scope: !258)
!271 = distinct !DISubprogram(name: "add_all", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.add_all", scope: !2, file: !2, line: 145, type: !272, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !98, !98}
!274 = !DILocation(line: 146, scope: !271)
!275 = !DILocalVariable(name: "self", arg: 1, scope: !271, file: !2, line: 145, type: !98)
!276 = !DILocation(line: 145, scope: !271)
!277 = !DILocalVariable(name: "other_list", arg: 2, scope: !271, file: !2, line: 145, type: !98)
!278 = !DILocation(line: 147, scope: !271)
!279 = !DILocation(line: 148, scope: !271)
!280 = !DILocalVariable(name: "index", scope: !271, file: !2, line: 149, type: !19, align: 8)
!281 = !DILocation(line: 149, scope: !271)
!282 = !DILocation(line: 422, scope: !271)
!283 = !DILocation(line: 150, scope: !284)
!284 = distinct !DILexicalBlock(scope: !271, file: !2, line: 150, column: 2)
!285 = !DILocalVariable(name: ".temp", scope: !284, file: !2, line: 150, type: !19, align: 8)
!286 = !DILocalVariable(name: "value", scope: !287, file: !2, line: 150, type: !24, align: 8)
!287 = distinct !DILexicalBlock(scope: !284, file: !2, line: 151, column: 2)
!288 = !DILocation(line: 150, scope: !287)
!289 = !DILocation(line: 384, scope: !287)
!290 = !DILocation(line: 152, scope: !291)
!291 = distinct !DILexicalBlock(scope: !287, file: !2, line: 151, column: 2)
!292 = distinct !DISubprogram(name: "to_aligned_array", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.to_aligned_array", scope: !2, file: !2, line: 160, type: !293, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!293 = !DISubroutineType(types: !294)
!294 = !{!132, !98, !8}
!295 = !DILocation(line: 161, scope: !292)
!296 = !DILocalVariable(name: "self", arg: 1, scope: !292, file: !2, line: 160, type: !98)
!297 = !DILocation(line: 160, scope: !292)
!298 = !DILocalVariable(name: "allocator", arg: 2, scope: !292, file: !2, line: 160, type: !8)
!299 = !DILocation(line: 8, scope: !300, inlinedAt: !302)
!300 = distinct !DISubprogram(name: "list_to_aligned_array", linkageName: "list_to_aligned_array", scope: !301, file: !301, line: 6, scopeLine: 6, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !99)
!301 = !DIFile(filename: "list_common.c3", directory: "C:/Compilers/C3/lib/std/collections")
!302 = !DILocation(line: 162, scope: !292)
!303 = !DILocalVariable(name: "result", scope: !300, file: !2, line: 9, type: !122, align: 8)
!304 = !DILocation(line: 9, scope: !300, inlinedAt: !302)
!305 = !DILocation(line: 296, scope: !306, inlinedAt: !304)
!306 = distinct !DISubprogram(name: "alloc_array_aligned", linkageName: "alloc_array_aligned", scope: !307, file: !307, line: 294, scopeLine: 294, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92)
!307 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Compilers/C3/lib/std/core")
!308 = !DILocation(line: 128, scope: !309, inlinedAt: !305)
!309 = distinct !DISubprogram(name: "malloc_aligned", linkageName: "malloc_aligned", scope: !307, file: !307, line: 126, scopeLine: 126, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92)
!310 = !DILocation(line: 134, scope: !309, inlinedAt: !305)
!311 = !DILocation(line: 38, scope: !309, inlinedAt: !305)
!312 = !DILocation(line: 975, scope: !313, inlinedAt: !311)
!313 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !314, file: !314, line: 973, scopeLine: 973, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92)
!314 = !DIFile(filename: "math.c3", directory: "C:/Compilers/C3/lib/std/math")
!315 = !DILocation(line: 10, scope: !300, inlinedAt: !302)
!316 = !DILocation(line: 11, scope: !300, inlinedAt: !302)
!317 = distinct !DISubprogram(name: "to_tarray", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.to_tarray", scope: !2, file: !2, line: 173, type: !318, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!318 = !DISubroutineType(types: !319)
!319 = !{!132, !98}
!320 = !DILocation(line: 174, scope: !317)
!321 = !DILocalVariable(name: "self", arg: 1, scope: !317, file: !2, line: 173, type: !98)
!322 = !DILocation(line: 173, scope: !317)
!323 = !DILocation(line: 178, scope: !317)
!324 = !DILocation(line: 168, scope: !325, inlinedAt: !323)
!325 = distinct !DILexicalBlock(scope: !326, file: !2, line: 169, column: 1)
!326 = distinct !DISubprogram(name: "to_array", linkageName: "to_array", scope: !2, file: !2, line: 168, scopeLine: 168, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92)
!327 = !DILocation(line: 16, scope: !328, inlinedAt: !329)
!328 = distinct !DISubprogram(name: "list_to_array", linkageName: "list_to_array", scope: !301, file: !301, line: 14, scopeLine: 14, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !99)
!329 = !DILocation(line: 170, scope: !326, inlinedAt: !323)
!330 = !DILocalVariable(name: "result", scope: !328, file: !2, line: 17, type: !122, align: 8)
!331 = !DILocation(line: 17, scope: !328, inlinedAt: !329)
!332 = !DILocation(line: 304, scope: !333, inlinedAt: !334)
!333 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !307, file: !307, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92)
!334 = !DILocation(line: 287, scope: !335, inlinedAt: !331)
!335 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !307, file: !307, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92)
!336 = !DILocation(line: 80, scope: !337, inlinedAt: !332)
!337 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !307, file: !307, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92)
!338 = !DILocation(line: 86, scope: !337, inlinedAt: !332)
!339 = !DILocation(line: 38, scope: !337, inlinedAt: !332)
!340 = !DILocation(line: 975, scope: !341, inlinedAt: !339)
!341 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !314, file: !314, line: 973, scopeLine: 973, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92)
!342 = !DILocation(line: 18, scope: !328, inlinedAt: !329)
!343 = !DILocation(line: 19, scope: !328, inlinedAt: !329)
!344 = distinct !DISubprogram(name: "reverse", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.reverse", scope: !2, file: !2, line: 185, type: !242, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!345 = !DILocation(line: 186, scope: !344)
!346 = !DILocalVariable(name: "self", arg: 1, scope: !344, file: !2, line: 185, type: !98)
!347 = !DILocation(line: 185, scope: !344)
!348 = !DILocation(line: 24, scope: !349, inlinedAt: !350)
!349 = distinct !DISubprogram(name: "list_reverse", linkageName: "list_reverse", scope: !301, file: !301, line: 22, scopeLine: 22, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !99)
!350 = !DILocation(line: 187, scope: !344)
!351 = !DILocalVariable(name: "half", scope: !349, file: !2, line: 25, type: !19, align: 8)
!352 = !DILocation(line: 25, scope: !349, inlinedAt: !350)
!353 = !DILocalVariable(name: "end", scope: !349, file: !2, line: 26, type: !19, align: 8)
!354 = !DILocation(line: 26, scope: !349, inlinedAt: !350)
!355 = !DILocalVariable(name: "i", scope: !356, file: !2, line: 27, type: !19, align: 8)
!356 = distinct !DILexicalBlock(scope: !349, file: !301, line: 27, column: 2)
!357 = !DILocation(line: 27, scope: !356, inlinedAt: !350)
!358 = !DILocalVariable(name: "temp", scope: !359, file: !2, line: 79, type: !26, align: 8)
!359 = distinct !DISubprogram(name: "@swap", linkageName: "@swap", scope: !360, file: !360, line: 77, scopeLine: 77, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !99)
!360 = !DIFile(filename: "builtin.c3", directory: "C:/Compilers/C3/lib/std/core")
!361 = !DILocation(line: 79, scope: !359, inlinedAt: !362)
!362 = !DILocation(line: 29, scope: !363, inlinedAt: !350)
!363 = distinct !DILexicalBlock(scope: !356, file: !301, line: 28, column: 2)
!364 = !DILocation(line: 29, scope: !359, inlinedAt: !362)
!365 = distinct !DISubprogram(name: "array_view", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.array_view", scope: !2, file: !2, line: 190, type: !318, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!366 = !DILocation(line: 191, scope: !365)
!367 = !DILocalVariable(name: "self", arg: 1, scope: !365, file: !2, line: 190, type: !98)
!368 = !DILocation(line: 190, scope: !365)
!369 = !DILocation(line: 192, scope: !365)
!370 = distinct !DISubprogram(name: "add_array", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.add_array", scope: !2, file: !2, line: 201, type: !371, scopeLine: 201, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !98, !122}
!373 = !DILocation(line: 202, scope: !370)
!374 = !DILocalVariable(name: "self", arg: 1, scope: !370, file: !2, line: 201, type: !98)
!375 = !DILocation(line: 201, scope: !370)
!376 = !DILocalVariable(name: "array", arg: 2, scope: !370, file: !2, line: 201, type: !132)
!377 = !DILocation(line: 203, scope: !370)
!378 = !DILocation(line: 199, scope: !370)
!379 = !DILocation(line: 204, scope: !370)
!380 = !DILocalVariable(name: "index", scope: !370, file: !2, line: 205, type: !19, align: 8)
!381 = !DILocation(line: 205, scope: !370)
!382 = !DILocation(line: 422, scope: !370)
!383 = !DILocation(line: 206, scope: !370)
!384 = distinct !DISubprogram(name: "push_front", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.push_front", scope: !2, file: !2, line: 209, type: !221, scopeLine: 209, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!385 = !DILocation(line: 210, scope: !384)
!386 = !DILocalVariable(name: "self", arg: 1, scope: !384, file: !2, line: 209, type: !98)
!387 = !DILocation(line: 209, scope: !384)
!388 = !DILocalVariable(name: "type", arg: 2, scope: !384, file: !2, line: 209, type: !25)
!389 = !DILocation(line: 211, scope: !384)
!390 = !DILocation(line: 215, scope: !384)
!391 = distinct !DISubprogram(name: "insert_at", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.insert_at", scope: !2, file: !2, line: 217, type: !392, scopeLine: 217, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !98, !20, !26}
!394 = !DILocation(line: 218, scope: !391)
!395 = !DILocalVariable(name: "self", arg: 1, scope: !391, file: !2, line: 217, type: !98)
!396 = !DILocation(line: 217, scope: !391)
!397 = !DILocalVariable(name: "index", arg: 2, scope: !391, file: !2, line: 217, type: !19)
!398 = !DILocalVariable(name: "type", arg: 3, scope: !391, file: !2, line: 217, type: !25)
!399 = !DILocation(line: 215, scope: !400)
!400 = distinct !DILexicalBlock(scope: !391, file: !2, line: 218, column: 1)
!401 = !DILocation(line: 219, scope: !391)
!402 = !DILocation(line: 220, scope: !391)
!403 = !DILocation(line: 422, scope: !391)
!404 = !DILocalVariable(name: "i", scope: !405, file: !2, line: 221, type: !406, align: 8)
!405 = distinct !DILexicalBlock(scope: !391, file: !2, line: 221, column: 2)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !177)
!407 = !DILocation(line: 221, scope: !405)
!408 = !DILocation(line: 223, scope: !409)
!409 = distinct !DILexicalBlock(scope: !405, file: !2, line: 222, column: 2)
!410 = !DILocation(line: 225, scope: !391)
!411 = distinct !DISubprogram(name: "set_at", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.set_at", scope: !2, file: !2, line: 231, type: !392, scopeLine: 231, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!412 = !DILocation(line: 232, scope: !411)
!413 = !DILocalVariable(name: "self", arg: 1, scope: !411, file: !2, line: 231, type: !98)
!414 = !DILocation(line: 231, scope: !411)
!415 = !DILocalVariable(name: "index", arg: 2, scope: !411, file: !2, line: 231, type: !19)
!416 = !DILocalVariable(name: "type", arg: 3, scope: !411, file: !2, line: 231, type: !25)
!417 = !DILocation(line: 229, scope: !418)
!418 = distinct !DILexicalBlock(scope: !411, file: !2, line: 232, column: 1)
!419 = !DILocation(line: 233, scope: !411)
!420 = distinct !DISubprogram(name: "remove_last", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.remove_last", scope: !2, file: !2, line: 236, type: !421, scopeLine: 236, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!421 = !DISubroutineType(types: !422)
!422 = !{!176, !11, !98}
!423 = !DILocation(line: 237, scope: !420)
!424 = !DILocalVariable(name: "self", arg: 1, scope: !420, file: !2, line: 236, type: !98)
!425 = !DILocation(line: 236, scope: !420)
!426 = !DILocation(line: 238, scope: !420)
!427 = !DILocation(line: 239, scope: !420)
!428 = !DILocation(line: 422, scope: !420)
!429 = distinct !DISubprogram(name: "remove_first", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.remove_first", scope: !2, file: !2, line: 242, type: !421, scopeLine: 242, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!430 = !DILocation(line: 243, scope: !429)
!431 = !DILocalVariable(name: "self", arg: 1, scope: !429, file: !2, line: 242, type: !98)
!432 = !DILocation(line: 242, scope: !429)
!433 = !DILocation(line: 244, scope: !429)
!434 = !DILocation(line: 245, scope: !429)
!435 = !DILocation(line: 136, scope: !429)
!436 = distinct !DISubprogram(name: "first", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.first", scope: !2, file: !2, line: 248, type: !231, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!437 = !DILocation(line: 249, scope: !436)
!438 = !DILocalVariable(name: "self", arg: 1, scope: !436, file: !2, line: 248, type: !98)
!439 = !DILocation(line: 248, scope: !436)
!440 = !DILocation(line: 250, scope: !436)
!441 = !DILocation(line: 251, scope: !436)
!442 = distinct !DISubprogram(name: "last", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.last", scope: !2, file: !2, line: 254, type: !231, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!443 = !DILocation(line: 255, scope: !442)
!444 = !DILocalVariable(name: "self", arg: 1, scope: !442, file: !2, line: 254, type: !98)
!445 = !DILocation(line: 254, scope: !442)
!446 = !DILocation(line: 256, scope: !442)
!447 = !DILocation(line: 257, scope: !442)
!448 = distinct !DISubprogram(name: "is_empty", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.is_empty", scope: !2, file: !2, line: 260, type: !169, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!449 = !DILocation(line: 261, scope: !448)
!450 = !DILocalVariable(name: "self", arg: 1, scope: !448, file: !2, line: 260, type: !98)
!451 = !DILocation(line: 260, scope: !448)
!452 = !DILocation(line: 262, scope: !448)
!453 = distinct !DISubprogram(name: "byte_size", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.byte_size", scope: !2, file: !2, line: 265, type: !454, scopeLine: 265, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!454 = !DISubroutineType(types: !455)
!455 = !{!19, !98}
!456 = !DILocation(line: 266, scope: !453)
!457 = !DILocalVariable(name: "self", arg: 1, scope: !453, file: !2, line: 265, type: !98)
!458 = !DILocation(line: 265, scope: !453)
!459 = !DILocation(line: 267, scope: !453)
!460 = distinct !DISubprogram(name: "len", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.len", scope: !2, file: !2, line: 270, type: !454, scopeLine: 270, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!461 = !DILocation(line: 271, scope: !460)
!462 = !DILocalVariable(name: "self", arg: 1, scope: !460, file: !2, line: 270, type: !98)
!463 = !DILocation(line: 270, scope: !460)
!464 = !DILocation(line: 272, scope: !460)
!465 = distinct !DISubprogram(name: "get", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.get", scope: !2, file: !2, line: 278, type: !466, scopeLine: 278, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!466 = !DISubroutineType(types: !467)
!467 = !{!25, !98, !20}
!468 = !DILocation(line: 279, scope: !465)
!469 = !DILocalVariable(name: "self", arg: 1, scope: !465, file: !2, line: 278, type: !98)
!470 = !DILocation(line: 278, scope: !465)
!471 = !DILocalVariable(name: "index", arg: 2, scope: !465, file: !2, line: 278, type: !19)
!472 = !DILocation(line: 276, scope: !473)
!473 = distinct !DILexicalBlock(scope: !465, file: !2, line: 279, column: 1)
!474 = !DILocation(line: 280, scope: !465)
!475 = distinct !DISubprogram(name: "free", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.free", scope: !2, file: !2, line: 283, type: !242, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!476 = !DILocation(line: 284, scope: !475)
!477 = !DILocalVariable(name: "self", arg: 1, scope: !475, file: !2, line: 283, type: !98)
!478 = !DILocation(line: 283, scope: !475)
!479 = !DILocation(line: 285, scope: !475)
!480 = !DILocation(line: 432, scope: !481, inlinedAt: !483)
!481 = distinct !DILexicalBlock(scope: !482, file: !2, line: 433, column: 1)
!482 = distinct !DISubprogram(name: "pre_free", linkageName: "pre_free", scope: !2, file: !2, line: 432, scopeLine: 432, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92)
!483 = !DILocation(line: 287, scope: !475)
!484 = !DILocation(line: 434, scope: !482, inlinedAt: !483)
!485 = !DILocation(line: 435, scope: !482, inlinedAt: !483)
!486 = !DILocation(line: 292, scope: !475)
!487 = !DILocation(line: 119, scope: !488, inlinedAt: !486)
!488 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !307, file: !307, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92)
!489 = !DILocation(line: 123, scope: !488, inlinedAt: !486)
!490 = !DILocation(line: 294, scope: !475)
!491 = !DILocation(line: 295, scope: !475)
!492 = !DILocation(line: 296, scope: !475)
!493 = distinct !DISubprogram(name: "swap", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.swap", scope: !2, file: !2, line: 302, type: !494, scopeLine: 302, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !98, !20, !20}
!496 = !DILocation(line: 303, scope: !493)
!497 = !DILocalVariable(name: "self", arg: 1, scope: !493, file: !2, line: 302, type: !98)
!498 = !DILocation(line: 302, scope: !493)
!499 = !DILocalVariable(name: "i", arg: 2, scope: !493, file: !2, line: 302, type: !19)
!500 = !DILocalVariable(name: "j", arg: 3, scope: !493, file: !2, line: 302, type: !19)
!501 = !DILocation(line: 300, scope: !502)
!502 = distinct !DILexicalBlock(scope: !493, file: !2, line: 303, column: 1)
!503 = !DILocalVariable(name: "temp", scope: !504, file: !2, line: 79, type: !26, align: 8)
!504 = distinct !DISubprogram(name: "@swap", linkageName: "@swap", scope: !360, file: !360, line: 77, scopeLine: 77, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !99)
!505 = !DILocation(line: 79, scope: !504, inlinedAt: !506)
!506 = !DILocation(line: 304, scope: !493)
!507 = !DILocation(line: 304, scope: !504, inlinedAt: !506)
!508 = distinct !DISubprogram(name: "remove_if", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.remove_if", scope: !2, file: !2, line: 311, type: !509, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!509 = !DISubroutineType(types: !510)
!510 = !{!19, !98, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ElementPredicate", baseType: !512, size: 64, align: 64, dwarfAddressSpace: 0)
!512 = !DISubroutineType(types: !513)
!513 = !{!3, !125}
!514 = !DILocation(line: 312, scope: !508)
!515 = !DILocalVariable(name: "self", arg: 1, scope: !508, file: !2, line: 311, type: !98)
!516 = !DILocation(line: 311, scope: !508)
!517 = !DILocalVariable(name: "filter", arg: 2, scope: !508, file: !2, line: 311, type: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementPredicate", scope: !2, file: !2, line: 7, baseType: !511, align: 8)
!519 = !DILocalVariable(name: "size", scope: !520, file: !2, line: 91, type: !19, align: 8)
!520 = distinct !DISubprogram(name: "list_remove_if", linkageName: "list_remove_if", scope: !301, file: !301, line: 89, scopeLine: 89, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !99)
!521 = !DILocation(line: 91, scope: !520, inlinedAt: !522)
!522 = !DILocation(line: 313, scope: !508)
!523 = !DILocalVariable(name: "i", scope: !524, file: !2, line: 92, type: !19, align: 8)
!524 = distinct !DILexicalBlock(scope: !520, file: !301, line: 92, column: 2)
!525 = !DILocation(line: 92, scope: !524, inlinedAt: !522)
!526 = !DILocalVariable(name: "k", scope: !524, file: !2, line: 92, type: !19, align: 8)
!527 = !DILocation(line: 98, scope: !528, inlinedAt: !522)
!528 = distinct !DILexicalBlock(scope: !524, file: !301, line: 93, column: 2)
!529 = !DILocation(line: 98, scope: !530, inlinedAt: !522)
!530 = distinct !DILexicalBlock(scope: !528, file: !301, line: 98, column: 4)
!531 = !DILocalVariable(name: "n", scope: !528, file: !2, line: 101, type: !19, align: 8)
!532 = !DILocation(line: 101, scope: !528, inlinedAt: !522)
!533 = !DILocation(line: 102, scope: !528, inlinedAt: !522)
!534 = !DILocation(line: 103, scope: !528, inlinedAt: !522)
!535 = !DILocation(line: 108, scope: !528, inlinedAt: !522)
!536 = !DILocation(line: 108, scope: !537, inlinedAt: !522)
!537 = distinct !DILexicalBlock(scope: !528, file: !301, line: 108, column: 4)
!538 = !DILocation(line: 111, scope: !520, inlinedAt: !522)
!539 = distinct !DISubprogram(name: "retain_if", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.retain_if", scope: !2, file: !2, line: 320, type: !509, scopeLine: 320, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!540 = !DILocation(line: 321, scope: !539)
!541 = !DILocalVariable(name: "self", arg: 1, scope: !539, file: !2, line: 320, type: !98)
!542 = !DILocation(line: 320, scope: !539)
!543 = !DILocalVariable(name: "selection", arg: 2, scope: !539, file: !2, line: 320, type: !518)
!544 = !DILocalVariable(name: "size", scope: !545, file: !2, line: 91, type: !19, align: 8)
!545 = distinct !DISubprogram(name: "list_remove_if", linkageName: "list_remove_if", scope: !301, file: !301, line: 89, scopeLine: 89, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !99)
!546 = !DILocation(line: 91, scope: !545, inlinedAt: !547)
!547 = !DILocation(line: 322, scope: !539)
!548 = !DILocalVariable(name: "i", scope: !549, file: !2, line: 92, type: !19, align: 8)
!549 = distinct !DILexicalBlock(scope: !545, file: !301, line: 92, column: 2)
!550 = !DILocation(line: 92, scope: !549, inlinedAt: !547)
!551 = !DILocalVariable(name: "k", scope: !549, file: !2, line: 92, type: !19, align: 8)
!552 = !DILocation(line: 96, scope: !553, inlinedAt: !547)
!553 = distinct !DILexicalBlock(scope: !549, file: !301, line: 93, column: 2)
!554 = !DILocation(line: 96, scope: !555, inlinedAt: !547)
!555 = distinct !DILexicalBlock(scope: !553, file: !301, line: 96, column: 4)
!556 = !DILocalVariable(name: "n", scope: !553, file: !2, line: 101, type: !19, align: 8)
!557 = !DILocation(line: 101, scope: !553, inlinedAt: !547)
!558 = !DILocation(line: 102, scope: !553, inlinedAt: !547)
!559 = !DILocation(line: 103, scope: !553, inlinedAt: !547)
!560 = !DILocation(line: 106, scope: !553, inlinedAt: !547)
!561 = !DILocation(line: 106, scope: !562, inlinedAt: !547)
!562 = distinct !DILexicalBlock(scope: !553, file: !301, line: 106, column: 4)
!563 = !DILocation(line: 111, scope: !545, inlinedAt: !547)
!564 = distinct !DISubprogram(name: "remove_using_test", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.remove_using_test", scope: !2, file: !2, line: 325, type: !565, scopeLine: 325, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!565 = !DISubroutineType(types: !566)
!566 = !{!19, !98, !567, !570}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ElementTest", baseType: !568, size: 64, align: 64, dwarfAddressSpace: 0)
!568 = !DISubroutineType(types: !569)
!569 = !{!3, !125, !570}
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !571, identifier: "any")
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !570, baseType: !11, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !570, baseType: !13, size: 64, align: 64, offset: 64)
!574 = !DILocation(line: 326, scope: !564)
!575 = !DILocalVariable(name: "self", arg: 1, scope: !564, file: !2, line: 325, type: !98)
!576 = !DILocation(line: 325, scope: !564)
!577 = !DILocalVariable(name: "filter", arg: 2, scope: !564, file: !2, line: 325, type: !578)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementTest", scope: !2, file: !2, line: 8, baseType: !567, align: 8)
!579 = !DILocalVariable(name: "context", arg: 3, scope: !564, file: !2, line: 325, type: !570)
!580 = !DILocalVariable(name: "old_size", scope: !564, file: !2, line: 327, type: !19, align: 8)
!581 = !DILocation(line: 327, scope: !564)
!582 = !DILocalVariable(name: "size", scope: !583, file: !2, line: 35, type: !19, align: 8)
!583 = distinct !DISubprogram(name: "list_remove_using_test", linkageName: "list_remove_using_test", scope: !301, file: !301, line: 33, scopeLine: 33, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !99)
!584 = !DILocation(line: 35, scope: !583, inlinedAt: !585)
!585 = !DILocation(line: 332, scope: !564)
!586 = !DILocalVariable(name: "i", scope: !587, file: !2, line: 36, type: !19, align: 8)
!587 = distinct !DILexicalBlock(scope: !583, file: !301, line: 36, column: 2)
!588 = !DILocation(line: 36, scope: !587, inlinedAt: !585)
!589 = !DILocalVariable(name: "k", scope: !587, file: !2, line: 36, type: !19, align: 8)
!590 = !DILocation(line: 42, scope: !591, inlinedAt: !585)
!591 = distinct !DILexicalBlock(scope: !587, file: !301, line: 37, column: 2)
!592 = !DILocation(line: 42, scope: !593, inlinedAt: !585)
!593 = distinct !DILexicalBlock(scope: !591, file: !301, line: 42, column: 4)
!594 = !DILocalVariable(name: "n", scope: !591, file: !2, line: 45, type: !19, align: 8)
!595 = !DILocation(line: 45, scope: !591, inlinedAt: !585)
!596 = !DILocation(line: 46, scope: !591, inlinedAt: !585)
!597 = !DILocation(line: 47, scope: !591, inlinedAt: !585)
!598 = !DILocation(line: 52, scope: !591, inlinedAt: !585)
!599 = !DILocation(line: 52, scope: !600, inlinedAt: !585)
!600 = distinct !DILexicalBlock(scope: !591, file: !301, line: 52, column: 4)
!601 = !DILocation(line: 55, scope: !583, inlinedAt: !585)
!602 = !DILocation(line: 330, scope: !603)
!603 = distinct !DILexicalBlock(scope: !564, file: !2, line: 329, column: 2)
!604 = distinct !DISubprogram(name: "retain_using_test", linkageName: "std_collections_list$p$cforms.ListViewColumn$.List.retain_using_test", scope: !2, file: !2, line: 337, type: !565, scopeLine: 337, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !99)
!605 = !DILocation(line: 338, scope: !604)
!606 = !DILocalVariable(name: "self", arg: 1, scope: !604, file: !2, line: 337, type: !98)
!607 = !DILocation(line: 337, scope: !604)
!608 = !DILocalVariable(name: "filter", arg: 2, scope: !604, file: !2, line: 337, type: !578)
!609 = !DILocalVariable(name: "context", arg: 3, scope: !604, file: !2, line: 337, type: !570)
!610 = !DILocalVariable(name: "old_size", scope: !604, file: !2, line: 339, type: !19, align: 8)
!611 = !DILocation(line: 339, scope: !604)
!612 = !DILocalVariable(name: "size", scope: !613, file: !2, line: 35, type: !19, align: 8)
!613 = distinct !DISubprogram(name: "list_remove_using_test", linkageName: "list_remove_using_test", scope: !301, file: !301, line: 33, scopeLine: 33, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !99)
!614 = !DILocation(line: 35, scope: !613, inlinedAt: !615)
!615 = !DILocation(line: 343, scope: !604)
!616 = !DILocalVariable(name: "i", scope: !617, file: !2, line: 36, type: !19, align: 8)
!617 = distinct !DILexicalBlock(scope: !613, file: !301, line: 36, column: 2)
!618 = !DILocation(line: 36, scope: !617, inlinedAt: !615)
!619 = !DILocalVariable(name: "k", scope: !617, file: !2, line: 36, type: !19, align: 8)
!620 = !DILocation(line: 40, scope: !621, inlinedAt: !615)
