; ModuleID = 'std_collections_list$p$cforms.Control$'
source_filename = "std_collections_list$p$cforms.Control$"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }
%"char[]" = type { ptr, i64 }
%"Control*[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$"std_collections_list$p$cforms.Control$.List.init" = comdat any

$"std_collections_list$p$cforms.Control$.List.tinit" = comdat any

$"std_collections_list$p$cforms.Control$.List.init_with_array" = comdat any

$"std_collections_list$p$cforms.Control$.List.tinit_with_array" = comdat any

$"std_collections_list$p$cforms.Control$.List.init_wrapping_array" = comdat any

$"std_collections_list$p$cforms.Control$.List.is_initialized" = comdat any

$"std_collections_list$p$cforms.Control$.List.to_format" = comdat any

$"std_collections_list$p$cforms.Control$.List.push" = comdat any

$"std_collections_list$p$cforms.Control$.List.pop" = comdat any

$"std_collections_list$p$cforms.Control$.List.clear" = comdat any

$"std_collections_list$p$cforms.Control$.List.pop_first" = comdat any

$"std_collections_list$p$cforms.Control$.List.remove_at" = comdat any

$"std_collections_list$p$cforms.Control$.List.add_all" = comdat any

$"std_collections_list$p$cforms.Control$.List.to_aligned_array" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ELEMENT_IS_EQUATABLE", linkageName: "std_collections_list$p$cforms.Control$.ELEMENT_IS_EQUATABLE", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 1)
!2 = !DIFile(filename: "list.c3", directory: "C:/Compilers/C3/lib/std/collections")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "ELEMENT_IS_POINTER", linkageName: "std_collections_list$p$cforms.Control$.ELEMENT_IS_POINTER", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 1)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "LIST_HEAP_ALLOCATOR", linkageName: "std_collections_list$p$cforms.Control$.LIST_HEAP_ALLOCATOR", scope: !2, file: !2, line: 12, type: !8, isLocal: false, isDefinition: true, align: 8)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !9, identifier: "Allocator")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !8, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "ONHEAP", linkageName: "std_collections_list$p$cforms.Control$.ONHEAP", scope: !2, file: !2, line: 14, type: !16, isLocal: false, isDefinition: true, align: 8)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !17, identifier: "std_collections_list$p$cforms.Control$.List")
!17 = !{!18, !21, !22, !23}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !16, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !20)
!20 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !16, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !16, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !16, file: !2, line: 23, baseType: !24, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 56, baseType: !26, align: 8)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Control*", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "Control", scope: !2, file: !2, line: 55, size: 2496, align: 64, elements: !28, identifier: "cforms.Control")
!28 = !{!29, !49, !53, !60, !63, !70, !71, !73, !74, !75, !76, !79, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !448, !449, !450, !451, !452, !453, !454, !455, !456, !478, !479, !480, !481, !482, !483, !670, !671}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !27, file: !2, line: 57, baseType: !30, size: 8, align: 8)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ControlType", scope: !27, file: !2, line: 25, baseType: !31, size: 8, align: 8, elements: !32)
!31 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!33 = !DIEnumerator(name: "NONE", value: 0, isUnsigned: true)
!34 = !DIEnumerator(name: "BUTTON", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "CALENDAR", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "CHECK_BOX", value: 3, isUnsigned: true)
!37 = !DIEnumerator(name: "COMBO_BOX", value: 4, isUnsigned: true)
!38 = !DIEnumerator(name: "DATE_TIME_PICKER", value: 5, isUnsigned: true)
!39 = !DIEnumerator(name: "GROUP_BOX", value: 6, isUnsigned: true)
!40 = !DIEnumerator(name: "LABEL", value: 7, isUnsigned: true)
!41 = !DIEnumerator(name: "LIST_BOX", value: 8, isUnsigned: true)
!42 = !DIEnumerator(name: "LIST_VIEW", value: 9, isUnsigned: true)
!43 = !DIEnumerator(name: "NUM_PICKER", value: 10, isUnsigned: true)
!44 = !DIEnumerator(name: "PROGRESS_BAR", value: 11, isUnsigned: true)
!45 = !DIEnumerator(name: "RADIO_BUTTON", value: 12, isUnsigned: true)
!46 = !DIEnumerator(name: "TEXT_BOX", value: 13, isUnsigned: true)
!47 = !DIEnumerator(name: "TRACK_BAR", value: 14, isUnsigned: true)
!48 = !DIEnumerator(name: "TREE_VIEW", value: 15, isUnsigned: true)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !27, file: !2, line: 58, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !51, align: 8)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 1)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !27, file: !2, line: 59, baseType: !54, size: 128, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !56, identifier: "char[]")
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !55, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, baseType: !19, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !27, file: !2, line: 60, baseType: !61, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hwnd", scope: !2, file: !2, line: 19, baseType: !62, align: 8)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "Handle", scope: !2, file: !2, line: 6, baseType: !11, align: 8)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", scope: !27, file: !2, line: 61, baseType: !64, size: 64, align: 32, offset: 320)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", scope: !27, file: !2, line: 14, size: 64, align: 32, elements: !65, identifier: "cforms.Color")
!65 = !{!66, !68}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !64, file: !2, line: 16, baseType: !67, size: 32, align: 32)
!67 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !64, file: !2, line: 17, baseType: !69, size: 32, align: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colorref", scope: !2, file: !2, line: 36, baseType: !67, align: 4)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", scope: !27, file: !2, line: 62, baseType: !64, size: 64, align: 32, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !27, file: !2, line: 63, baseType: !72, size: 32, align: 32, offset: 448)
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !27, file: !2, line: 64, baseType: !72, size: 32, align: 32, offset: 480)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "xpos", scope: !27, file: !2, line: 65, baseType: !72, size: 32, align: 32, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ypos", scope: !27, file: !2, line: 66, baseType: !72, size: 32, align: 32, offset: 544)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ctlID", scope: !27, file: !2, line: 67, baseType: !77, size: 64, align: 64, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "iptr", baseType: !78)
!78 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "contextMenu", scope: !27, file: !2, line: 68, baseType: !80, size: 64, align: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ContextMenu*", baseType: !81, size: 64, align: 64, dwarfAddressSpace: 0)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "ContextMenu", scope: !2, file: !2, line: 23, size: 1600, align: 64, elements: !82, identifier: "cforms.ContextMenu")
!82 = !{!83, !344, !345, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !81, file: !2, line: 25, baseType: !84, size: 768, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuBase", scope: !81, file: !2, line: 56, size: 768, align: 64, elements: !85, identifier: "cforms.MenuBase")
!85 = !{!86, !88, !111, !112}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !84, file: !2, line: 58, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hmenu", scope: !2, file: !2, line: 16, baseType: !62, align: 8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !84, file: !2, line: 59, baseType: !89, size: 320, align: 64, offset: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "Font", scope: !84, file: !2, line: 5, size: 320, align: 64, elements: !90, identifier: "cforms.Font")
!90 = !{!91, !92, !93, !105, !106, !107, !108, !109}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !89, file: !2, line: 7, baseType: !54, size: 128, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !89, file: !2, line: 8, baseType: !72, size: 32, align: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !89, file: !2, line: 9, baseType: !94, size: 32, align: 32, offset: 160)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FontWeight", scope: !89, file: !2, line: 45, baseType: !72, size: 32, align: 32, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104}
!96 = !DIEnumerator(name: "THIN", value: 0)
!97 = !DIEnumerator(name: "EXTRA_LIGHT", value: 1)
!98 = !DIEnumerator(name: "LIGHT", value: 2)
!99 = !DIEnumerator(name: "NORMAL", value: 3)
!100 = !DIEnumerator(name: "MEDIUM", value: 4)
!101 = !DIEnumerator(name: "SEMI_BOLD", value: 5)
!102 = !DIEnumerator(name: "BOLD", value: 6)
!103 = !DIEnumerator(name: "EXTRA_BOLD", value: 7)
!104 = !DIEnumerator(name: "THICK", value: 8)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "italics", scope: !89, file: !2, line: 10, baseType: !3, size: 8, align: 8, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "underline", scope: !89, file: !2, line: 11, baseType: !3, size: 8, align: 8, offset: 200)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "strikeout", scope: !89, file: !2, line: 12, baseType: !3, size: 8, align: 8, offset: 208)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_isCreated", scope: !89, file: !2, line: 13, baseType: !3, size: 8, align: 8, offset: 216)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !89, file: !2, line: 14, baseType: !110, size: 64, align: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hfont", scope: !2, file: !2, line: 12, baseType: !62, align: 8)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_menuCount", scope: !84, file: !2, line: 60, baseType: !67, size: 32, align: 32, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_menuList", scope: !84, file: !2, line: 62, baseType: !113, size: 320, align: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "MenuItemList", scope: !2, file: !2, line: 47, baseType: !114, align: 8)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !115, identifier: "std_collections_list$p$cforms.MenuItem$.List")
!115 = !{!116, !117, !118, !119}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !114, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !114, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !114, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !114, file: !2, line: 23, baseType: !120, size: 64, align: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !121, size: 64, align: 64, dwarfAddressSpace: 0)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 47, baseType: !122, align: 8)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MenuItem*", baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuItem", scope: !2, file: !2, line: 112, size: 1920, align: 64, elements: !124, identifier: "cforms.MenuItem")
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !144, !151, !152, !153, !336, !341, !342, !343}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !123, file: !2, line: 114, baseType: !84, size: 768, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "parentHandle", scope: !123, file: !2, line: 115, baseType: !87, size: 64, align: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_formHwnd", scope: !123, file: !2, line: 116, baseType: !61, size: 64, align: 64, offset: 832)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bgColor", scope: !123, file: !2, line: 117, baseType: !64, size: 64, align: 32, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "fgColor", scope: !123, file: !2, line: 118, baseType: !64, size: 64, align: 32, offset: 960)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "idNum", scope: !123, file: !2, line: 119, baseType: !67, size: 32, align: 32, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_index", scope: !123, file: !2, line: 121, baseType: !67, size: 32, align: 32, offset: 1056)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_evtFlag", scope: !123, file: !2, line: 122, baseType: !67, size: 32, align: 32, offset: 1088)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "iLevel", scope: !123, file: !2, line: 123, baseType: !72, size: 32, align: 32, offset: 1120)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "hasCheckMark", scope: !123, file: !2, line: 124, baseType: !3, size: 8, align: 8, offset: 1152)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_isCreated", scope: !123, file: !2, line: 125, baseType: !3, size: 8, align: 8, offset: 1160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_isEnabled", scope: !123, file: !2, line: 126, baseType: !3, size: 8, align: 8, offset: 1168)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_popup", scope: !123, file: !2, line: 127, baseType: !3, size: 8, align: 8, offset: 1176)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_formMenu", scope: !123, file: !2, line: 128, baseType: !3, size: 8, align: 8, offset: 1184)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !123, file: !2, line: 129, baseType: !54, size: 128, align: 64, offset: 1216)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_wideText", scope: !123, file: !2, line: 130, baseType: !141, size: 64, align: 64, offset: 1344)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Char16*", baseType: !142, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char16", scope: !2, file: !2, line: 33, baseType: !143, align: 2)
!143 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !123, file: !2, line: 131, baseType: !145, size: 8, align: 8, offset: 1408)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MenuType", scope: !123, file: !2, line: 49, baseType: !31, size: 8, align: 8, elements: !146)
!146 = !{!147, !148, !149, !150}
!147 = !DIEnumerator(name: "BASE_MENU", value: 0, isUnsigned: true)
!148 = !DIEnumerator(name: "MENU_ITEM", value: 1, isUnsigned: true)
!149 = !DIEnumerator(name: "POPUP", value: 2, isUnsigned: true)
!150 = !DIEnumerator(name: "SEPRATOR", value: 3, isUnsigned: true)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_parent", scope: !123, file: !2, line: 132, baseType: !122, size: 64, align: 64, offset: 1472)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "uFlag", scope: !123, file: !2, line: 133, baseType: !67, size: 32, align: 32, offset: 1536)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_mbar", scope: !123, file: !2, line: 134, baseType: !154, size: 64, align: 64, offset: 1600)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MenuBar*", baseType: !155, size: 64, align: 64, dwarfAddressSpace: 0)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuBar", scope: !2, file: !2, line: 98, size: 1216, align: 64, elements: !156, identifier: "cforms.MenuBar")
!156 = !{!157, !158, !159, !331, !332, !333, !334, !335}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !155, file: !2, line: 100, baseType: !84, size: 768, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_formHwnd", scope: !155, file: !2, line: 101, baseType: !61, size: 64, align: 64, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_pForm", scope: !155, file: !2, line: 102, baseType: !160, size: 64, align: 64, offset: 832)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Form*", baseType: !161, size: 64, align: 64, dwarfAddressSpace: 0)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", scope: !2, file: !2, line: 69, size: 5632, align: 64, elements: !162, identifier: "cforms.Form")
!162 = !{!163, !164, !177, !188, !194, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !225, !239, !241, !272, !274, !275, !276, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !325, !326}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !161, file: !2, line: 71, baseType: !27, size: 2496, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "formPos", scope: !161, file: !2, line: 72, baseType: !165, size: 32, align: 32, offset: 2496)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormPos", scope: !161, file: !2, line: 58, baseType: !72, size: 32, align: 32, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!167 = !DIEnumerator(name: "CENTER", value: 0)
!168 = !DIEnumerator(name: "TOP_LEFT", value: 1)
!169 = !DIEnumerator(name: "TOP_MID", value: 2)
!170 = !DIEnumerator(name: "TOP_RIGHT", value: 3)
!171 = !DIEnumerator(name: "MID_LEFT", value: 4)
!172 = !DIEnumerator(name: "MID_RIGHT", value: 5)
!173 = !DIEnumerator(name: "BOTTOM_LEFT", value: 6)
!174 = !DIEnumerator(name: "BOTTOM_MID", value: 7)
!175 = !DIEnumerator(name: "BOTTOM_RIGHT", value: 8)
!176 = !DIEnumerator(name: "MANUAL", value: 9)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "formStyle", scope: !161, file: !2, line: 73, baseType: !178, size: 32, align: 32, offset: 2528)
!178 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormStyle", scope: !161, file: !2, line: 72, baseType: !72, size: 32, align: 32, elements: !179)
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187}
!180 = !DIEnumerator(name: "NONE", value: 0)
!181 = !DIEnumerator(name: "FIXED_SINGLE", value: 1)
!182 = !DIEnumerator(name: "FIXED_3D", value: 2)
!183 = !DIEnumerator(name: "FIXED_DIALOG", value: 3)
!184 = !DIEnumerator(name: "NORMAL_WINDOW", value: 4)
!185 = !DIEnumerator(name: "FIXED_TOOL", value: 5)
!186 = !DIEnumerator(name: "SIZABLE_TOOL", value: 6)
!187 = !DIEnumerator(name: "HIDDEN", value: 7)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "formState", scope: !161, file: !2, line: 74, baseType: !189, size: 32, align: 32, offset: 2560)
!189 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormState", scope: !161, file: !2, line: 84, baseType: !72, size: 32, align: 32, elements: !190)
!190 = !{!191, !192, !193}
!191 = !DIEnumerator(name: "NORMAL", value: 0)
!192 = !DIEnumerator(name: "MAXIMIZED", value: 1)
!193 = !DIEnumerator(name: "MINIMIZED", value: 2)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_fDrawMode", scope: !161, file: !2, line: 75, baseType: !195, size: 32, align: 32, offset: 2592)
!195 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormDrawMode", scope: !161, file: !2, line: 90, baseType: !72, size: 32, align: 32, elements: !196)
!196 = !{!197, !198, !199}
!197 = !DIEnumerator(name: "DEFAULT", value: 0)
!198 = !DIEnumerator(name: "FLAT_COLOR", value: 1)
!199 = !DIEnumerator(name: "GRADIENT", value: 2)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "topMost", scope: !161, file: !2, line: 76, baseType: !3, size: 8, align: 8, offset: 2624)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "createChilds", scope: !161, file: !2, line: 77, baseType: !3, size: 8, align: 8, offset: 2632)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "maximizeBox", scope: !161, file: !2, line: 78, baseType: !3, size: 8, align: 8, offset: 2640)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "minimizeBox", scope: !161, file: !2, line: 79, baseType: !3, size: 8, align: 8, offset: 2648)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_isLoaded", scope: !161, file: !2, line: 80, baseType: !3, size: 8, align: 8, offset: 2656)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_isMainWindow", scope: !161, file: !2, line: 81, baseType: !3, size: 8, align: 8, offset: 2664)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_isMouseTracking", scope: !161, file: !2, line: 82, baseType: !3, size: 8, align: 8, offset: 2672)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_isSizing", scope: !161, file: !2, line: 83, baseType: !3, size: 8, align: 8, offset: 2680)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_menuMapInited", scope: !161, file: !2, line: 84, baseType: !3, size: 8, align: 8, offset: 2688)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_menubarCreated", scope: !161, file: !2, line: 85, baseType: !3, size: 8, align: 8, offset: 2696)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_formID", scope: !161, file: !2, line: 86, baseType: !72, size: 32, align: 32, offset: 2720)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_comboList", scope: !161, file: !2, line: 87, baseType: !212, size: 320, align: 64, offset: 2752)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "CmbList", scope: !2, file: !2, line: 65, baseType: !213, align: 8)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !214, identifier: "std_collections_list$cforms.ComboInfo$.List")
!214 = !{!215, !216, !217, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !213, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !213, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !213, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !213, file: !2, line: 23, baseType: !219, size: 64, align: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !220, size: 64, align: 64, dwarfAddressSpace: 0)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 65, baseType: !221, align: 8)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComboInfo", scope: !2, file: !2, line: 61, size: 128, align: 64, elements: !222, identifier: "cforms.ComboInfo")
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "listHwnd", scope: !221, file: !2, line: 61, baseType: !61, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "cmbHwnd", scope: !221, file: !2, line: 61, baseType: !61, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_menuItemList", scope: !161, file: !2, line: 88, baseType: !226, size: 320, align: 64, offset: 3072)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "MenuItems", scope: !2, file: !2, line: 66, baseType: !227, align: 8)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !228, identifier: "std_collections_list$cforms.MenuInfo$.List")
!228 = !{!229, !230, !231, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !227, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !227, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !227, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !227, file: !2, line: 23, baseType: !233, size: 64, align: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !234, size: 64, align: 64, dwarfAddressSpace: 0)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 66, baseType: !235, align: 8)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuInfo", scope: !2, file: !2, line: 62, size: 128, align: 64, elements: !236, identifier: "cforms.MenuInfo")
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "menuID", scope: !235, file: !2, line: 62, baseType: !67, size: 32, align: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pMenuItem", scope: !235, file: !2, line: 62, baseType: !122, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "controls", scope: !161, file: !2, line: 89, baseType: !240, size: 320, align: 64, offset: 3392)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ControlList", scope: !2, file: !2, line: 56, baseType: !16, align: 8)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_timerList", scope: !161, file: !2, line: 90, baseType: !242, size: 320, align: 64, offset: 3712)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerList", scope: !2, file: !2, line: 64, baseType: !243, align: 8)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !244, identifier: "std_collections_list$cforms.TimerInfo$.List")
!244 = !{!245, !246, !247, !248}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !243, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !243, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !243, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !243, file: !2, line: 23, baseType: !249, size: 64, align: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !250, size: 64, align: 64, dwarfAddressSpace: 0)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 64, baseType: !251, align: 8)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "TimerInfo", scope: !2, file: !2, line: 60, size: 128, align: 64, elements: !252, identifier: "cforms.TimerInfo")
!252 = !{!253, !255}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "timerID", scope: !251, file: !2, line: 60, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uintptr", scope: !2, file: !2, line: 31, baseType: !20, align: 8)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pTimer", scope: !251, file: !2, line: 60, baseType: !256, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Timer*", baseType: !257, size: 64, align: 64, dwarfAddressSpace: 0)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timer", scope: !2, file: !2, line: 20, size: 320, align: 64, elements: !258, identifier: "cforms.Timer")
!258 = !{!259, !260, !269, !270, !271}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !257, file: !2, line: 22, baseType: !67, size: 32, align: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "onTick", scope: !257, file: !2, line: 23, baseType: !261, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "EventHandler", scope: !2, file: !2, line: 4, baseType: !262, align: 8)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "EventHandler", baseType: !263, size: 64, align: 64, dwarfAddressSpace: 0)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !26, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "EventArgs*", baseType: !266, size: 64, align: 64, dwarfAddressSpace: 0)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "EventArgs", scope: !2, file: !2, line: 23, size: 8, align: 8, elements: !267, identifier: "cforms.EventArgs")
!267 = !{!268}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "handled", scope: !266, file: !2, line: 25, baseType: !3, size: 8, align: 8)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_idNum", scope: !257, file: !2, line: 24, baseType: !254, size: 64, align: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_parentHwnd", scope: !257, file: !2, line: 25, baseType: !61, size: 64, align: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_isEnabled", scope: !257, file: !2, line: 26, baseType: !3, size: 8, align: 8, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "hinst", scope: !161, file: !2, line: 91, baseType: !273, size: 64, align: 64, offset: 4032)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hinstance", scope: !2, file: !2, line: 15, baseType: !62, align: 8)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "menubar", scope: !161, file: !2, line: 92, baseType: !154, size: 64, align: 64, offset: 4096)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_menuFont", scope: !161, file: !2, line: 93, baseType: !89, size: 320, align: 64, offset: 4160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayBrush", scope: !161, file: !2, line: 94, baseType: !277, size: 64, align: 64, offset: 4480)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hbrush", scope: !2, file: !2, line: 9, baseType: !62, align: 8)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_menuDefBgBrush", scope: !161, file: !2, line: 95, baseType: !277, size: 64, align: 64, offset: 4544)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_menuHotBgBrush", scope: !161, file: !2, line: 96, baseType: !277, size: 64, align: 64, offset: 4608)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_menuFrameBrush", scope: !161, file: !2, line: 97, baseType: !277, size: 64, align: 64, offset: 4672)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayCref", scope: !161, file: !2, line: 98, baseType: !69, size: 32, align: 32, offset: 4736)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "onLoad", scope: !161, file: !2, line: 101, baseType: !261, size: 64, align: 64, offset: 4800)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "onActivate", scope: !161, file: !2, line: 102, baseType: !261, size: 64, align: 64, offset: 4864)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "onDeActivate", scope: !161, file: !2, line: 103, baseType: !261, size: 64, align: 64, offset: 4928)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "onMoving", scope: !161, file: !2, line: 104, baseType: !261, size: 64, align: 64, offset: 4992)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "onMoved", scope: !161, file: !2, line: 105, baseType: !261, size: 64, align: 64, offset: 5056)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "onMinimized", scope: !161, file: !2, line: 106, baseType: !261, size: 64, align: 64, offset: 5120)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "onMaximized", scope: !161, file: !2, line: 107, baseType: !261, size: 64, align: 64, offset: 5184)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "onRestored", scope: !161, file: !2, line: 108, baseType: !261, size: 64, align: 64, offset: 5248)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "onClosing", scope: !161, file: !2, line: 109, baseType: !261, size: 64, align: 64, offset: 5312)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "onClosed", scope: !161, file: !2, line: 110, baseType: !261, size: 64, align: 64, offset: 5376)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "onSizing", scope: !161, file: !2, line: 113, baseType: !293, size: 64, align: 64, offset: 5440)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "SizeEventHandler", scope: !2, file: !2, line: 6, baseType: !294, align: 8)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SizeEventHandler", baseType: !295, size: 64, align: 64, dwarfAddressSpace: 0)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !26, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SizeEventArgs*", baseType: !298, size: 64, align: 64, dwarfAddressSpace: 0)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "SizeEventArgs", scope: !2, file: !2, line: 39, size: 256, align: 32, elements: !299, identifier: "cforms.SizeEventArgs")
!299 = !{!300, !301, !309, !320}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "eventArgs", scope: !298, file: !2, line: 41, baseType: !266, size: 8, align: 8)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "formRect", scope: !298, file: !2, line: 42, baseType: !302, size: 128, align: 32, offset: 32)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rect", scope: !298, file: !2, line: 62, size: 128, align: 32, elements: !303, identifier: "cforms.Rect")
!303 = !{!304, !306, !307, !308}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !302, file: !2, line: 63, baseType: !305, size: 32, align: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "Long", scope: !2, file: !2, line: 24, baseType: !72, align: 4)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !302, file: !2, line: 64, baseType: !305, size: 32, align: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !302, file: !2, line: 65, baseType: !305, size: 32, align: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !302, file: !2, line: 66, baseType: !305, size: 32, align: 32, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sizedOn", scope: !298, file: !2, line: 43, baseType: !310, size: 32, align: 32, offset: 160)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SizedPosition", scope: !298, file: !2, line: 123, baseType: !72, size: 32, align: 32, elements: !311)
!311 = !{!180, !312, !313, !314, !315, !316, !317, !318, !319}
!312 = !DIEnumerator(name: "LEFTEDGE", value: 1)
!313 = !DIEnumerator(name: "RIGHTEDGE", value: 2)
!314 = !DIEnumerator(name: "TOPEDGE", value: 3)
!315 = !DIEnumerator(name: "TOPLEFTCORNER", value: 4)
!316 = !DIEnumerator(name: "TOPRIGHTCORNER", value: 5)
!317 = !DIEnumerator(name: "BOTTOMEDGE", value: 6)
!318 = !DIEnumerator(name: "BOTTOMLEFTCORNER", value: 7)
!319 = !DIEnumerator(name: "BOTTOMRIGHTCORNER", value: 8)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "clientArea", scope: !298, file: !2, line: 44, baseType: !321, size: 64, align: 32, offset: 192)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "Area", scope: !298, file: !2, line: 17, size: 64, align: 32, elements: !322, identifier: "cforms.Area")
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !321, file: !2, line: 19, baseType: !72, size: 32, align: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !321, file: !2, line: 20, baseType: !72, size: 32, align: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "onSized", scope: !161, file: !2, line: 114, baseType: !293, size: 64, align: 64, offset: 5504)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "onThreadMsg", scope: !161, file: !2, line: 115, baseType: !327, size: 64, align: 64, offset: 5568)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadMsgHandler", scope: !2, file: !2, line: 9, baseType: !328, align: 8)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ThreadMsgHandler", baseType: !329, size: 64, align: 64, dwarfAddressSpace: 0)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !20, !78}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayCref", scope: !155, file: !2, line: 103, baseType: !69, size: 32, align: 32, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_menuDefBgBrush", scope: !155, file: !2, line: 104, baseType: !277, size: 64, align: 64, offset: 960)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_menuHotBgBrush", scope: !155, file: !2, line: 105, baseType: !277, size: 64, align: 64, offset: 1024)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_menuFrameBrush", scope: !155, file: !2, line: 106, baseType: !277, size: 64, align: 64, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayBrush", scope: !155, file: !2, line: 107, baseType: !277, size: 64, align: 64, offset: 1152)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "onClick", scope: !123, file: !2, line: 136, baseType: !337, size: 64, align: 64, offset: 1664)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "MenuEventHandler", scope: !2, file: !2, line: 11, baseType: !338, align: 8)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MenuEventHandler", baseType: !339, size: 64, align: 64, dwarfAddressSpace: 0)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !122, !265}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "onPopup", scope: !123, file: !2, line: 137, baseType: !337, size: 64, align: 64, offset: 1728)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "onCloseup", scope: !123, file: !2, line: 138, baseType: !337, size: 64, align: 64, offset: 1792)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "onFocus", scope: !123, file: !2, line: 139, baseType: !337, size: 64, align: 64, offset: 1856)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !81, file: !2, line: 26, baseType: !26, size: 64, align: 64, offset: 768)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tray", scope: !81, file: !2, line: 27, baseType: !346, size: 64, align: 64, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TrayIcon*", baseType: !347, size: 64, align: 64, dwarfAddressSpace: 0)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "TrayIcon", scope: !2, file: !2, line: 40, size: 8640, align: 64, elements: !348, identifier: "cforms.TrayIcon")
!348 = !{!349, !350, !351, !352, !359, !361, !362, !363, !369, !395, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_resetIcon", scope: !347, file: !2, line: 42, baseType: !3, size: 8, align: 8)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_cmenuUsed", scope: !347, file: !2, line: 43, baseType: !3, size: 8, align: 8, offset: 8)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_retainIcon", scope: !347, file: !2, line: 44, baseType: !3, size: 8, align: 8, offset: 16)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "menuTrigger", scope: !347, file: !2, line: 45, baseType: !353, size: 32, align: 32, offset: 32)
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TrayMenuTrigger", scope: !347, file: !2, line: 145, baseType: !72, size: 32, align: 32, elements: !354)
!354 = !{!180, !355, !356, !357, !358}
!355 = !DIEnumerator(name: "LEFT_CLICK", value: 1)
!356 = !DIEnumerator(name: "LEFT_DOUBLE_CLICK", value: 2)
!357 = !DIEnumerator(name: "RIGHT_CLICK", value: 3)
!358 = !DIEnumerator(name: "ANY_CLICK", value: 4)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_hTrayIcon", scope: !347, file: !2, line: 46, baseType: !360, size: 64, align: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hicon", scope: !2, file: !2, line: 14, baseType: !62, align: 8)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_msgWinHwnd", scope: !347, file: !2, line: 47, baseType: !61, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "contextMenu", scope: !347, file: !2, line: 48, baseType: !80, size: 64, align: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !347, file: !2, line: 49, baseType: !364, size: 64, align: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !365, size: 64, align: 64, dwarfAddressSpace: 0)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !366, identifier: "any")
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !365, baseType: !11, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !365, baseType: !13, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_nid", scope: !347, file: !2, line: 50, baseType: !370, size: 7616, align: 64, offset: 320)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "NotifyIconData", scope: !347, file: !2, line: 423, size: 7616, align: 64, elements: !371, identifier: "cforms.NotifyIconData")
!371 = !{!372, !374, !375, !376, !377, !378, !379, !383, !384, !385, !389, !390, !394}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "cbSize", scope: !370, file: !2, line: 425, baseType: !373, size: 32, align: 32)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dword", scope: !2, file: !2, line: 34, baseType: !67, align: 4)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", scope: !370, file: !2, line: 426, baseType: !61, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "uID", scope: !370, file: !2, line: 427, baseType: !67, size: 32, align: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "uFlags", scope: !370, file: !2, line: 428, baseType: !67, size: 32, align: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "uCallbackMessage", scope: !370, file: !2, line: 429, baseType: !67, size: 32, align: 32, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "hIcon", scope: !370, file: !2, line: 430, baseType: !360, size: 64, align: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "toolTipText", scope: !370, file: !2, line: 431, baseType: !380, size: 2048, align: 16, offset: 320)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 2048, align: 16, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 128, lowerBound: 0)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "dwState", scope: !370, file: !2, line: 432, baseType: !373, size: 32, align: 32, offset: 2368)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dwStateMask", scope: !370, file: !2, line: 433, baseType: !373, size: 32, align: 32, offset: 2400)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "balloonText", scope: !370, file: !2, line: 434, baseType: !386, size: 4096, align: 16, offset: 2432)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 4096, align: 16, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 256, lowerBound: 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "uVersionOrTimeout", scope: !370, file: !2, line: 435, baseType: !67, size: 32, align: 32, offset: 6528)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "balloonTitle", scope: !370, file: !2, line: 436, baseType: !391, size: 1024, align: 16, offset: 6560)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 1024, align: 16, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 64, lowerBound: 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dwInfoFlags", scope: !370, file: !2, line: 437, baseType: !373, size: 32, align: 32, offset: 7584)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "onBalloonShow", scope: !347, file: !2, line: 52, baseType: !396, size: 64, align: 64, offset: 7936)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "TrayIconEventHandler", scope: !2, file: !2, line: 10, baseType: !397, align: 8)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TrayIconEventHandler", baseType: !398, size: 64, align: 64, dwarfAddressSpace: 0)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !346, !265}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "onBalloonClose", scope: !347, file: !2, line: 53, baseType: !396, size: 64, align: 64, offset: 8000)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "onBalloonClick", scope: !347, file: !2, line: 54, baseType: !396, size: 64, align: 64, offset: 8064)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseMove", scope: !347, file: !2, line: 55, baseType: !396, size: 64, align: 64, offset: 8128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftMouseDown", scope: !347, file: !2, line: 56, baseType: !396, size: 64, align: 64, offset: 8192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftMouseUp", scope: !347, file: !2, line: 57, baseType: !396, size: 64, align: 64, offset: 8256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseDown", scope: !347, file: !2, line: 58, baseType: !396, size: 64, align: 64, offset: 8320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseUp", scope: !347, file: !2, line: 59, baseType: !396, size: 64, align: 64, offset: 8384)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftClick", scope: !347, file: !2, line: 60, baseType: !396, size: 64, align: 64, offset: 8448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "onRightClick", scope: !347, file: !2, line: 61, baseType: !396, size: 64, align: 64, offset: 8512)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftDoubleClick", scope: !347, file: !2, line: 62, baseType: !396, size: 64, align: 64, offset: 8576)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !81, file: !2, line: 28, baseType: !72, size: 32, align: 32, offset: 896)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !81, file: !2, line: 28, baseType: !72, size: 32, align: 32, offset: 928)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "rightClick", scope: !81, file: !2, line: 29, baseType: !3, size: 8, align: 8, offset: 960)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_menuInserted", scope: !81, file: !2, line: 30, baseType: !3, size: 8, align: 8, offset: 968)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_trayParent", scope: !81, file: !2, line: 31, baseType: !3, size: 8, align: 8, offset: 976)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_grayCref", scope: !81, file: !2, line: 32, baseType: !69, size: 32, align: 32, offset: 992)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_dummyHwnd", scope: !81, file: !2, line: 33, baseType: !61, size: 64, align: 64, offset: 1024)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_defBgBrush", scope: !81, file: !2, line: 34, baseType: !277, size: 64, align: 64, offset: 1088)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_hotBgBrush", scope: !81, file: !2, line: 34, baseType: !277, size: 64, align: 64, offset: 1152)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_borderBrush", scope: !81, file: !2, line: 34, baseType: !277, size: 64, align: 64, offset: 1216)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_grayBrush", scope: !81, file: !2, line: 34, baseType: !277, size: 64, align: 64, offset: 1280)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "onMenuShown", scope: !81, file: !2, line: 37, baseType: !261, size: 64, align: 64, offset: 1344)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "onMenuClose", scope: !81, file: !2, line: 37, baseType: !261, size: 64, align: 64, offset: 1408)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "onTrayMenuShown", scope: !81, file: !2, line: 38, baseType: !396, size: 64, align: 64, offset: 1472)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "onTrayMenuClose", scope: !81, file: !2, line: 38, baseType: !396, size: 64, align: 64, offset: 1536)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_className", scope: !27, file: !2, line: 69, baseType: !141, size: 64, align: 64, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_style", scope: !27, file: !2, line: 70, baseType: !373, size: 32, align: 32, offset: 768)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_exStyle", scope: !27, file: !2, line: 71, baseType: !373, size: 32, align: 32, offset: 800)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_drawMode", scope: !27, file: !2, line: 72, baseType: !67, size: 32, align: 32, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_isCreated", scope: !27, file: !2, line: 73, baseType: !3, size: 8, align: 8, offset: 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_lbDown", scope: !27, file: !2, line: 74, baseType: !3, size: 8, align: 8, offset: 872)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_rbDown", scope: !27, file: !2, line: 75, baseType: !3, size: 8, align: 8, offset: 880)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_isMouseEntered", scope: !27, file: !2, line: 76, baseType: !3, size: 8, align: 8, offset: 888)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_textable", scope: !27, file: !2, line: 77, baseType: !3, size: 8, align: 8, offset: 896)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_autoSizable", scope: !27, file: !2, line: 78, baseType: !3, size: 8, align: 8, offset: 904)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_cmenuUsed", scope: !27, file: !2, line: 79, baseType: !3, size: 8, align: 8, offset: 912)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_bkBrush", scope: !27, file: !2, line: 80, baseType: !277, size: 64, align: 64, offset: 960)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_wideText", scope: !27, file: !2, line: 81, baseType: !141, size: 64, align: 64, offset: 1024)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_wtext", scope: !27, file: !2, line: 82, baseType: !439, size: 64, align: 64, offset: 1088)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "WideString*", baseType: !440, size: 64, align: 64, dwarfAddressSpace: 0)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "WideString", scope: !2, file: !2, line: 6, size: 256, align: 64, elements: !441, identifier: "cforms.WideString")
!441 = !{!442, !445, !446, !447}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !440, file: !2, line: 7, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "WString", scope: !2, file: !2, line: 23, baseType: !444, align: 8)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ushort*", baseType: !143, size: 64, align: 64, dwarfAddressSpace: 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_inpLen", scope: !440, file: !2, line: 8, baseType: !72, size: 32, align: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_wcLen", scope: !440, file: !2, line: 9, baseType: !72, size: 32, align: 32, offset: 96)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_inpStr", scope: !440, file: !2, line: 10, baseType: !54, size: 128, align: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !27, file: !2, line: 83, baseType: !89, size: 320, align: 64, offset: 1152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_parent", scope: !27, file: !2, line: 84, baseType: !160, size: 64, align: 64, offset: 1472)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "onGotFocus", scope: !27, file: !2, line: 86, baseType: !261, size: 64, align: 64, offset: 1536)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "onLostFocus", scope: !27, file: !2, line: 87, baseType: !261, size: 64, align: 64, offset: 1600)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "onClick", scope: !27, file: !2, line: 88, baseType: !261, size: 64, align: 64, offset: 1664)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "onRightClick", scope: !27, file: !2, line: 89, baseType: !261, size: 64, align: 64, offset: 1728)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseEnter", scope: !27, file: !2, line: 90, baseType: !261, size: 64, align: 64, offset: 1792)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseLeave", scope: !27, file: !2, line: 91, baseType: !261, size: 64, align: 64, offset: 1856)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseDown", scope: !27, file: !2, line: 92, baseType: !457, size: 64, align: 64, offset: 1920)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "MouseEventHandler", scope: !2, file: !2, line: 5, baseType: !458, align: 8)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MouseEventHandler", baseType: !459, size: 64, align: 64, dwarfAddressSpace: 0)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !26, !461}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MouseEventArgs*", baseType: !462, size: 64, align: 64, dwarfAddressSpace: 0)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "MouseEventArgs", scope: !2, file: !2, line: 28, size: 192, align: 32, elements: !463, identifier: "cforms.MouseEventArgs")
!463 = !{!464, !465, !473, !474, !475, !476, !477}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "eventArgs", scope: !462, file: !2, line: 30, baseType: !266, size: 8, align: 8)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !462, file: !2, line: 31, baseType: !466, size: 32, align: 32, offset: 32)
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MouseButton", scope: !462, file: !2, line: 113, baseType: !72, size: 32, align: 32, elements: !467)
!467 = !{!180, !468, !469, !470, !471, !472}
!468 = !DIEnumerator(name: "RIGHT", value: 1)
!469 = !DIEnumerator(name: "MIDDLE", value: 2)
!470 = !DIEnumerator(name: "LEFT", value: 3)
!471 = !DIEnumerator(name: "XBUTTON1", value: 4)
!472 = !DIEnumerator(name: "XBUTTON2", value: 5)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "isShiftPressed", scope: !462, file: !2, line: 32, baseType: !3, size: 8, align: 8, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "isCtrlPressed", scope: !462, file: !2, line: 33, baseType: !3, size: 8, align: 8, offset: 72)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !462, file: !2, line: 34, baseType: !72, size: 32, align: 32, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !462, file: !2, line: 35, baseType: !72, size: 32, align: 32, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !462, file: !2, line: 36, baseType: !72, size: 32, align: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseUp", scope: !27, file: !2, line: 93, baseType: !457, size: 64, align: 64, offset: 1984)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseDown", scope: !27, file: !2, line: 94, baseType: !457, size: 64, align: 64, offset: 2048)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseUp", scope: !27, file: !2, line: 95, baseType: !457, size: 64, align: 64, offset: 2112)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseWheel", scope: !27, file: !2, line: 96, baseType: !457, size: 64, align: 64, offset: 2176)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseMove", scope: !27, file: !2, line: 97, baseType: !457, size: 64, align: 64, offset: 2240)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "onKeyDown", scope: !27, file: !2, line: 98, baseType: !484, size: 64, align: 64, offset: 2304)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "KeyEventHandler", scope: !2, file: !2, line: 7, baseType: !485, align: 8)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "KeyEventHandler", baseType: !486, size: 64, align: 64, dwarfAddressSpace: 0)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !26, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "KeyEventArgs*", baseType: !489, size: 64, align: 64, dwarfAddressSpace: 0)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyEventArgs", scope: !2, file: !2, line: 47, size: 160, align: 32, elements: !490, identifier: "cforms.KeyEventArgs")
!490 = !{!491, !492, !664, !665, !666, !667, !668, !669}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "eventArgs", scope: !489, file: !2, line: 49, baseType: !266, size: 8, align: 8)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "keyCode", scope: !489, file: !2, line: 50, baseType: !493, size: 32, align: 32, offset: 32)
!493 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Keys", scope: !489, file: !2, line: 165, baseType: !72, size: 32, align: 32, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!495 = !DIEnumerator(name: "MODIFIER", value: 0)
!496 = !DIEnumerator(name: "NOKEY", value: 1)
!497 = !DIEnumerator(name: "LBUTTON", value: 2)
!498 = !DIEnumerator(name: "RBUTTON", value: 3)
!499 = !DIEnumerator(name: "CANCEL", value: 4)
!500 = !DIEnumerator(name: "MBUTTON", value: 5)
!501 = !DIEnumerator(name: "XBUTTO1", value: 6)
!502 = !DIEnumerator(name: "XBUTTON2", value: 7)
!503 = !DIEnumerator(name: "BACK_SPACE", value: 8)
!504 = !DIEnumerator(name: "TAB", value: 9)
!505 = !DIEnumerator(name: "LINE_FEED", value: 10)
!506 = !DIEnumerator(name: "CLEAR", value: 11)
!507 = !DIEnumerator(name: "ENTER", value: 12)
!508 = !DIEnumerator(name: "SHIFT", value: 13)
!509 = !DIEnumerator(name: "CTRL", value: 14)
!510 = !DIEnumerator(name: "ALT", value: 15)
!511 = !DIEnumerator(name: "PAUSE", value: 16)
!512 = !DIEnumerator(name: "CAPS_LOCK", value: 17)
!513 = !DIEnumerator(name: "ESCAPE", value: 18)
!514 = !DIEnumerator(name: "SPACE", value: 19)
!515 = !DIEnumerator(name: "PAGE_UP", value: 20)
!516 = !DIEnumerator(name: "PAGE_DOWN", value: 21)
!517 = !DIEnumerator(name: "END", value: 22)
!518 = !DIEnumerator(name: "HOME", value: 23)
!519 = !DIEnumerator(name: "LEFTA_RROW", value: 24)
!520 = !DIEnumerator(name: "UP_ARROW", value: 25)
!521 = !DIEnumerator(name: "RIGHT_ARROW", value: 26)
!522 = !DIEnumerator(name: "DOWN_ARROW", value: 27)
!523 = !DIEnumerator(name: "SELECT", value: 28)
!524 = !DIEnumerator(name: "PRINT", value: 29)
!525 = !DIEnumerator(name: "EXECUTE", value: 30)
!526 = !DIEnumerator(name: "PRINT_SCREEN", value: 31)
!527 = !DIEnumerator(name: "INSERT", value: 32)
!528 = !DIEnumerator(name: "DEL", value: 33)
!529 = !DIEnumerator(name: "HELP", value: 34)
!530 = !DIEnumerator(name: "D0", value: 35)
!531 = !DIEnumerator(name: "D1", value: 36)
!532 = !DIEnumerator(name: "D2", value: 37)
!533 = !DIEnumerator(name: "D3", value: 38)
!534 = !DIEnumerator(name: "D4", value: 39)
!535 = !DIEnumerator(name: "D5", value: 40)
!536 = !DIEnumerator(name: "D6", value: 41)
!537 = !DIEnumerator(name: "D7", value: 42)
!538 = !DIEnumerator(name: "D8", value: 43)
!539 = !DIEnumerator(name: "D9", value: 44)
!540 = !DIEnumerator(name: "A", value: 45)
!541 = !DIEnumerator(name: "B", value: 46)
!542 = !DIEnumerator(name: "C", value: 47)
!543 = !DIEnumerator(name: "D", value: 48)
!544 = !DIEnumerator(name: "E", value: 49)
!545 = !DIEnumerator(name: "F", value: 50)
!546 = !DIEnumerator(name: "G", value: 51)
!547 = !DIEnumerator(name: "H", value: 52)
!548 = !DIEnumerator(name: "I", value: 53)
!549 = !DIEnumerator(name: "J", value: 54)
!550 = !DIEnumerator(name: "K", value: 55)
!551 = !DIEnumerator(name: "L", value: 56)
!552 = !DIEnumerator(name: "M", value: 57)
!553 = !DIEnumerator(name: "N", value: 58)
!554 = !DIEnumerator(name: "O", value: 59)
!555 = !DIEnumerator(name: "P", value: 60)
!556 = !DIEnumerator(name: "Q", value: 61)
!557 = !DIEnumerator(name: "R", value: 62)
!558 = !DIEnumerator(name: "S", value: 63)
!559 = !DIEnumerator(name: "T", value: 64)
!560 = !DIEnumerator(name: "U", value: 65)
!561 = !DIEnumerator(name: "V", value: 66)
!562 = !DIEnumerator(name: "W", value: 67)
!563 = !DIEnumerator(name: "X", value: 68)
!564 = !DIEnumerator(name: "Y", value: 69)
!565 = !DIEnumerator(name: "Z", value: 70)
!566 = !DIEnumerator(name: "LEFT_WIN", value: 71)
!567 = !DIEnumerator(name: "RIGH_TWIN", value: 72)
!568 = !DIEnumerator(name: "APPS", value: 73)
!569 = !DIEnumerator(name: "SLEEP", value: 74)
!570 = !DIEnumerator(name: "NUM_PAD0", value: 75)
!571 = !DIEnumerator(name: "NUM_PAD1", value: 76)
!572 = !DIEnumerator(name: "NUM_PAD2", value: 77)
!573 = !DIEnumerator(name: "NUM_PAD3", value: 78)
!574 = !DIEnumerator(name: "NUM_PAD4", value: 79)
!575 = !DIEnumerator(name: "NUM_PAD5", value: 80)
!576 = !DIEnumerator(name: "NUM_PAD6", value: 81)
!577 = !DIEnumerator(name: "NUM_PAD7", value: 82)
!578 = !DIEnumerator(name: "NUM_PAD8", value: 83)
!579 = !DIEnumerator(name: "NUM_PAD9", value: 84)
!580 = !DIEnumerator(name: "MULTIPLY", value: 85)
!581 = !DIEnumerator(name: "ADD", value: 86)
!582 = !DIEnumerator(name: "SEPERATOR", value: 87)
!583 = !DIEnumerator(name: "SUBTRACT", value: 88)
!584 = !DIEnumerator(name: "DECIMAL", value: 89)
!585 = !DIEnumerator(name: "DIVIDE", value: 90)
!586 = !DIEnumerator(name: "F1", value: 91)
!587 = !DIEnumerator(name: "F2", value: 92)
!588 = !DIEnumerator(name: "F3", value: 93)
!589 = !DIEnumerator(name: "F4", value: 94)
!590 = !DIEnumerator(name: "F5", value: 95)
!591 = !DIEnumerator(name: "F6", value: 96)
!592 = !DIEnumerator(name: "F7", value: 97)
!593 = !DIEnumerator(name: "F8", value: 98)
!594 = !DIEnumerator(name: "F9", value: 99)
!595 = !DIEnumerator(name: "F10", value: 100)
!596 = !DIEnumerator(name: "F11", value: 101)
!597 = !DIEnumerator(name: "F12", value: 102)
!598 = !DIEnumerator(name: "F13", value: 103)
!599 = !DIEnumerator(name: "F14", value: 104)
!600 = !DIEnumerator(name: "F15", value: 105)
!601 = !DIEnumerator(name: "F16", value: 106)
!602 = !DIEnumerator(name: "F17", value: 107)
!603 = !DIEnumerator(name: "F18", value: 108)
!604 = !DIEnumerator(name: "F19", value: 109)
!605 = !DIEnumerator(name: "F20", value: 110)
!606 = !DIEnumerator(name: "F21", value: 111)
!607 = !DIEnumerator(name: "F22", value: 112)
!608 = !DIEnumerator(name: "F23", value: 113)
!609 = !DIEnumerator(name: "F24", value: 114)
!610 = !DIEnumerator(name: "NUM_LOCK", value: 115)
!611 = !DIEnumerator(name: "SCROLL", value: 116)
!612 = !DIEnumerator(name: "LEFT_SHIFT", value: 117)
!613 = !DIEnumerator(name: "RIGHT_SHIFT", value: 118)
!614 = !DIEnumerator(name: "LEFT_CTRL", value: 119)
!615 = !DIEnumerator(name: "RIGHT_CTRL", value: 120)
!616 = !DIEnumerator(name: "LEFT_MENU", value: 121)
!617 = !DIEnumerator(name: "RIGHT_MENU", value: 122)
!618 = !DIEnumerator(name: "BROWSER_BACK", value: 123)
!619 = !DIEnumerator(name: "BROWSER_FORWARD", value: 124)
!620 = !DIEnumerator(name: "BROWER_REFRESH", value: 125)
!621 = !DIEnumerator(name: "BROWSER_STOP", value: 126)
!622 = !DIEnumerator(name: "BROWSER_SEARCH", value: 127)
!623 = !DIEnumerator(name: "BROWSER_FAVORITES", value: 128)
!624 = !DIEnumerator(name: "BROWSER_HOME", value: 129)
!625 = !DIEnumerator(name: "VOLUME_MUTE", value: 130)
!626 = !DIEnumerator(name: "VOLUME_DOWN", value: 131)
!627 = !DIEnumerator(name: "VOLUME_UP", value: 132)
!628 = !DIEnumerator(name: "MEDIA_NEXT_TRACK", value: 133)
!629 = !DIEnumerator(name: "MEDIA_PRE_VTRACK", value: 134)
!630 = !DIEnumerator(name: "MEDIA_STOP", value: 135)
!631 = !DIEnumerator(name: "MEDIA_PLAY_PAUSE", value: 136)
!632 = !DIEnumerator(name: "LAUNCH_MAIL", value: 137)
!633 = !DIEnumerator(name: "SELECT_MEDIA", value: 138)
!634 = !DIEnumerator(name: "LAUNCH_APP1", value: 139)
!635 = !DIEnumerator(name: "LAUNCH_APP2", value: 140)
!636 = !DIEnumerator(name: "OEM1", value: 141)
!637 = !DIEnumerator(name: "OEM_PLUS", value: 142)
!638 = !DIEnumerator(name: "OEM_COMMA", value: 143)
!639 = !DIEnumerator(name: "OEM_MINUS", value: 144)
!640 = !DIEnumerator(name: "OEM_PERIOD", value: 145)
!641 = !DIEnumerator(name: "OEM_QUESTION", value: 146)
!642 = !DIEnumerator(name: "OEM_TILDE", value: 147)
!643 = !DIEnumerator(name: "OEM_OPEN_BRACKET", value: 148)
!644 = !DIEnumerator(name: "OEM_PIPE", value: 149)
!645 = !DIEnumerator(name: "OEM_CLOSE_BRACKET", value: 150)
!646 = !DIEnumerator(name: "OEM_QUOTES", value: 151)
!647 = !DIEnumerator(name: "OEM8", value: 152)
!648 = !DIEnumerator(name: "OEM_BACK_SLASH", value: 153)
!649 = !DIEnumerator(name: "PROCESS", value: 154)
!650 = !DIEnumerator(name: "PACKET", value: 155)
!651 = !DIEnumerator(name: "ATTN", value: 156)
!652 = !DIEnumerator(name: "CRSEL", value: 157)
!653 = !DIEnumerator(name: "EXSEL", value: 158)
!654 = !DIEnumerator(name: "ERASE_EOF", value: 159)
!655 = !DIEnumerator(name: "PLAY", value: 160)
!656 = !DIEnumerator(name: "ZOOM", value: 161)
!657 = !DIEnumerator(name: "NONAME", value: 162)
!658 = !DIEnumerator(name: "PA1", value: 163)
!659 = !DIEnumerator(name: "OEM_CLEAR", value: 164)
!660 = !DIEnumerator(name: "KEY_CODE", value: 165)
!661 = !DIEnumerator(name: "SHIFT_MODIFIER", value: 166)
!662 = !DIEnumerator(name: "CTRL_MODIFIER", value: 167)
!663 = !DIEnumerator(name: "ALT_MODIFIER", value: 168)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !489, file: !2, line: 51, baseType: !493, size: 32, align: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "keyValue", scope: !489, file: !2, line: 52, baseType: !72, size: 32, align: 32, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "altPressed", scope: !489, file: !2, line: 53, baseType: !3, size: 8, align: 8, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ctrlPressed", scope: !489, file: !2, line: 54, baseType: !3, size: 8, align: 8, offset: 136)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "shiftPressed", scope: !489, file: !2, line: 55, baseType: !3, size: 8, align: 8, offset: 144)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "supressKey", scope: !489, file: !2, line: 56, baseType: !3, size: 8, align: 8, offset: 152)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "onKeyUp", scope: !27, file: !2, line: 99, baseType: !484, size: 64, align: 64, offset: 2368)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "onKeyPress", scope: !27, file: !2, line: 100, baseType: !484, size: 64, align: 64, offset: 2432)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "dummy", linkageName: "std_collections_list$p$cforms.Control$.dummy.27673", scope: !2, file: !2, line: 558, type: !72, isLocal: true, isDefinition: true, align: 4)
!674 = !{i32 1, !"CodeView", i32 1}
!675 = !{i32 2, !"Debug Info Version", i32 3}
!676 = !{i32 2, !"wchar_size", i32 2}
!677 = !{i32 4, !"PIC Level", i32 2}
!678 = !{i32 1, !"uwtable", i32 2}
!679 = !{i32 1, !"MaxTLSAlign", i32 65536}
!680 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !681, globals: !682, splitDebugInlining: false)
!681 = !{!30, !94, !145, !165, !178, !189, !195, !310, !353, !466, !493}
!682 = !{!0, !4, !6, !14, !672}
!683 = distinct !DISubprogram(name: "init", linkageName: "std_collections_list$p$cforms.Control$.List.init", scope: !2, file: !2, line: 30, type: !684, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!684 = !DISubroutineType(types: !685)
!685 = !{!686, !686, !8, !20}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "List*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!687 = !{}
!688 = !DILocation(line: 31, scope: !683)
!689 = !DILocalVariable(name: "self", arg: 1, scope: !683, file: !2, line: 30, type: !686)
!690 = !DILocation(line: 30, scope: !683)
!691 = !DILocalVariable(name: "allocator", arg: 2, scope: !683, file: !2, line: 30, type: !8)
!692 = !DILocalVariable(name: "initial_capacity", arg: 3, scope: !683, file: !2, line: 30, type: !19)
!693 = !DILocation(line: 32, scope: !683)
!694 = !DILocation(line: 33, scope: !683)
!695 = !DILocation(line: 34, scope: !683)
!696 = !DILocation(line: 35, scope: !683)
!697 = !DILocation(line: 36, scope: !683)
!698 = !DILocation(line: 37, scope: !683)
!699 = distinct !DISubprogram(name: "tinit", linkageName: "std_collections_list$p$cforms.Control$.List.tinit", scope: !2, file: !2, line: 46, type: !700, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!700 = !DISubroutineType(types: !701)
!701 = !{!686, !686, !20}
!702 = !DILocation(line: 47, scope: !699)
!703 = !DILocalVariable(name: "self", arg: 1, scope: !699, file: !2, line: 46, type: !686)
!704 = !DILocation(line: 46, scope: !699)
!705 = !DILocalVariable(name: "initial_capacity", arg: 2, scope: !699, file: !2, line: 46, type: !19)
!706 = !DILocation(line: 48, scope: !699)
!707 = distinct !DISubprogram(name: "init_with_array", linkageName: "std_collections_list$p$cforms.Control$.List.init_with_array", scope: !2, file: !2, line: 57, type: !708, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!708 = !DISubroutineType(types: !709)
!709 = !{!686, !686, !8, !710}
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "Control*[]", size: 128, align: 64, elements: !711, identifier: "Control*[]")
!711 = !{!712, !714}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !710, baseType: !713, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Control**", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !710, baseType: !19, size: 64, align: 64, offset: 64)
!715 = !DILocation(line: 58, scope: !707)
!716 = !DILocalVariable(name: "self", arg: 1, scope: !707, file: !2, line: 57, type: !686)
!717 = !DILocation(line: 57, scope: !707)
!718 = !DILocalVariable(name: "allocator", arg: 2, scope: !707, file: !2, line: 57, type: !8)
!719 = !DILocalVariable(name: "values", arg: 3, scope: !707, file: !2, line: 57, type: !720)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type[]", size: 128, align: 64, elements: !721, identifier: "Type[]")
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !720, baseType: !24, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !720, baseType: !19, size: 64, align: 64, offset: 64)
!724 = !DILocation(line: 55, scope: !725)
!725 = distinct !DILexicalBlock(scope: !707, file: !2, line: 58, column: 1)
!726 = !DILocation(line: 59, scope: !707)
!727 = !DILocation(line: 60, scope: !707)
!728 = !DILocation(line: 61, scope: !707)
!729 = distinct !DISubprogram(name: "tinit_with_array", linkageName: "std_collections_list$p$cforms.Control$.List.tinit_with_array", scope: !2, file: !2, line: 70, type: !730, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!730 = !DISubroutineType(types: !731)
!731 = !{!686, !686, !710}
!732 = !DILocation(line: 71, scope: !729)
!733 = !DILocalVariable(name: "self", arg: 1, scope: !729, file: !2, line: 70, type: !686)
!734 = !DILocation(line: 70, scope: !729)
!735 = !DILocalVariable(name: "values", arg: 2, scope: !729, file: !2, line: 70, type: !720)
!736 = !DILocation(line: 68, scope: !737)
!737 = distinct !DILexicalBlock(scope: !729, file: !2, line: 71, column: 1)
!738 = !DILocation(line: 72, scope: !729)
!739 = !DILocation(line: 73, scope: !729)
!740 = !DILocation(line: 74, scope: !729)
!741 = distinct !DISubprogram(name: "init_wrapping_array", linkageName: "std_collections_list$p$cforms.Control$.List.init_wrapping_array", scope: !2, file: !2, line: 80, type: !742, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !686, !8, !710}
!744 = !DILocation(line: 81, scope: !741)
!745 = !DILocalVariable(name: "self", arg: 1, scope: !741, file: !2, line: 80, type: !686)
!746 = !DILocation(line: 80, scope: !741)
!747 = !DILocalVariable(name: "allocator", arg: 2, scope: !741, file: !2, line: 80, type: !8)
!748 = !DILocalVariable(name: "types", arg: 3, scope: !741, file: !2, line: 80, type: !720)
!749 = !DILocation(line: 78, scope: !750)
!750 = distinct !DILexicalBlock(scope: !741, file: !2, line: 81, column: 1)
!751 = !DILocation(line: 82, scope: !741)
!752 = !DILocation(line: 83, scope: !741)
!753 = !DILocation(line: 84, scope: !741)
!754 = !DILocation(line: 85, scope: !741)
!755 = !DILocation(line: 422, scope: !741)
!756 = distinct !DISubprogram(name: "is_initialized", linkageName: "std_collections_list$p$cforms.Control$.List.is_initialized", scope: !2, file: !2, line: 88, type: !757, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!757 = !DISubroutineType(types: !758)
!758 = !{!3, !686}
!759 = !DILocation(line: 88, scope: !756)
!760 = !DILocalVariable(name: "self", arg: 1, scope: !756, file: !2, line: 88, type: !686)
!761 = distinct !DISubprogram(name: "to_format", linkageName: "std_collections_list$p$cforms.Control$.List.to_format", scope: !2, file: !2, line: 90, type: !762, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!762 = !DISubroutineType(types: !763)
!763 = !{!764, !765, !686, !766}
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !78)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !767, size: 64, align: 64, dwarfAddressSpace: 0)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 63, size: 320, align: 64, elements: !768, identifier: "std.io.Formatter")
!768 = !{!769, !770, !775}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !767, file: !2, line: 65, baseType: !11, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !767, file: !2, line: 66, baseType: !771, size: 64, align: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 16, baseType: !772, align: 8)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !773, size: 64, align: 64, dwarfAddressSpace: 0)
!773 = !DISubroutineType(types: !774)
!774 = !{!764, !11, !11, !31}
!775 = !DIDerivedType(tag: DW_TAG_member, scope: !767, file: !2, line: 67, baseType: !776, size: 192, align: 64, offset: 128)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !767, file: !2, line: 67, size: 192, align: 64, elements: !777)
!777 = !{!778, !779, !780, !781}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !776, file: !2, line: 69, baseType: !67, size: 32, align: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !776, file: !2, line: 70, baseType: !67, size: 32, align: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !776, file: !2, line: 71, baseType: !67, size: 32, align: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !776, file: !2, line: 72, baseType: !764, size: 64, align: 64, offset: 128)
!782 = !DILocation(line: 91, scope: !761)
!783 = !DILocalVariable(name: "self", arg: 1, scope: !761, file: !2, line: 90, type: !686)
!784 = !DILocation(line: 90, scope: !761)
!785 = !DILocalVariable(name: "formatter", arg: 2, scope: !761, file: !2, line: 90, type: !766)
!786 = !DILocation(line: 92, scope: !787)
!787 = distinct !DILexicalBlock(scope: !761, file: !2, line: 92, column: 2)
!788 = !DILocation(line: 95, scope: !789)
!789 = distinct !DILexicalBlock(scope: !787, file: !2, line: 95, column: 4)
!790 = !DILocation(line: 97, scope: !791)
!791 = distinct !DILexicalBlock(scope: !787, file: !2, line: 97, column: 4)
!792 = !DILocalVariable(name: "n", scope: !793, file: !2, line: 99, type: !19, align: 8)
!793 = distinct !DILexicalBlock(scope: !787, file: !2, line: 99, column: 4)
!794 = !DILocation(line: 99, scope: !793)
!795 = !DILocation(line: 100, scope: !796)
!796 = distinct !DILexicalBlock(scope: !793, file: !2, line: 100, column: 4)
!797 = !DILocalVariable(name: ".temp", scope: !796, file: !2, line: 100, type: !19, align: 8)
!798 = !DILocalVariable(name: "i", scope: !799, file: !2, line: 100, type: !19, align: 8)
!799 = distinct !DILexicalBlock(scope: !796, file: !2, line: 101, column: 4)
!800 = !DILocation(line: 100, scope: !799)
!801 = !DILocalVariable(name: "element", scope: !799, file: !2, line: 100, type: !26, align: 8)
!802 = !DILocation(line: 102, scope: !803)
!803 = distinct !DILexicalBlock(scope: !799, file: !2, line: 101, column: 4)
!804 = !DILocation(line: 103, scope: !803)
!805 = !DILocation(line: 105, scope: !793)
!806 = !DILocation(line: 106, scope: !793)
!807 = distinct !DISubprogram(name: "push", linkageName: "std_collections_list$p$cforms.Control$.List.push", scope: !2, file: !2, line: 110, type: !808, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !686, !26}
!810 = !DILocation(line: 111, scope: !807)
!811 = !DILocalVariable(name: "self", arg: 1, scope: !807, file: !2, line: 110, type: !686)
!812 = !DILocation(line: 110, scope: !807)
!813 = !DILocalVariable(name: "element", arg: 2, scope: !807, file: !2, line: 110, type: !25)
!814 = !DILocation(line: 112, scope: !807)
!815 = !DILocation(line: 113, scope: !807)
!816 = !DILocation(line: 422, scope: !807)
!817 = distinct !DISubprogram(name: "pop", linkageName: "std_collections_list$p$cforms.Control$.List.pop", scope: !2, file: !2, line: 116, type: !818, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!818 = !DISubroutineType(types: !819)
!819 = !{!764, !24, !686}
!820 = !DILocation(line: 117, scope: !817)
!821 = !DILocalVariable(name: "self", arg: 1, scope: !817, file: !2, line: 116, type: !686)
!822 = !DILocation(line: 116, scope: !817)
!823 = !DILocation(line: 118, scope: !817)
!824 = !DILocation(line: 120, scope: !817)
!825 = !DILocation(line: 119, scope: !826)
!826 = distinct !DILexicalBlock(scope: !817, file: !2, line: 119, column: 8)
!827 = !DILocation(line: 422, scope: !826)
!828 = distinct !DISubprogram(name: "clear", linkageName: "std_collections_list$p$cforms.Control$.List.clear", scope: !2, file: !2, line: 123, type: !829, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !680, retainedNodes: !687)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !686}
!831 = !DILocation(line: 124, scope: !828)
!832 = !DILocalVariable(name: "self", arg: 1, scope: !828, file: !2, line: 123, type: !686)
!833 = !DILocation(line: 123, scope: !828)
!834 = !DILocation(line: 125, scope: !828)
!835 = !DILocation(line: 422, scope: !828)
