; ModuleID = 'std_collections_list$p$cforms.ListViewItem$'
source_filename = "std_collections_list$p$cforms.ListViewItem$"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }
%"char[]" = type { ptr, i64 }
%"ListViewItem*[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$"std_collections_list$p$cforms.ListViewItem$.List.init" = comdat any

$"std_collections_list$p$cforms.ListViewItem$.List.tinit" = comdat any

$"std_collections_list$p$cforms.ListViewItem$.List.init_with_array" = comdat any

$"std_collections_list$p$cforms.ListViewItem$.List.tinit_with_array" = comdat any

$"std_collections_list$p$cforms.ListViewItem$.List.init_wrapping_array" = comdat any

$"std_collections_list$p$cforms.ListViewItem$.List.is_initialized" = comdat any

$"std_collections_list$p$cforms.ListViewItem$.List.to_format" = comdat any

$"std_collections_list$p$cforms.ListViewItem$.List.push" = comdat any

$"std_collections_list$p$cforms.ListViewItem$.List.pop" = comdat any

$"std_collections_list$p$cforms.ListViewItem$.List.clear" = comdat any

$"std_collections_list$p$cforms.ListViewItem$.List.pop_first" = comdat any

$"std_collections_list$p$cforms.ListViewItem$.List.remove_at" = comdat any

$"std_collections_list$p$cforms.ListViewItem$.List.add_all" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ELEMENT_IS_EQUATABLE", linkageName: "std_collections_list$p$cforms.ListViewItem$.ELEMENT_IS_EQUATABLE", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 1)
!2 = !DIFile(filename: "list.c3", directory: "C:/Compilers/C3/lib/std/collections")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "ELEMENT_IS_POINTER", linkageName: "std_collections_list$p$cforms.ListViewItem$.ELEMENT_IS_POINTER", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 1)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "LIST_HEAP_ALLOCATOR", linkageName: "std_collections_list$p$cforms.ListViewItem$.LIST_HEAP_ALLOCATOR", scope: !2, file: !2, line: 12, type: !8, isLocal: false, isDefinition: true, align: 8)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !9, identifier: "Allocator")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !8, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "ONHEAP", linkageName: "std_collections_list$p$cforms.ListViewItem$.ONHEAP", scope: !2, file: !2, line: 14, type: !16, isLocal: false, isDefinition: true, align: 8)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !17, identifier: "std_collections_list$p$cforms.ListViewItem$.List")
!17 = !{!18, !21, !22, !23}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !16, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !20)
!20 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !16, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !16, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !16, file: !2, line: 23, baseType: !24, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 51, baseType: !26, align: 8)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ListViewItem*", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "ListViewItem", scope: !2, file: !2, line: 97, size: 1024, align: 64, elements: !28, identifier: "cforms.ListViewItem")
!28 = !{!29, !37, !44, !45, !47, !48, !72, !73}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !27, file: !2, line: 99, baseType: !30, size: 128, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !32, identifier: "char[]")
!32 = !{!33, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !31, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !31, baseType: !19, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", scope: !27, file: !2, line: 100, baseType: !38, size: 64, align: 32, offset: 128)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", scope: !27, file: !2, line: 14, size: 64, align: 32, elements: !39, identifier: "cforms.Color")
!39 = !{!40, !42}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !38, file: !2, line: 16, baseType: !41, size: 32, align: 32)
!41 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !38, file: !2, line: 17, baseType: !43, size: 32, align: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colorref", scope: !2, file: !2, line: 36, baseType: !41, align: 4)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", scope: !27, file: !2, line: 101, baseType: !38, size: 64, align: 32, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "imageIndex", scope: !27, file: !2, line: 102, baseType: !46, size: 32, align: 32, offset: 256)
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !27, file: !2, line: 103, baseType: !46, size: 32, align: 32, offset: 288)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !27, file: !2, line: 104, baseType: !49, size: 320, align: 64, offset: 320)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Font", scope: !27, file: !2, line: 5, size: 320, align: 64, elements: !50, identifier: "cforms.Font")
!50 = !{!51, !52, !53, !65, !66, !67, !68, !69}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !49, file: !2, line: 7, baseType: !30, size: 128, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !49, file: !2, line: 8, baseType: !46, size: 32, align: 32, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !49, file: !2, line: 9, baseType: !54, size: 32, align: 32, offset: 160)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FontWeight", scope: !49, file: !2, line: 45, baseType: !46, size: 32, align: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64}
!56 = !DIEnumerator(name: "THIN", value: 0)
!57 = !DIEnumerator(name: "EXTRA_LIGHT", value: 1)
!58 = !DIEnumerator(name: "LIGHT", value: 2)
!59 = !DIEnumerator(name: "NORMAL", value: 3)
!60 = !DIEnumerator(name: "MEDIUM", value: 4)
!61 = !DIEnumerator(name: "SEMI_BOLD", value: 5)
!62 = !DIEnumerator(name: "BOLD", value: 6)
!63 = !DIEnumerator(name: "EXTRA_BOLD", value: 7)
!64 = !DIEnumerator(name: "THICK", value: 8)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "italics", scope: !49, file: !2, line: 10, baseType: !3, size: 8, align: 8, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "underline", scope: !49, file: !2, line: 11, baseType: !3, size: 8, align: 8, offset: 200)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "strikeout", scope: !49, file: !2, line: 12, baseType: !3, size: 8, align: 8, offset: 208)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_isCreated", scope: !49, file: !2, line: 13, baseType: !3, size: 8, align: 8, offset: 216)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !49, file: !2, line: 14, baseType: !70, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hfont", scope: !2, file: !2, line: 12, baseType: !71, align: 8)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "Handle", scope: !2, file: !2, line: 6, baseType: !11, align: 8)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "checked", scope: !27, file: !2, line: 105, baseType: !3, size: 8, align: 8, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "subItems", scope: !27, file: !2, line: 106, baseType: !74, size: 320, align: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "StrList", scope: !2, file: !2, line: 9, baseType: !75, align: 8)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !76, identifier: "std_collections_list$String$.List")
!76 = !{!77, !78, !79, !80}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !75, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !75, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !75, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !75, file: !2, line: 23, baseType: !81, size: 64, align: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !82, size: 64, align: 64, dwarfAddressSpace: 0)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 9, baseType: !30, align: 8)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "dummy", linkageName: "std_collections_list$p$cforms.ListViewItem$.dummy.28823", scope: !2, file: !2, line: 558, type: !46, isLocal: true, isDefinition: true, align: 4)
!85 = !{i32 1, !"CodeView", i32 1}
!86 = !{i32 2, !"Debug Info Version", i32 3}
!87 = !{i32 2, !"wchar_size", i32 2}
!88 = !{i32 4, !"PIC Level", i32 2}
!89 = !{i32 1, !"uwtable", i32 2}
!90 = !{i32 1, !"MaxTLSAlign", i32 65536}
!91 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !92, globals: !93, splitDebugInlining: false)
!92 = !{!54}
!93 = !{!0, !4, !6, !14, !83}
!94 = distinct !DISubprogram(name: "init", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.init", scope: !2, file: !2, line: 30, type: !95, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!95 = !DISubroutineType(types: !96)
!96 = !{!97, !97, !8, !20}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "List*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!98 = !{}
!99 = !DILocation(line: 31, scope: !94)
!100 = !DILocalVariable(name: "self", arg: 1, scope: !94, file: !2, line: 30, type: !97)
!101 = !DILocation(line: 30, scope: !94)
!102 = !DILocalVariable(name: "allocator", arg: 2, scope: !94, file: !2, line: 30, type: !8)
!103 = !DILocalVariable(name: "initial_capacity", arg: 3, scope: !94, file: !2, line: 30, type: !19)
!104 = !DILocation(line: 32, scope: !94)
!105 = !DILocation(line: 33, scope: !94)
!106 = !DILocation(line: 34, scope: !94)
!107 = !DILocation(line: 35, scope: !94)
!108 = !DILocation(line: 36, scope: !94)
!109 = !DILocation(line: 37, scope: !94)
!110 = distinct !DISubprogram(name: "tinit", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.tinit", scope: !2, file: !2, line: 46, type: !111, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!111 = !DISubroutineType(types: !112)
!112 = !{!97, !97, !20}
!113 = !DILocation(line: 47, scope: !110)
!114 = !DILocalVariable(name: "self", arg: 1, scope: !110, file: !2, line: 46, type: !97)
!115 = !DILocation(line: 46, scope: !110)
!116 = !DILocalVariable(name: "initial_capacity", arg: 2, scope: !110, file: !2, line: 46, type: !19)
!117 = !DILocation(line: 48, scope: !110)
!118 = distinct !DISubprogram(name: "init_with_array", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.init_with_array", scope: !2, file: !2, line: 57, type: !119, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!119 = !DISubroutineType(types: !120)
!120 = !{!97, !97, !8, !121}
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "ListViewItem*[]", size: 128, align: 64, elements: !122, identifier: "ListViewItem*[]")
!122 = !{!123, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !121, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ListViewItem**", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !121, baseType: !19, size: 64, align: 64, offset: 64)
!126 = !DILocation(line: 58, scope: !118)
!127 = !DILocalVariable(name: "self", arg: 1, scope: !118, file: !2, line: 57, type: !97)
!128 = !DILocation(line: 57, scope: !118)
!129 = !DILocalVariable(name: "allocator", arg: 2, scope: !118, file: !2, line: 57, type: !8)
!130 = !DILocalVariable(name: "values", arg: 3, scope: !118, file: !2, line: 57, type: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type[]", size: 128, align: 64, elements: !132, identifier: "Type[]")
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !131, baseType: !24, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !131, baseType: !19, size: 64, align: 64, offset: 64)
!135 = !DILocation(line: 55, scope: !136)
!136 = distinct !DILexicalBlock(scope: !118, file: !2, line: 58, column: 1)
!137 = !DILocation(line: 59, scope: !118)
!138 = !DILocation(line: 60, scope: !118)
!139 = !DILocation(line: 61, scope: !118)
!140 = distinct !DISubprogram(name: "tinit_with_array", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.tinit_with_array", scope: !2, file: !2, line: 70, type: !141, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!141 = !DISubroutineType(types: !142)
!142 = !{!97, !97, !121}
!143 = !DILocation(line: 71, scope: !140)
!144 = !DILocalVariable(name: "self", arg: 1, scope: !140, file: !2, line: 70, type: !97)
!145 = !DILocation(line: 70, scope: !140)
!146 = !DILocalVariable(name: "values", arg: 2, scope: !140, file: !2, line: 70, type: !131)
!147 = !DILocation(line: 68, scope: !148)
!148 = distinct !DILexicalBlock(scope: !140, file: !2, line: 71, column: 1)
!149 = !DILocation(line: 72, scope: !140)
!150 = !DILocation(line: 73, scope: !140)
!151 = !DILocation(line: 74, scope: !140)
!152 = distinct !DISubprogram(name: "init_wrapping_array", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.init_wrapping_array", scope: !2, file: !2, line: 80, type: !153, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !97, !8, !121}
!155 = !DILocation(line: 81, scope: !152)
!156 = !DILocalVariable(name: "self", arg: 1, scope: !152, file: !2, line: 80, type: !97)
!157 = !DILocation(line: 80, scope: !152)
!158 = !DILocalVariable(name: "allocator", arg: 2, scope: !152, file: !2, line: 80, type: !8)
!159 = !DILocalVariable(name: "types", arg: 3, scope: !152, file: !2, line: 80, type: !131)
!160 = !DILocation(line: 78, scope: !161)
!161 = distinct !DILexicalBlock(scope: !152, file: !2, line: 81, column: 1)
!162 = !DILocation(line: 82, scope: !152)
!163 = !DILocation(line: 83, scope: !152)
!164 = !DILocation(line: 84, scope: !152)
!165 = !DILocation(line: 85, scope: !152)
!166 = !DILocation(line: 422, scope: !152)
!167 = distinct !DISubprogram(name: "is_initialized", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.is_initialized", scope: !2, file: !2, line: 88, type: !168, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!168 = !DISubroutineType(types: !169)
!169 = !{!3, !97}
!170 = !DILocation(line: 88, scope: !167)
!171 = !DILocalVariable(name: "self", arg: 1, scope: !167, file: !2, line: 88, type: !97)
!172 = distinct !DISubprogram(name: "to_format", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.to_format", scope: !2, file: !2, line: 90, type: !173, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !177, !97, !178}
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !176)
!176 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !179, size: 64, align: 64, dwarfAddressSpace: 0)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 63, size: 320, align: 64, elements: !180, identifier: "std.io.Formatter")
!180 = !{!181, !182, !187}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !2, line: 65, baseType: !11, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !179, file: !2, line: 66, baseType: !183, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 16, baseType: !184, align: 8)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !185, size: 64, align: 64, dwarfAddressSpace: 0)
!185 = !DISubroutineType(types: !186)
!186 = !{!175, !11, !11, !35}
!187 = !DIDerivedType(tag: DW_TAG_member, scope: !179, file: !2, line: 67, baseType: !188, size: 192, align: 64, offset: 128)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !179, file: !2, line: 67, size: 192, align: 64, elements: !189)
!189 = !{!190, !191, !192, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !188, file: !2, line: 69, baseType: !41, size: 32, align: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !188, file: !2, line: 70, baseType: !41, size: 32, align: 32, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !188, file: !2, line: 71, baseType: !41, size: 32, align: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !188, file: !2, line: 72, baseType: !175, size: 64, align: 64, offset: 128)
!194 = !DILocation(line: 91, scope: !172)
!195 = !DILocalVariable(name: "self", arg: 1, scope: !172, file: !2, line: 90, type: !97)
!196 = !DILocation(line: 90, scope: !172)
!197 = !DILocalVariable(name: "formatter", arg: 2, scope: !172, file: !2, line: 90, type: !178)
!198 = !DILocation(line: 92, scope: !199)
!199 = distinct !DILexicalBlock(scope: !172, file: !2, line: 92, column: 2)
!200 = !DILocation(line: 95, scope: !201)
!201 = distinct !DILexicalBlock(scope: !199, file: !2, line: 95, column: 4)
!202 = !DILocation(line: 97, scope: !203)
!203 = distinct !DILexicalBlock(scope: !199, file: !2, line: 97, column: 4)
!204 = !DILocalVariable(name: "n", scope: !205, file: !2, line: 99, type: !19, align: 8)
!205 = distinct !DILexicalBlock(scope: !199, file: !2, line: 99, column: 4)
!206 = !DILocation(line: 99, scope: !205)
!207 = !DILocation(line: 100, scope: !208)
!208 = distinct !DILexicalBlock(scope: !205, file: !2, line: 100, column: 4)
!209 = !DILocalVariable(name: ".temp", scope: !208, file: !2, line: 100, type: !19, align: 8)
!210 = !DILocalVariable(name: "i", scope: !211, file: !2, line: 100, type: !19, align: 8)
!211 = distinct !DILexicalBlock(scope: !208, file: !2, line: 101, column: 4)
!212 = !DILocation(line: 100, scope: !211)
!213 = !DILocalVariable(name: "element", scope: !211, file: !2, line: 100, type: !26, align: 8)
!214 = !DILocation(line: 102, scope: !215)
!215 = distinct !DILexicalBlock(scope: !211, file: !2, line: 101, column: 4)
!216 = !DILocation(line: 103, scope: !215)
!217 = !DILocation(line: 105, scope: !205)
!218 = !DILocation(line: 106, scope: !205)
!219 = distinct !DISubprogram(name: "push", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.push", scope: !2, file: !2, line: 110, type: !220, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !97, !26}
!222 = !DILocation(line: 111, scope: !219)
!223 = !DILocalVariable(name: "self", arg: 1, scope: !219, file: !2, line: 110, type: !97)
!224 = !DILocation(line: 110, scope: !219)
!225 = !DILocalVariable(name: "element", arg: 2, scope: !219, file: !2, line: 110, type: !25)
!226 = !DILocation(line: 112, scope: !219)
!227 = !DILocation(line: 113, scope: !219)
!228 = !DILocation(line: 422, scope: !219)
!229 = distinct !DISubprogram(name: "pop", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.pop", scope: !2, file: !2, line: 116, type: !230, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!230 = !DISubroutineType(types: !231)
!231 = !{!175, !24, !97}
!232 = !DILocation(line: 117, scope: !229)
!233 = !DILocalVariable(name: "self", arg: 1, scope: !229, file: !2, line: 116, type: !97)
!234 = !DILocation(line: 116, scope: !229)
!235 = !DILocation(line: 118, scope: !229)
!236 = !DILocation(line: 120, scope: !229)
!237 = !DILocation(line: 119, scope: !238)
!238 = distinct !DILexicalBlock(scope: !229, file: !2, line: 119, column: 8)
!239 = !DILocation(line: 422, scope: !238)
!240 = distinct !DISubprogram(name: "clear", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.clear", scope: !2, file: !2, line: 123, type: !241, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !97}
!243 = !DILocation(line: 124, scope: !240)
!244 = !DILocalVariable(name: "self", arg: 1, scope: !240, file: !2, line: 123, type: !97)
!245 = !DILocation(line: 123, scope: !240)
!246 = !DILocation(line: 125, scope: !240)
!247 = !DILocation(line: 422, scope: !240)
!248 = distinct !DISubprogram(name: "pop_first", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.pop_first", scope: !2, file: !2, line: 128, type: !230, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!249 = !DILocation(line: 129, scope: !248)
!250 = !DILocalVariable(name: "self", arg: 1, scope: !248, file: !2, line: 128, type: !97)
!251 = !DILocation(line: 128, scope: !248)
!252 = !DILocation(line: 130, scope: !248)
!253 = !DILocation(line: 132, scope: !248)
!254 = !DILocation(line: 131, scope: !255)
!255 = distinct !DILexicalBlock(scope: !248, file: !2, line: 131, column: 8)
!256 = !DILocation(line: 136, scope: !255)
!257 = distinct !DISubprogram(name: "remove_at", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.remove_at", scope: !2, file: !2, line: 138, type: !258, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !97, !20}
!260 = !DILocation(line: 139, scope: !257)
!261 = !DILocalVariable(name: "self", arg: 1, scope: !257, file: !2, line: 138, type: !97)
!262 = !DILocation(line: 138, scope: !257)
!263 = !DILocalVariable(name: "index", arg: 2, scope: !257, file: !2, line: 138, type: !19)
!264 = !DILocation(line: 136, scope: !265)
!265 = distinct !DILexicalBlock(scope: !257, file: !2, line: 139, column: 1)
!266 = !DILocation(line: 140, scope: !257)
!267 = !DILocation(line: 422, scope: !257)
!268 = !DILocation(line: 141, scope: !257)
!269 = !DILocation(line: 142, scope: !257)
!270 = distinct !DISubprogram(name: "add_all", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.add_all", scope: !2, file: !2, line: 145, type: !271, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !97, !97}
!273 = !DILocation(line: 146, scope: !270)
!274 = !DILocalVariable(name: "self", arg: 1, scope: !270, file: !2, line: 145, type: !97)
!275 = !DILocation(line: 145, scope: !270)
!276 = !DILocalVariable(name: "other_list", arg: 2, scope: !270, file: !2, line: 145, type: !97)
!277 = !DILocation(line: 147, scope: !270)
!278 = !DILocation(line: 148, scope: !270)
!279 = !DILocalVariable(name: "index", scope: !270, file: !2, line: 149, type: !19, align: 8)
!280 = !DILocation(line: 149, scope: !270)
!281 = !DILocation(line: 422, scope: !270)
!282 = !DILocation(line: 150, scope: !283)
!283 = distinct !DILexicalBlock(scope: !270, file: !2, line: 150, column: 2)
!284 = !DILocalVariable(name: ".temp", scope: !283, file: !2, line: 150, type: !19, align: 8)
!285 = !DILocalVariable(name: "value", scope: !286, file: !2, line: 150, type: !24, align: 8)
!286 = distinct !DILexicalBlock(scope: !283, file: !2, line: 151, column: 2)
!287 = !DILocation(line: 150, scope: !286)
!288 = !DILocation(line: 384, scope: !286)
!289 = !DILocation(line: 152, scope: !290)
!290 = distinct !DILexicalBlock(scope: !286, file: !2, line: 151, column: 2)
!291 = distinct !DISubprogram(name: "to_aligned_array", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.to_aligned_array", scope: !2, file: !2, line: 160, type: !292, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!292 = !DISubroutineType(types: !293)
!293 = !{!131, !97, !8}
!294 = !DILocation(line: 161, scope: !291)
!295 = !DILocalVariable(name: "self", arg: 1, scope: !291, file: !2, line: 160, type: !97)
!296 = !DILocation(line: 160, scope: !291)
!297 = !DILocalVariable(name: "allocator", arg: 2, scope: !291, file: !2, line: 160, type: !8)
!298 = !DILocation(line: 8, scope: !299, inlinedAt: !301)
!299 = distinct !DISubprogram(name: "list_to_aligned_array", linkageName: "list_to_aligned_array", scope: !300, file: !300, line: 6, scopeLine: 6, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91, retainedNodes: !98)
!300 = !DIFile(filename: "list_common.c3", directory: "C:/Compilers/C3/lib/std/collections")
!301 = !DILocation(line: 162, scope: !291)
!302 = !DILocalVariable(name: "result", scope: !299, file: !2, line: 9, type: !121, align: 8)
!303 = !DILocation(line: 9, scope: !299, inlinedAt: !301)
!304 = !DILocation(line: 296, scope: !305, inlinedAt: !303)
!305 = distinct !DISubprogram(name: "alloc_array_aligned", linkageName: "alloc_array_aligned", scope: !306, file: !306, line: 294, scopeLine: 294, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91)
!306 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Compilers/C3/lib/std/core")
!307 = !DILocation(line: 128, scope: !308, inlinedAt: !304)
!308 = distinct !DISubprogram(name: "malloc_aligned", linkageName: "malloc_aligned", scope: !306, file: !306, line: 126, scopeLine: 126, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91)
!309 = !DILocation(line: 134, scope: !308, inlinedAt: !304)
!310 = !DILocation(line: 38, scope: !308, inlinedAt: !304)
!311 = !DILocation(line: 975, scope: !312, inlinedAt: !310)
!312 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !313, file: !313, line: 973, scopeLine: 973, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91)
!313 = !DIFile(filename: "math.c3", directory: "C:/Compilers/C3/lib/std/math")
!314 = !DILocation(line: 10, scope: !299, inlinedAt: !301)
!315 = !DILocation(line: 11, scope: !299, inlinedAt: !301)
!316 = distinct !DISubprogram(name: "to_tarray", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.to_tarray", scope: !2, file: !2, line: 173, type: !317, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!317 = !DISubroutineType(types: !318)
!318 = !{!131, !97}
!319 = !DILocation(line: 174, scope: !316)
!320 = !DILocalVariable(name: "self", arg: 1, scope: !316, file: !2, line: 173, type: !97)
!321 = !DILocation(line: 173, scope: !316)
!322 = !DILocation(line: 178, scope: !316)
!323 = !DILocation(line: 168, scope: !324, inlinedAt: !322)
!324 = distinct !DILexicalBlock(scope: !325, file: !2, line: 169, column: 1)
!325 = distinct !DISubprogram(name: "to_array", linkageName: "to_array", scope: !2, file: !2, line: 168, scopeLine: 168, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91)
!326 = !DILocation(line: 16, scope: !327, inlinedAt: !328)
!327 = distinct !DISubprogram(name: "list_to_array", linkageName: "list_to_array", scope: !300, file: !300, line: 14, scopeLine: 14, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91, retainedNodes: !98)
!328 = !DILocation(line: 170, scope: !325, inlinedAt: !322)
!329 = !DILocalVariable(name: "result", scope: !327, file: !2, line: 17, type: !121, align: 8)
!330 = !DILocation(line: 17, scope: !327, inlinedAt: !328)
!331 = !DILocation(line: 304, scope: !332, inlinedAt: !333)
!332 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !306, file: !306, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91)
!333 = !DILocation(line: 287, scope: !334, inlinedAt: !330)
!334 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !306, file: !306, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91)
!335 = !DILocation(line: 80, scope: !336, inlinedAt: !331)
!336 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !306, file: !306, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91)
!337 = !DILocation(line: 86, scope: !336, inlinedAt: !331)
!338 = !DILocation(line: 38, scope: !336, inlinedAt: !331)
!339 = !DILocation(line: 975, scope: !340, inlinedAt: !338)
!340 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !313, file: !313, line: 973, scopeLine: 973, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91)
!341 = !DILocation(line: 18, scope: !327, inlinedAt: !328)
!342 = !DILocation(line: 19, scope: !327, inlinedAt: !328)
!343 = distinct !DISubprogram(name: "reverse", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.reverse", scope: !2, file: !2, line: 185, type: !241, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!344 = !DILocation(line: 186, scope: !343)
!345 = !DILocalVariable(name: "self", arg: 1, scope: !343, file: !2, line: 185, type: !97)
!346 = !DILocation(line: 185, scope: !343)
!347 = !DILocation(line: 24, scope: !348, inlinedAt: !349)
!348 = distinct !DISubprogram(name: "list_reverse", linkageName: "list_reverse", scope: !300, file: !300, line: 22, scopeLine: 22, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91, retainedNodes: !98)
!349 = !DILocation(line: 187, scope: !343)
!350 = !DILocalVariable(name: "half", scope: !348, file: !2, line: 25, type: !19, align: 8)
!351 = !DILocation(line: 25, scope: !348, inlinedAt: !349)
!352 = !DILocalVariable(name: "end", scope: !348, file: !2, line: 26, type: !19, align: 8)
!353 = !DILocation(line: 26, scope: !348, inlinedAt: !349)
!354 = !DILocalVariable(name: "i", scope: !355, file: !2, line: 27, type: !19, align: 8)
!355 = distinct !DILexicalBlock(scope: !348, file: !300, line: 27, column: 2)
!356 = !DILocation(line: 27, scope: !355, inlinedAt: !349)
!357 = !DILocalVariable(name: "temp", scope: !358, file: !2, line: 79, type: !26, align: 8)
!358 = distinct !DISubprogram(name: "@swap", linkageName: "@swap", scope: !359, file: !359, line: 77, scopeLine: 77, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91, retainedNodes: !98)
!359 = !DIFile(filename: "builtin.c3", directory: "C:/Compilers/C3/lib/std/core")
!360 = !DILocation(line: 79, scope: !358, inlinedAt: !361)
!361 = !DILocation(line: 29, scope: !362, inlinedAt: !349)
!362 = distinct !DILexicalBlock(scope: !355, file: !300, line: 28, column: 2)
!363 = !DILocation(line: 29, scope: !358, inlinedAt: !361)
!364 = distinct !DISubprogram(name: "array_view", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.array_view", scope: !2, file: !2, line: 190, type: !317, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!365 = !DILocation(line: 191, scope: !364)
!366 = !DILocalVariable(name: "self", arg: 1, scope: !364, file: !2, line: 190, type: !97)
!367 = !DILocation(line: 190, scope: !364)
!368 = !DILocation(line: 192, scope: !364)
!369 = distinct !DISubprogram(name: "add_array", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.add_array", scope: !2, file: !2, line: 201, type: !370, scopeLine: 201, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !97, !121}
!372 = !DILocation(line: 202, scope: !369)
!373 = !DILocalVariable(name: "self", arg: 1, scope: !369, file: !2, line: 201, type: !97)
!374 = !DILocation(line: 201, scope: !369)
!375 = !DILocalVariable(name: "array", arg: 2, scope: !369, file: !2, line: 201, type: !131)
!376 = !DILocation(line: 203, scope: !369)
!377 = !DILocation(line: 199, scope: !369)
!378 = !DILocation(line: 204, scope: !369)
!379 = !DILocalVariable(name: "index", scope: !369, file: !2, line: 205, type: !19, align: 8)
!380 = !DILocation(line: 205, scope: !369)
!381 = !DILocation(line: 422, scope: !369)
!382 = !DILocation(line: 206, scope: !369)
!383 = distinct !DISubprogram(name: "push_front", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.push_front", scope: !2, file: !2, line: 209, type: !220, scopeLine: 209, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!384 = !DILocation(line: 210, scope: !383)
!385 = !DILocalVariable(name: "self", arg: 1, scope: !383, file: !2, line: 209, type: !97)
!386 = !DILocation(line: 209, scope: !383)
!387 = !DILocalVariable(name: "type", arg: 2, scope: !383, file: !2, line: 209, type: !25)
!388 = !DILocation(line: 211, scope: !383)
!389 = !DILocation(line: 215, scope: !383)
!390 = distinct !DISubprogram(name: "insert_at", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.insert_at", scope: !2, file: !2, line: 217, type: !391, scopeLine: 217, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !97, !20, !26}
!393 = !DILocation(line: 218, scope: !390)
!394 = !DILocalVariable(name: "self", arg: 1, scope: !390, file: !2, line: 217, type: !97)
!395 = !DILocation(line: 217, scope: !390)
!396 = !DILocalVariable(name: "index", arg: 2, scope: !390, file: !2, line: 217, type: !19)
!397 = !DILocalVariable(name: "type", arg: 3, scope: !390, file: !2, line: 217, type: !25)
!398 = !DILocation(line: 215, scope: !399)
!399 = distinct !DILexicalBlock(scope: !390, file: !2, line: 218, column: 1)
!400 = !DILocation(line: 219, scope: !390)
!401 = !DILocation(line: 220, scope: !390)
!402 = !DILocation(line: 422, scope: !390)
!403 = !DILocalVariable(name: "i", scope: !404, file: !2, line: 221, type: !405, align: 8)
!404 = distinct !DILexicalBlock(scope: !390, file: !2, line: 221, column: 2)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !176)
!406 = !DILocation(line: 221, scope: !404)
!407 = !DILocation(line: 223, scope: !408)
!408 = distinct !DILexicalBlock(scope: !404, file: !2, line: 222, column: 2)
!409 = !DILocation(line: 225, scope: !390)
!410 = distinct !DISubprogram(name: "set_at", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.set_at", scope: !2, file: !2, line: 231, type: !391, scopeLine: 231, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!411 = !DILocation(line: 232, scope: !410)
!412 = !DILocalVariable(name: "self", arg: 1, scope: !410, file: !2, line: 231, type: !97)
!413 = !DILocation(line: 231, scope: !410)
!414 = !DILocalVariable(name: "index", arg: 2, scope: !410, file: !2, line: 231, type: !19)
!415 = !DILocalVariable(name: "type", arg: 3, scope: !410, file: !2, line: 231, type: !25)
!416 = !DILocation(line: 229, scope: !417)
!417 = distinct !DILexicalBlock(scope: !410, file: !2, line: 232, column: 1)
!418 = !DILocation(line: 233, scope: !410)
!419 = distinct !DISubprogram(name: "remove_last", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.remove_last", scope: !2, file: !2, line: 236, type: !420, scopeLine: 236, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!420 = !DISubroutineType(types: !421)
!421 = !{!175, !11, !97}
!422 = !DILocation(line: 237, scope: !419)
!423 = !DILocalVariable(name: "self", arg: 1, scope: !419, file: !2, line: 236, type: !97)
!424 = !DILocation(line: 236, scope: !419)
!425 = !DILocation(line: 238, scope: !419)
!426 = !DILocation(line: 239, scope: !419)
!427 = !DILocation(line: 422, scope: !419)
!428 = distinct !DISubprogram(name: "remove_first", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.remove_first", scope: !2, file: !2, line: 242, type: !420, scopeLine: 242, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!429 = !DILocation(line: 243, scope: !428)
!430 = !DILocalVariable(name: "self", arg: 1, scope: !428, file: !2, line: 242, type: !97)
!431 = !DILocation(line: 242, scope: !428)
!432 = !DILocation(line: 244, scope: !428)
!433 = !DILocation(line: 245, scope: !428)
!434 = !DILocation(line: 136, scope: !428)
!435 = distinct !DISubprogram(name: "first", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.first", scope: !2, file: !2, line: 248, type: !230, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!436 = !DILocation(line: 249, scope: !435)
!437 = !DILocalVariable(name: "self", arg: 1, scope: !435, file: !2, line: 248, type: !97)
!438 = !DILocation(line: 248, scope: !435)
!439 = !DILocation(line: 250, scope: !435)
!440 = !DILocation(line: 251, scope: !435)
!441 = distinct !DISubprogram(name: "last", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.last", scope: !2, file: !2, line: 254, type: !230, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!442 = !DILocation(line: 255, scope: !441)
!443 = !DILocalVariable(name: "self", arg: 1, scope: !441, file: !2, line: 254, type: !97)
!444 = !DILocation(line: 254, scope: !441)
!445 = !DILocation(line: 256, scope: !441)
!446 = !DILocation(line: 257, scope: !441)
!447 = distinct !DISubprogram(name: "is_empty", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.is_empty", scope: !2, file: !2, line: 260, type: !168, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!448 = !DILocation(line: 261, scope: !447)
!449 = !DILocalVariable(name: "self", arg: 1, scope: !447, file: !2, line: 260, type: !97)
!450 = !DILocation(line: 260, scope: !447)
!451 = !DILocation(line: 262, scope: !447)
!452 = distinct !DISubprogram(name: "byte_size", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.byte_size", scope: !2, file: !2, line: 265, type: !453, scopeLine: 265, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!453 = !DISubroutineType(types: !454)
!454 = !{!19, !97}
!455 = !DILocation(line: 266, scope: !452)
!456 = !DILocalVariable(name: "self", arg: 1, scope: !452, file: !2, line: 265, type: !97)
!457 = !DILocation(line: 265, scope: !452)
!458 = !DILocation(line: 267, scope: !452)
!459 = distinct !DISubprogram(name: "len", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.len", scope: !2, file: !2, line: 270, type: !453, scopeLine: 270, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!460 = !DILocation(line: 271, scope: !459)
!461 = !DILocalVariable(name: "self", arg: 1, scope: !459, file: !2, line: 270, type: !97)
!462 = !DILocation(line: 270, scope: !459)
!463 = !DILocation(line: 272, scope: !459)
!464 = distinct !DISubprogram(name: "get", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.get", scope: !2, file: !2, line: 278, type: !465, scopeLine: 278, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!465 = !DISubroutineType(types: !466)
!466 = !{!25, !97, !20}
!467 = !DILocation(line: 279, scope: !464)
!468 = !DILocalVariable(name: "self", arg: 1, scope: !464, file: !2, line: 278, type: !97)
!469 = !DILocation(line: 278, scope: !464)
!470 = !DILocalVariable(name: "index", arg: 2, scope: !464, file: !2, line: 278, type: !19)
!471 = !DILocation(line: 276, scope: !472)
!472 = distinct !DILexicalBlock(scope: !464, file: !2, line: 279, column: 1)
!473 = !DILocation(line: 280, scope: !464)
!474 = distinct !DISubprogram(name: "free", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.free", scope: !2, file: !2, line: 283, type: !241, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!475 = !DILocation(line: 284, scope: !474)
!476 = !DILocalVariable(name: "self", arg: 1, scope: !474, file: !2, line: 283, type: !97)
!477 = !DILocation(line: 283, scope: !474)
!478 = !DILocation(line: 285, scope: !474)
!479 = !DILocation(line: 432, scope: !480, inlinedAt: !482)
!480 = distinct !DILexicalBlock(scope: !481, file: !2, line: 433, column: 1)
!481 = distinct !DISubprogram(name: "pre_free", linkageName: "pre_free", scope: !2, file: !2, line: 432, scopeLine: 432, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91)
!482 = !DILocation(line: 287, scope: !474)
!483 = !DILocation(line: 434, scope: !481, inlinedAt: !482)
!484 = !DILocation(line: 435, scope: !481, inlinedAt: !482)
!485 = !DILocation(line: 292, scope: !474)
!486 = !DILocation(line: 119, scope: !487, inlinedAt: !485)
!487 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !306, file: !306, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91)
!488 = !DILocation(line: 123, scope: !487, inlinedAt: !485)
!489 = !DILocation(line: 294, scope: !474)
!490 = !DILocation(line: 295, scope: !474)
!491 = !DILocation(line: 296, scope: !474)
!492 = distinct !DISubprogram(name: "swap", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.swap", scope: !2, file: !2, line: 302, type: !493, scopeLine: 302, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !97, !20, !20}
!495 = !DILocation(line: 303, scope: !492)
!496 = !DILocalVariable(name: "self", arg: 1, scope: !492, file: !2, line: 302, type: !97)
!497 = !DILocation(line: 302, scope: !492)
!498 = !DILocalVariable(name: "i", arg: 2, scope: !492, file: !2, line: 302, type: !19)
!499 = !DILocalVariable(name: "j", arg: 3, scope: !492, file: !2, line: 302, type: !19)
!500 = !DILocation(line: 300, scope: !501)
!501 = distinct !DILexicalBlock(scope: !492, file: !2, line: 303, column: 1)
!502 = !DILocalVariable(name: "temp", scope: !503, file: !2, line: 79, type: !26, align: 8)
!503 = distinct !DISubprogram(name: "@swap", linkageName: "@swap", scope: !359, file: !359, line: 77, scopeLine: 77, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91, retainedNodes: !98)
!504 = !DILocation(line: 79, scope: !503, inlinedAt: !505)
!505 = !DILocation(line: 304, scope: !492)
!506 = !DILocation(line: 304, scope: !503, inlinedAt: !505)
!507 = distinct !DISubprogram(name: "remove_if", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.remove_if", scope: !2, file: !2, line: 311, type: !508, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!508 = !DISubroutineType(types: !509)
!509 = !{!19, !97, !510}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ElementPredicate", baseType: !511, size: 64, align: 64, dwarfAddressSpace: 0)
!511 = !DISubroutineType(types: !512)
!512 = !{!3, !124}
!513 = !DILocation(line: 312, scope: !507)
!514 = !DILocalVariable(name: "self", arg: 1, scope: !507, file: !2, line: 311, type: !97)
!515 = !DILocation(line: 311, scope: !507)
!516 = !DILocalVariable(name: "filter", arg: 2, scope: !507, file: !2, line: 311, type: !517)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementPredicate", scope: !2, file: !2, line: 7, baseType: !510, align: 8)
!518 = !DILocalVariable(name: "size", scope: !519, file: !2, line: 91, type: !19, align: 8)
!519 = distinct !DISubprogram(name: "list_remove_if", linkageName: "list_remove_if", scope: !300, file: !300, line: 89, scopeLine: 89, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91, retainedNodes: !98)
!520 = !DILocation(line: 91, scope: !519, inlinedAt: !521)
!521 = !DILocation(line: 313, scope: !507)
!522 = !DILocalVariable(name: "i", scope: !523, file: !2, line: 92, type: !19, align: 8)
!523 = distinct !DILexicalBlock(scope: !519, file: !300, line: 92, column: 2)
!524 = !DILocation(line: 92, scope: !523, inlinedAt: !521)
!525 = !DILocalVariable(name: "k", scope: !523, file: !2, line: 92, type: !19, align: 8)
!526 = !DILocation(line: 98, scope: !527, inlinedAt: !521)
!527 = distinct !DILexicalBlock(scope: !523, file: !300, line: 93, column: 2)
!528 = !DILocation(line: 98, scope: !529, inlinedAt: !521)
!529 = distinct !DILexicalBlock(scope: !527, file: !300, line: 98, column: 4)
!530 = !DILocalVariable(name: "n", scope: !527, file: !2, line: 101, type: !19, align: 8)
!531 = !DILocation(line: 101, scope: !527, inlinedAt: !521)
!532 = !DILocation(line: 102, scope: !527, inlinedAt: !521)
!533 = !DILocation(line: 103, scope: !527, inlinedAt: !521)
!534 = !DILocation(line: 108, scope: !527, inlinedAt: !521)
!535 = !DILocation(line: 108, scope: !536, inlinedAt: !521)
!536 = distinct !DILexicalBlock(scope: !527, file: !300, line: 108, column: 4)
!537 = !DILocation(line: 111, scope: !519, inlinedAt: !521)
!538 = distinct !DISubprogram(name: "retain_if", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.retain_if", scope: !2, file: !2, line: 320, type: !508, scopeLine: 320, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!539 = !DILocation(line: 321, scope: !538)
!540 = !DILocalVariable(name: "self", arg: 1, scope: !538, file: !2, line: 320, type: !97)
!541 = !DILocation(line: 320, scope: !538)
!542 = !DILocalVariable(name: "selection", arg: 2, scope: !538, file: !2, line: 320, type: !517)
!543 = !DILocalVariable(name: "size", scope: !544, file: !2, line: 91, type: !19, align: 8)
!544 = distinct !DISubprogram(name: "list_remove_if", linkageName: "list_remove_if", scope: !300, file: !300, line: 89, scopeLine: 89, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91, retainedNodes: !98)
!545 = !DILocation(line: 91, scope: !544, inlinedAt: !546)
!546 = !DILocation(line: 322, scope: !538)
!547 = !DILocalVariable(name: "i", scope: !548, file: !2, line: 92, type: !19, align: 8)
!548 = distinct !DILexicalBlock(scope: !544, file: !300, line: 92, column: 2)
!549 = !DILocation(line: 92, scope: !548, inlinedAt: !546)
!550 = !DILocalVariable(name: "k", scope: !548, file: !2, line: 92, type: !19, align: 8)
!551 = !DILocation(line: 96, scope: !552, inlinedAt: !546)
!552 = distinct !DILexicalBlock(scope: !548, file: !300, line: 93, column: 2)
!553 = !DILocation(line: 96, scope: !554, inlinedAt: !546)
!554 = distinct !DILexicalBlock(scope: !552, file: !300, line: 96, column: 4)
!555 = !DILocalVariable(name: "n", scope: !552, file: !2, line: 101, type: !19, align: 8)
!556 = !DILocation(line: 101, scope: !552, inlinedAt: !546)
!557 = !DILocation(line: 102, scope: !552, inlinedAt: !546)
!558 = !DILocation(line: 103, scope: !552, inlinedAt: !546)
!559 = !DILocation(line: 106, scope: !552, inlinedAt: !546)
!560 = !DILocation(line: 106, scope: !561, inlinedAt: !546)
!561 = distinct !DILexicalBlock(scope: !552, file: !300, line: 106, column: 4)
!562 = !DILocation(line: 111, scope: !544, inlinedAt: !546)
!563 = distinct !DISubprogram(name: "remove_using_test", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.remove_using_test", scope: !2, file: !2, line: 325, type: !564, scopeLine: 325, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!564 = !DISubroutineType(types: !565)
!565 = !{!19, !97, !566, !569}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ElementTest", baseType: !567, size: 64, align: 64, dwarfAddressSpace: 0)
!567 = !DISubroutineType(types: !568)
!568 = !{!3, !124, !569}
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !570, identifier: "any")
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !569, baseType: !11, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !569, baseType: !13, size: 64, align: 64, offset: 64)
!573 = !DILocation(line: 326, scope: !563)
!574 = !DILocalVariable(name: "self", arg: 1, scope: !563, file: !2, line: 325, type: !97)
!575 = !DILocation(line: 325, scope: !563)
!576 = !DILocalVariable(name: "filter", arg: 2, scope: !563, file: !2, line: 325, type: !577)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementTest", scope: !2, file: !2, line: 8, baseType: !566, align: 8)
!578 = !DILocalVariable(name: "context", arg: 3, scope: !563, file: !2, line: 325, type: !569)
!579 = !DILocalVariable(name: "old_size", scope: !563, file: !2, line: 327, type: !19, align: 8)
!580 = !DILocation(line: 327, scope: !563)
!581 = !DILocalVariable(name: "size", scope: !582, file: !2, line: 35, type: !19, align: 8)
!582 = distinct !DISubprogram(name: "list_remove_using_test", linkageName: "list_remove_using_test", scope: !300, file: !300, line: 33, scopeLine: 33, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91, retainedNodes: !98)
!583 = !DILocation(line: 35, scope: !582, inlinedAt: !584)
!584 = !DILocation(line: 332, scope: !563)
!585 = !DILocalVariable(name: "i", scope: !586, file: !2, line: 36, type: !19, align: 8)
!586 = distinct !DILexicalBlock(scope: !582, file: !300, line: 36, column: 2)
!587 = !DILocation(line: 36, scope: !586, inlinedAt: !584)
!588 = !DILocalVariable(name: "k", scope: !586, file: !2, line: 36, type: !19, align: 8)
!589 = !DILocation(line: 42, scope: !590, inlinedAt: !584)
!590 = distinct !DILexicalBlock(scope: !586, file: !300, line: 37, column: 2)
!591 = !DILocation(line: 42, scope: !592, inlinedAt: !584)
!592 = distinct !DILexicalBlock(scope: !590, file: !300, line: 42, column: 4)
!593 = !DILocalVariable(name: "n", scope: !590, file: !2, line: 45, type: !19, align: 8)
!594 = !DILocation(line: 45, scope: !590, inlinedAt: !584)
!595 = !DILocation(line: 46, scope: !590, inlinedAt: !584)
!596 = !DILocation(line: 47, scope: !590, inlinedAt: !584)
!597 = !DILocation(line: 52, scope: !590, inlinedAt: !584)
!598 = !DILocation(line: 52, scope: !599, inlinedAt: !584)
!599 = distinct !DILexicalBlock(scope: !590, file: !300, line: 52, column: 4)
!600 = !DILocation(line: 55, scope: !582, inlinedAt: !584)
!601 = !DILocation(line: 330, scope: !602)
!602 = distinct !DILexicalBlock(scope: !563, file: !2, line: 329, column: 2)
!603 = distinct !DISubprogram(name: "retain_using_test", linkageName: "std_collections_list$p$cforms.ListViewItem$.List.retain_using_test", scope: !2, file: !2, line: 337, type: !564, scopeLine: 337, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !98)
!604 = !DILocation(line: 338, scope: !603)
!605 = !DILocalVariable(name: "self", arg: 1, scope: !603, file: !2, line: 337, type: !97)
!606 = !DILocation(line: 337, scope: !603)
!607 = !DILocalVariable(name: "filter", arg: 2, scope: !603, file: !2, line: 337, type: !577)
!608 = !DILocalVariable(name: "context", arg: 3, scope: !603, file: !2, line: 337, type: !569)
!609 = !DILocalVariable(name: "old_size", scope: !603, file: !2, line: 339, type: !19, align: 8)
!610 = !DILocation(line: 339, scope: !603)
!611 = !DILocalVariable(name: "size", scope: !612, file: !2, line: 35, type: !19, align: 8)
!612 = distinct !DISubprogram(name: "list_remove_using_test", linkageName: "list_remove_using_test", scope: !300, file: !300, line: 33, scopeLine: 33, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91, retainedNodes: !98)
!613 = !DILocation(line: 35, scope: !612, inlinedAt: !614)
!614 = !DILocation(line: 343, scope: !603)
!615 = !DILocalVariable(name: "i", scope: !616, file: !2, line: 36, type: !19, align: 8)
!616 = distinct !DILexicalBlock(scope: !612, file: !300, line: 36, column: 2)
!617 = !DILocation(line: 36, scope: !616, inlinedAt: !614)
!618 = !DILocalVariable(name: "k", scope: !616, file: !2, line: 36, type: !19, align: 8)
!619 = !DILocation(line: 40, scope: !620, inlinedAt: !614)
