; ModuleID = 'std_collections_list$p$cforms.TreeNode$'
source_filename = "std_collections_list$p$cforms.TreeNode$"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }
%"char[]" = type { ptr, i64 }
%"TreeNode*[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$"std_collections_list$p$cforms.TreeNode$.List.init" = comdat any

$"std_collections_list$p$cforms.TreeNode$.List.tinit" = comdat any

$"std_collections_list$p$cforms.TreeNode$.List.init_with_array" = comdat any

$"std_collections_list$p$cforms.TreeNode$.List.tinit_with_array" = comdat any

$"std_collections_list$p$cforms.TreeNode$.List.init_wrapping_array" = comdat any

$"std_collections_list$p$cforms.TreeNode$.List.is_initialized" = comdat any

$"std_collections_list$p$cforms.TreeNode$.List.to_format" = comdat any

$"std_collections_list$p$cforms.TreeNode$.List.push" = comdat any

$"std_collections_list$p$cforms.TreeNode$.List.pop" = comdat any

$"std_collections_list$p$cforms.TreeNode$.List.clear" = comdat any

$"std_collections_list$p$cforms.TreeNode$.List.pop_first" = comdat any

$"std_collections_list$p$cforms.TreeNode$.List.remove_at" = comdat any

$"std_collections_list$p$cforms.TreeNode$.List.add_all" = comdat any

$"std_collections_list$p$cforms.TreeNode$.List.to_aligned_array" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ELEMENT_IS_EQUATABLE", linkageName: "std_collections_list$p$cforms.TreeNode$.ELEMENT_IS_EQUATABLE", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 1)
!2 = !DIFile(filename: "list.c3", directory: "C:/Compilers/C3/lib/std/collections")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "ELEMENT_IS_POINTER", linkageName: "std_collections_list$p$cforms.TreeNode$.ELEMENT_IS_POINTER", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 1)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "LIST_HEAP_ALLOCATOR", linkageName: "std_collections_list$p$cforms.TreeNode$.LIST_HEAP_ALLOCATOR", scope: !2, file: !2, line: 12, type: !8, isLocal: false, isDefinition: true, align: 8)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !9, identifier: "Allocator")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !8, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "ONHEAP", linkageName: "std_collections_list$p$cforms.TreeNode$.ONHEAP", scope: !2, file: !2, line: 14, type: !16, isLocal: false, isDefinition: true, align: 8)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !17, identifier: "std_collections_list$p$cforms.TreeNode$.List")
!17 = !{!18, !21, !22, !23}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !16, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !20)
!20 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !16, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !16, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !16, file: !2, line: 23, baseType: !24, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 66, baseType: !26, align: 8)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TreeNode*", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "TreeNode", scope: !2, file: !2, line: 92, size: 1152, align: 64, elements: !28, identifier: "cforms.TreeNode")
!28 = !{!29, !32, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !27, file: !2, line: 94, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "Htreeitem", scope: !2, file: !2, line: 21, baseType: !31, align: 8)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "Handle", scope: !2, file: !2, line: 6, baseType: !11, align: 8)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_treePtr", scope: !27, file: !2, line: 95, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TreeView*", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "TreeView", scope: !2, file: !2, line: 75, size: 4160, align: 64, elements: !35, identifier: "cforms.TreeView")
!35 = !{!36, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !701, !702}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !34, file: !2, line: 77, baseType: !37, size: 2496, align: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Control", scope: !34, file: !2, line: 55, size: 2496, align: 64, elements: !38, identifier: "cforms.Control")
!38 = !{!39, !59, !63, !70, !72, !79, !80, !82, !83, !84, !85, !88, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !466, !467, !468, !469, !470, !471, !472, !473, !474, !496, !497, !498, !499, !500, !501, !688, !689}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !37, file: !2, line: 57, baseType: !40, size: 8, align: 8)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ControlType", scope: !37, file: !2, line: 25, baseType: !41, size: 8, align: 8, elements: !42)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!43 = !DIEnumerator(name: "NONE", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "BUTTON", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "CALENDAR", value: 2, isUnsigned: true)
!46 = !DIEnumerator(name: "CHECK_BOX", value: 3, isUnsigned: true)
!47 = !DIEnumerator(name: "COMBO_BOX", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "DATE_TIME_PICKER", value: 5, isUnsigned: true)
!49 = !DIEnumerator(name: "GROUP_BOX", value: 6, isUnsigned: true)
!50 = !DIEnumerator(name: "LABEL", value: 7, isUnsigned: true)
!51 = !DIEnumerator(name: "LIST_BOX", value: 8, isUnsigned: true)
!52 = !DIEnumerator(name: "LIST_VIEW", value: 9, isUnsigned: true)
!53 = !DIEnumerator(name: "NUM_PICKER", value: 10, isUnsigned: true)
!54 = !DIEnumerator(name: "PROGRESS_BAR", value: 11, isUnsigned: true)
!55 = !DIEnumerator(name: "RADIO_BUTTON", value: 12, isUnsigned: true)
!56 = !DIEnumerator(name: "TEXT_BOX", value: 13, isUnsigned: true)
!57 = !DIEnumerator(name: "TRACK_BAR", value: 14, isUnsigned: true)
!58 = !DIEnumerator(name: "TREE_VIEW", value: 15, isUnsigned: true)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !37, file: !2, line: 58, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !61, align: 8)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 1)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !37, file: !2, line: 59, baseType: !64, size: 128, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !66, identifier: "char[]")
!66 = !{!67, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !65, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !41, size: 64, align: 64, dwarfAddressSpace: 0)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !65, baseType: !19, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !37, file: !2, line: 60, baseType: !71, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hwnd", scope: !2, file: !2, line: 19, baseType: !31, align: 8)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", scope: !37, file: !2, line: 61, baseType: !73, size: 64, align: 32, offset: 320)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", scope: !37, file: !2, line: 14, size: 64, align: 32, elements: !74, identifier: "cforms.Color")
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !73, file: !2, line: 16, baseType: !76, size: 32, align: 32)
!76 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !73, file: !2, line: 17, baseType: !78, size: 32, align: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colorref", scope: !2, file: !2, line: 36, baseType: !76, align: 4)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", scope: !37, file: !2, line: 62, baseType: !73, size: 64, align: 32, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !37, file: !2, line: 63, baseType: !81, size: 32, align: 32, offset: 448)
!81 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !37, file: !2, line: 64, baseType: !81, size: 32, align: 32, offset: 480)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "xpos", scope: !37, file: !2, line: 65, baseType: !81, size: 32, align: 32, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ypos", scope: !37, file: !2, line: 66, baseType: !81, size: 32, align: 32, offset: 544)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ctlID", scope: !37, file: !2, line: 67, baseType: !86, size: 64, align: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "iptr", baseType: !87)
!87 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "contextMenu", scope: !37, file: !2, line: 68, baseType: !89, size: 64, align: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ContextMenu*", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "ContextMenu", scope: !2, file: !2, line: 23, size: 1600, align: 64, elements: !91, identifier: "cforms.ContextMenu")
!91 = !{!92, !362, !363, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !90, file: !2, line: 25, baseType: !93, size: 768, align: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuBase", scope: !90, file: !2, line: 56, size: 768, align: 64, elements: !94, identifier: "cforms.MenuBase")
!94 = !{!95, !97, !120, !121}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !93, file: !2, line: 58, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hmenu", scope: !2, file: !2, line: 16, baseType: !31, align: 8)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !93, file: !2, line: 59, baseType: !98, size: 320, align: 64, offset: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "Font", scope: !93, file: !2, line: 5, size: 320, align: 64, elements: !99, identifier: "cforms.Font")
!99 = !{!100, !101, !102, !114, !115, !116, !117, !118}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !2, line: 7, baseType: !64, size: 128, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !98, file: !2, line: 8, baseType: !81, size: 32, align: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !98, file: !2, line: 9, baseType: !103, size: 32, align: 32, offset: 160)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FontWeight", scope: !98, file: !2, line: 45, baseType: !81, size: 32, align: 32, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113}
!105 = !DIEnumerator(name: "THIN", value: 0)
!106 = !DIEnumerator(name: "EXTRA_LIGHT", value: 1)
!107 = !DIEnumerator(name: "LIGHT", value: 2)
!108 = !DIEnumerator(name: "NORMAL", value: 3)
!109 = !DIEnumerator(name: "MEDIUM", value: 4)
!110 = !DIEnumerator(name: "SEMI_BOLD", value: 5)
!111 = !DIEnumerator(name: "BOLD", value: 6)
!112 = !DIEnumerator(name: "EXTRA_BOLD", value: 7)
!113 = !DIEnumerator(name: "THICK", value: 8)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "italics", scope: !98, file: !2, line: 10, baseType: !3, size: 8, align: 8, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "underline", scope: !98, file: !2, line: 11, baseType: !3, size: 8, align: 8, offset: 200)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "strikeout", scope: !98, file: !2, line: 12, baseType: !3, size: 8, align: 8, offset: 208)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_isCreated", scope: !98, file: !2, line: 13, baseType: !3, size: 8, align: 8, offset: 216)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !98, file: !2, line: 14, baseType: !119, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hfont", scope: !2, file: !2, line: 12, baseType: !31, align: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_menuCount", scope: !93, file: !2, line: 60, baseType: !76, size: 32, align: 32, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_menuList", scope: !93, file: !2, line: 62, baseType: !122, size: 320, align: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "MenuItemList", scope: !2, file: !2, line: 47, baseType: !123, align: 8)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !124, identifier: "std_collections_list$p$cforms.MenuItem$.List")
!124 = !{!125, !126, !127, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !123, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !123, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !123, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !123, file: !2, line: 23, baseType: !129, size: 64, align: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !130, size: 64, align: 64, dwarfAddressSpace: 0)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 47, baseType: !131, align: 8)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MenuItem*", baseType: !132, size: 64, align: 64, dwarfAddressSpace: 0)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuItem", scope: !2, file: !2, line: 112, size: 1920, align: 64, elements: !133, identifier: "cforms.MenuItem")
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !153, !160, !161, !162, !354, !359, !360, !361}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !132, file: !2, line: 114, baseType: !93, size: 768, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "parentHandle", scope: !132, file: !2, line: 115, baseType: !96, size: 64, align: 64, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_formHwnd", scope: !132, file: !2, line: 116, baseType: !71, size: 64, align: 64, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "bgColor", scope: !132, file: !2, line: 117, baseType: !73, size: 64, align: 32, offset: 896)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "fgColor", scope: !132, file: !2, line: 118, baseType: !73, size: 64, align: 32, offset: 960)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "idNum", scope: !132, file: !2, line: 119, baseType: !76, size: 32, align: 32, offset: 1024)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_index", scope: !132, file: !2, line: 121, baseType: !76, size: 32, align: 32, offset: 1056)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_evtFlag", scope: !132, file: !2, line: 122, baseType: !76, size: 32, align: 32, offset: 1088)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "iLevel", scope: !132, file: !2, line: 123, baseType: !81, size: 32, align: 32, offset: 1120)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "hasCheckMark", scope: !132, file: !2, line: 124, baseType: !3, size: 8, align: 8, offset: 1152)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_isCreated", scope: !132, file: !2, line: 125, baseType: !3, size: 8, align: 8, offset: 1160)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_isEnabled", scope: !132, file: !2, line: 126, baseType: !3, size: 8, align: 8, offset: 1168)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_popup", scope: !132, file: !2, line: 127, baseType: !3, size: 8, align: 8, offset: 1176)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_formMenu", scope: !132, file: !2, line: 128, baseType: !3, size: 8, align: 8, offset: 1184)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !132, file: !2, line: 129, baseType: !64, size: 128, align: 64, offset: 1216)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_wideText", scope: !132, file: !2, line: 130, baseType: !150, size: 64, align: 64, offset: 1344)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Char16*", baseType: !151, size: 64, align: 64, dwarfAddressSpace: 0)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char16", scope: !2, file: !2, line: 33, baseType: !152, align: 2)
!152 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !132, file: !2, line: 131, baseType: !154, size: 8, align: 8, offset: 1408)
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MenuType", scope: !132, file: !2, line: 49, baseType: !41, size: 8, align: 8, elements: !155)
!155 = !{!156, !157, !158, !159}
!156 = !DIEnumerator(name: "BASE_MENU", value: 0, isUnsigned: true)
!157 = !DIEnumerator(name: "MENU_ITEM", value: 1, isUnsigned: true)
!158 = !DIEnumerator(name: "POPUP", value: 2, isUnsigned: true)
!159 = !DIEnumerator(name: "SEPRATOR", value: 3, isUnsigned: true)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_parent", scope: !132, file: !2, line: 132, baseType: !131, size: 64, align: 64, offset: 1472)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "uFlag", scope: !132, file: !2, line: 133, baseType: !76, size: 32, align: 32, offset: 1536)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_mbar", scope: !132, file: !2, line: 134, baseType: !163, size: 64, align: 64, offset: 1600)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MenuBar*", baseType: !164, size: 64, align: 64, dwarfAddressSpace: 0)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuBar", scope: !2, file: !2, line: 98, size: 1216, align: 64, elements: !165, identifier: "cforms.MenuBar")
!165 = !{!166, !167, !168, !349, !350, !351, !352, !353}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !164, file: !2, line: 100, baseType: !93, size: 768, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_formHwnd", scope: !164, file: !2, line: 101, baseType: !71, size: 64, align: 64, offset: 768)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_pForm", scope: !164, file: !2, line: 102, baseType: !169, size: 64, align: 64, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Form*", baseType: !170, size: 64, align: 64, dwarfAddressSpace: 0)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", scope: !2, file: !2, line: 69, size: 5632, align: 64, elements: !171, identifier: "cforms.Form")
!171 = !{!172, !173, !186, !197, !203, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !234, !248, !259, !290, !292, !293, !294, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !343, !344}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !170, file: !2, line: 71, baseType: !37, size: 2496, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "formPos", scope: !170, file: !2, line: 72, baseType: !174, size: 32, align: 32, offset: 2496)
!174 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormPos", scope: !170, file: !2, line: 58, baseType: !81, size: 32, align: 32, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184, !185}
!176 = !DIEnumerator(name: "CENTER", value: 0)
!177 = !DIEnumerator(name: "TOP_LEFT", value: 1)
!178 = !DIEnumerator(name: "TOP_MID", value: 2)
!179 = !DIEnumerator(name: "TOP_RIGHT", value: 3)
!180 = !DIEnumerator(name: "MID_LEFT", value: 4)
!181 = !DIEnumerator(name: "MID_RIGHT", value: 5)
!182 = !DIEnumerator(name: "BOTTOM_LEFT", value: 6)
!183 = !DIEnumerator(name: "BOTTOM_MID", value: 7)
!184 = !DIEnumerator(name: "BOTTOM_RIGHT", value: 8)
!185 = !DIEnumerator(name: "MANUAL", value: 9)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "formStyle", scope: !170, file: !2, line: 73, baseType: !187, size: 32, align: 32, offset: 2528)
!187 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormStyle", scope: !170, file: !2, line: 72, baseType: !81, size: 32, align: 32, elements: !188)
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196}
!189 = !DIEnumerator(name: "NONE", value: 0)
!190 = !DIEnumerator(name: "FIXED_SINGLE", value: 1)
!191 = !DIEnumerator(name: "FIXED_3D", value: 2)
!192 = !DIEnumerator(name: "FIXED_DIALOG", value: 3)
!193 = !DIEnumerator(name: "NORMAL_WINDOW", value: 4)
!194 = !DIEnumerator(name: "FIXED_TOOL", value: 5)
!195 = !DIEnumerator(name: "SIZABLE_TOOL", value: 6)
!196 = !DIEnumerator(name: "HIDDEN", value: 7)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "formState", scope: !170, file: !2, line: 74, baseType: !198, size: 32, align: 32, offset: 2560)
!198 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormState", scope: !170, file: !2, line: 84, baseType: !81, size: 32, align: 32, elements: !199)
!199 = !{!200, !201, !202}
!200 = !DIEnumerator(name: "NORMAL", value: 0)
!201 = !DIEnumerator(name: "MAXIMIZED", value: 1)
!202 = !DIEnumerator(name: "MINIMIZED", value: 2)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_fDrawMode", scope: !170, file: !2, line: 75, baseType: !204, size: 32, align: 32, offset: 2592)
!204 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormDrawMode", scope: !170, file: !2, line: 90, baseType: !81, size: 32, align: 32, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIEnumerator(name: "DEFAULT", value: 0)
!207 = !DIEnumerator(name: "FLAT_COLOR", value: 1)
!208 = !DIEnumerator(name: "GRADIENT", value: 2)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "topMost", scope: !170, file: !2, line: 76, baseType: !3, size: 8, align: 8, offset: 2624)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "createChilds", scope: !170, file: !2, line: 77, baseType: !3, size: 8, align: 8, offset: 2632)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "maximizeBox", scope: !170, file: !2, line: 78, baseType: !3, size: 8, align: 8, offset: 2640)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "minimizeBox", scope: !170, file: !2, line: 79, baseType: !3, size: 8, align: 8, offset: 2648)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_isLoaded", scope: !170, file: !2, line: 80, baseType: !3, size: 8, align: 8, offset: 2656)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_isMainWindow", scope: !170, file: !2, line: 81, baseType: !3, size: 8, align: 8, offset: 2664)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_isMouseTracking", scope: !170, file: !2, line: 82, baseType: !3, size: 8, align: 8, offset: 2672)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_isSizing", scope: !170, file: !2, line: 83, baseType: !3, size: 8, align: 8, offset: 2680)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_menuMapInited", scope: !170, file: !2, line: 84, baseType: !3, size: 8, align: 8, offset: 2688)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_menubarCreated", scope: !170, file: !2, line: 85, baseType: !3, size: 8, align: 8, offset: 2696)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_formID", scope: !170, file: !2, line: 86, baseType: !81, size: 32, align: 32, offset: 2720)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_comboList", scope: !170, file: !2, line: 87, baseType: !221, size: 320, align: 64, offset: 2752)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "CmbList", scope: !2, file: !2, line: 65, baseType: !222, align: 8)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !223, identifier: "std_collections_list$cforms.ComboInfo$.List")
!223 = !{!224, !225, !226, !227}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !222, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !222, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !222, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !222, file: !2, line: 23, baseType: !228, size: 64, align: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !229, size: 64, align: 64, dwarfAddressSpace: 0)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 65, baseType: !230, align: 8)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComboInfo", scope: !2, file: !2, line: 61, size: 128, align: 64, elements: !231, identifier: "cforms.ComboInfo")
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "listHwnd", scope: !230, file: !2, line: 61, baseType: !71, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "cmbHwnd", scope: !230, file: !2, line: 61, baseType: !71, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_menuItemList", scope: !170, file: !2, line: 88, baseType: !235, size: 320, align: 64, offset: 3072)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "MenuItems", scope: !2, file: !2, line: 66, baseType: !236, align: 8)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !237, identifier: "std_collections_list$cforms.MenuInfo$.List")
!237 = !{!238, !239, !240, !241}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !236, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !236, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !236, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !236, file: !2, line: 23, baseType: !242, size: 64, align: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !243, size: 64, align: 64, dwarfAddressSpace: 0)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 66, baseType: !244, align: 8)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuInfo", scope: !2, file: !2, line: 62, size: 128, align: 64, elements: !245, identifier: "cforms.MenuInfo")
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "menuID", scope: !244, file: !2, line: 62, baseType: !76, size: 32, align: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pMenuItem", scope: !244, file: !2, line: 62, baseType: !131, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "controls", scope: !170, file: !2, line: 89, baseType: !249, size: 320, align: 64, offset: 3392)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "ControlList", scope: !2, file: !2, line: 56, baseType: !250, align: 8)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !251, identifier: "std_collections_list$p$cforms.Control$.List")
!251 = !{!252, !253, !254, !255}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !250, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !250, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !250, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !250, file: !2, line: 23, baseType: !256, size: 64, align: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !257, size: 64, align: 64, dwarfAddressSpace: 0)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 56, baseType: !258, align: 8)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Control*", baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_timerList", scope: !170, file: !2, line: 90, baseType: !260, size: 320, align: 64, offset: 3712)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerList", scope: !2, file: !2, line: 64, baseType: !261, align: 8)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !262, identifier: "std_collections_list$cforms.TimerInfo$.List")
!262 = !{!263, !264, !265, !266}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !261, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !261, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !261, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !261, file: !2, line: 23, baseType: !267, size: 64, align: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !268, size: 64, align: 64, dwarfAddressSpace: 0)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 64, baseType: !269, align: 8)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "TimerInfo", scope: !2, file: !2, line: 60, size: 128, align: 64, elements: !270, identifier: "cforms.TimerInfo")
!270 = !{!271, !273}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "timerID", scope: !269, file: !2, line: 60, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uintptr", scope: !2, file: !2, line: 31, baseType: !20, align: 8)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pTimer", scope: !269, file: !2, line: 60, baseType: !274, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Timer*", baseType: !275, size: 64, align: 64, dwarfAddressSpace: 0)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timer", scope: !2, file: !2, line: 20, size: 320, align: 64, elements: !276, identifier: "cforms.Timer")
!276 = !{!277, !278, !287, !288, !289}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !275, file: !2, line: 22, baseType: !76, size: 32, align: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "onTick", scope: !275, file: !2, line: 23, baseType: !279, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "EventHandler", scope: !2, file: !2, line: 4, baseType: !280, align: 8)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "EventHandler", baseType: !281, size: 64, align: 64, dwarfAddressSpace: 0)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !258, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "EventArgs*", baseType: !284, size: 64, align: 64, dwarfAddressSpace: 0)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "EventArgs", scope: !2, file: !2, line: 23, size: 8, align: 8, elements: !285, identifier: "cforms.EventArgs")
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "handled", scope: !284, file: !2, line: 25, baseType: !3, size: 8, align: 8)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_idNum", scope: !275, file: !2, line: 24, baseType: !272, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_parentHwnd", scope: !275, file: !2, line: 25, baseType: !71, size: 64, align: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_isEnabled", scope: !275, file: !2, line: 26, baseType: !3, size: 8, align: 8, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "hinst", scope: !170, file: !2, line: 91, baseType: !291, size: 64, align: 64, offset: 4032)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hinstance", scope: !2, file: !2, line: 15, baseType: !31, align: 8)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "menubar", scope: !170, file: !2, line: 92, baseType: !163, size: 64, align: 64, offset: 4096)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_menuFont", scope: !170, file: !2, line: 93, baseType: !98, size: 320, align: 64, offset: 4160)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayBrush", scope: !170, file: !2, line: 94, baseType: !295, size: 64, align: 64, offset: 4480)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hbrush", scope: !2, file: !2, line: 9, baseType: !31, align: 8)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_menuDefBgBrush", scope: !170, file: !2, line: 95, baseType: !295, size: 64, align: 64, offset: 4544)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_menuHotBgBrush", scope: !170, file: !2, line: 96, baseType: !295, size: 64, align: 64, offset: 4608)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_menuFrameBrush", scope: !170, file: !2, line: 97, baseType: !295, size: 64, align: 64, offset: 4672)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayCref", scope: !170, file: !2, line: 98, baseType: !78, size: 32, align: 32, offset: 4736)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "onLoad", scope: !170, file: !2, line: 101, baseType: !279, size: 64, align: 64, offset: 4800)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "onActivate", scope: !170, file: !2, line: 102, baseType: !279, size: 64, align: 64, offset: 4864)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "onDeActivate", scope: !170, file: !2, line: 103, baseType: !279, size: 64, align: 64, offset: 4928)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "onMoving", scope: !170, file: !2, line: 104, baseType: !279, size: 64, align: 64, offset: 4992)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "onMoved", scope: !170, file: !2, line: 105, baseType: !279, size: 64, align: 64, offset: 5056)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "onMinimized", scope: !170, file: !2, line: 106, baseType: !279, size: 64, align: 64, offset: 5120)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "onMaximized", scope: !170, file: !2, line: 107, baseType: !279, size: 64, align: 64, offset: 5184)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "onRestored", scope: !170, file: !2, line: 108, baseType: !279, size: 64, align: 64, offset: 5248)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "onClosing", scope: !170, file: !2, line: 109, baseType: !279, size: 64, align: 64, offset: 5312)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "onClosed", scope: !170, file: !2, line: 110, baseType: !279, size: 64, align: 64, offset: 5376)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "onSizing", scope: !170, file: !2, line: 113, baseType: !311, size: 64, align: 64, offset: 5440)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "SizeEventHandler", scope: !2, file: !2, line: 6, baseType: !312, align: 8)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SizeEventHandler", baseType: !313, size: 64, align: 64, dwarfAddressSpace: 0)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !258, !315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SizeEventArgs*", baseType: !316, size: 64, align: 64, dwarfAddressSpace: 0)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "SizeEventArgs", scope: !2, file: !2, line: 39, size: 256, align: 32, elements: !317, identifier: "cforms.SizeEventArgs")
!317 = !{!318, !319, !327, !338}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "eventArgs", scope: !316, file: !2, line: 41, baseType: !284, size: 8, align: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "formRect", scope: !316, file: !2, line: 42, baseType: !320, size: 128, align: 32, offset: 32)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rect", scope: !316, file: !2, line: 62, size: 128, align: 32, elements: !321, identifier: "cforms.Rect")
!321 = !{!322, !324, !325, !326}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !320, file: !2, line: 63, baseType: !323, size: 32, align: 32)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "Long", scope: !2, file: !2, line: 24, baseType: !81, align: 4)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !320, file: !2, line: 64, baseType: !323, size: 32, align: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !320, file: !2, line: 65, baseType: !323, size: 32, align: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !320, file: !2, line: 66, baseType: !323, size: 32, align: 32, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sizedOn", scope: !316, file: !2, line: 43, baseType: !328, size: 32, align: 32, offset: 160)
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SizedPosition", scope: !316, file: !2, line: 123, baseType: !81, size: 32, align: 32, elements: !329)
!329 = !{!189, !330, !331, !332, !333, !334, !335, !336, !337}
!330 = !DIEnumerator(name: "LEFTEDGE", value: 1)
!331 = !DIEnumerator(name: "RIGHTEDGE", value: 2)
!332 = !DIEnumerator(name: "TOPEDGE", value: 3)
!333 = !DIEnumerator(name: "TOPLEFTCORNER", value: 4)
!334 = !DIEnumerator(name: "TOPRIGHTCORNER", value: 5)
!335 = !DIEnumerator(name: "BOTTOMEDGE", value: 6)
!336 = !DIEnumerator(name: "BOTTOMLEFTCORNER", value: 7)
!337 = !DIEnumerator(name: "BOTTOMRIGHTCORNER", value: 8)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "clientArea", scope: !316, file: !2, line: 44, baseType: !339, size: 64, align: 32, offset: 192)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "Area", scope: !316, file: !2, line: 17, size: 64, align: 32, elements: !340, identifier: "cforms.Area")
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !339, file: !2, line: 19, baseType: !81, size: 32, align: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !339, file: !2, line: 20, baseType: !81, size: 32, align: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "onSized", scope: !170, file: !2, line: 114, baseType: !311, size: 64, align: 64, offset: 5504)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "onThreadMsg", scope: !170, file: !2, line: 115, baseType: !345, size: 64, align: 64, offset: 5568)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadMsgHandler", scope: !2, file: !2, line: 9, baseType: !346, align: 8)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ThreadMsgHandler", baseType: !347, size: 64, align: 64, dwarfAddressSpace: 0)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !20, !87}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayCref", scope: !164, file: !2, line: 103, baseType: !78, size: 32, align: 32, offset: 896)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_menuDefBgBrush", scope: !164, file: !2, line: 104, baseType: !295, size: 64, align: 64, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_menuHotBgBrush", scope: !164, file: !2, line: 105, baseType: !295, size: 64, align: 64, offset: 1024)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_menuFrameBrush", scope: !164, file: !2, line: 106, baseType: !295, size: 64, align: 64, offset: 1088)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayBrush", scope: !164, file: !2, line: 107, baseType: !295, size: 64, align: 64, offset: 1152)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "onClick", scope: !132, file: !2, line: 136, baseType: !355, size: 64, align: 64, offset: 1664)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MenuEventHandler", scope: !2, file: !2, line: 11, baseType: !356, align: 8)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MenuEventHandler", baseType: !357, size: 64, align: 64, dwarfAddressSpace: 0)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !131, !283}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "onPopup", scope: !132, file: !2, line: 137, baseType: !355, size: 64, align: 64, offset: 1728)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "onCloseup", scope: !132, file: !2, line: 138, baseType: !355, size: 64, align: 64, offset: 1792)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "onFocus", scope: !132, file: !2, line: 139, baseType: !355, size: 64, align: 64, offset: 1856)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !90, file: !2, line: 26, baseType: !258, size: 64, align: 64, offset: 768)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tray", scope: !90, file: !2, line: 27, baseType: !364, size: 64, align: 64, offset: 832)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TrayIcon*", baseType: !365, size: 64, align: 64, dwarfAddressSpace: 0)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "TrayIcon", scope: !2, file: !2, line: 40, size: 8640, align: 64, elements: !366, identifier: "cforms.TrayIcon")
!366 = !{!367, !368, !369, !370, !377, !379, !380, !381, !387, !413, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_resetIcon", scope: !365, file: !2, line: 42, baseType: !3, size: 8, align: 8)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_cmenuUsed", scope: !365, file: !2, line: 43, baseType: !3, size: 8, align: 8, offset: 8)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_retainIcon", scope: !365, file: !2, line: 44, baseType: !3, size: 8, align: 8, offset: 16)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "menuTrigger", scope: !365, file: !2, line: 45, baseType: !371, size: 32, align: 32, offset: 32)
!371 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TrayMenuTrigger", scope: !365, file: !2, line: 145, baseType: !81, size: 32, align: 32, elements: !372)
!372 = !{!189, !373, !374, !375, !376}
!373 = !DIEnumerator(name: "LEFT_CLICK", value: 1)
!374 = !DIEnumerator(name: "LEFT_DOUBLE_CLICK", value: 2)
!375 = !DIEnumerator(name: "RIGHT_CLICK", value: 3)
!376 = !DIEnumerator(name: "ANY_CLICK", value: 4)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_hTrayIcon", scope: !365, file: !2, line: 46, baseType: !378, size: 64, align: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hicon", scope: !2, file: !2, line: 14, baseType: !31, align: 8)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_msgWinHwnd", scope: !365, file: !2, line: 47, baseType: !71, size: 64, align: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "contextMenu", scope: !365, file: !2, line: 48, baseType: !89, size: 64, align: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !365, file: !2, line: 49, baseType: !382, size: 64, align: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !383, size: 64, align: 64, dwarfAddressSpace: 0)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !384, identifier: "any")
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !383, baseType: !11, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !383, baseType: !13, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_nid", scope: !365, file: !2, line: 50, baseType: !388, size: 7616, align: 64, offset: 320)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "NotifyIconData", scope: !365, file: !2, line: 423, size: 7616, align: 64, elements: !389, identifier: "cforms.NotifyIconData")
!389 = !{!390, !392, !393, !394, !395, !396, !397, !401, !402, !403, !407, !408, !412}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "cbSize", scope: !388, file: !2, line: 425, baseType: !391, size: 32, align: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dword", scope: !2, file: !2, line: 34, baseType: !76, align: 4)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", scope: !388, file: !2, line: 426, baseType: !71, size: 64, align: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "uID", scope: !388, file: !2, line: 427, baseType: !76, size: 32, align: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "uFlags", scope: !388, file: !2, line: 428, baseType: !76, size: 32, align: 32, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "uCallbackMessage", scope: !388, file: !2, line: 429, baseType: !76, size: 32, align: 32, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "hIcon", scope: !388, file: !2, line: 430, baseType: !378, size: 64, align: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "toolTipText", scope: !388, file: !2, line: 431, baseType: !398, size: 2048, align: 16, offset: 320)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 2048, align: 16, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 128, lowerBound: 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "dwState", scope: !388, file: !2, line: 432, baseType: !391, size: 32, align: 32, offset: 2368)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "dwStateMask", scope: !388, file: !2, line: 433, baseType: !391, size: 32, align: 32, offset: 2400)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "balloonText", scope: !388, file: !2, line: 434, baseType: !404, size: 4096, align: 16, offset: 2432)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 4096, align: 16, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 256, lowerBound: 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "uVersionOrTimeout", scope: !388, file: !2, line: 435, baseType: !76, size: 32, align: 32, offset: 6528)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "balloonTitle", scope: !388, file: !2, line: 436, baseType: !409, size: 1024, align: 16, offset: 6560)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 1024, align: 16, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 64, lowerBound: 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dwInfoFlags", scope: !388, file: !2, line: 437, baseType: !391, size: 32, align: 32, offset: 7584)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "onBalloonShow", scope: !365, file: !2, line: 52, baseType: !414, size: 64, align: 64, offset: 7936)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "TrayIconEventHandler", scope: !2, file: !2, line: 10, baseType: !415, align: 8)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TrayIconEventHandler", baseType: !416, size: 64, align: 64, dwarfAddressSpace: 0)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !364, !283}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "onBalloonClose", scope: !365, file: !2, line: 53, baseType: !414, size: 64, align: 64, offset: 8000)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "onBalloonClick", scope: !365, file: !2, line: 54, baseType: !414, size: 64, align: 64, offset: 8064)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseMove", scope: !365, file: !2, line: 55, baseType: !414, size: 64, align: 64, offset: 8128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftMouseDown", scope: !365, file: !2, line: 56, baseType: !414, size: 64, align: 64, offset: 8192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftMouseUp", scope: !365, file: !2, line: 57, baseType: !414, size: 64, align: 64, offset: 8256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseDown", scope: !365, file: !2, line: 58, baseType: !414, size: 64, align: 64, offset: 8320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseUp", scope: !365, file: !2, line: 59, baseType: !414, size: 64, align: 64, offset: 8384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftClick", scope: !365, file: !2, line: 60, baseType: !414, size: 64, align: 64, offset: 8448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "onRightClick", scope: !365, file: !2, line: 61, baseType: !414, size: 64, align: 64, offset: 8512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftDoubleClick", scope: !365, file: !2, line: 62, baseType: !414, size: 64, align: 64, offset: 8576)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !90, file: !2, line: 28, baseType: !81, size: 32, align: 32, offset: 896)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !90, file: !2, line: 28, baseType: !81, size: 32, align: 32, offset: 928)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rightClick", scope: !90, file: !2, line: 29, baseType: !3, size: 8, align: 8, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_menuInserted", scope: !90, file: !2, line: 30, baseType: !3, size: 8, align: 8, offset: 968)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_trayParent", scope: !90, file: !2, line: 31, baseType: !3, size: 8, align: 8, offset: 976)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_grayCref", scope: !90, file: !2, line: 32, baseType: !78, size: 32, align: 32, offset: 992)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_dummyHwnd", scope: !90, file: !2, line: 33, baseType: !71, size: 64, align: 64, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_defBgBrush", scope: !90, file: !2, line: 34, baseType: !295, size: 64, align: 64, offset: 1088)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_hotBgBrush", scope: !90, file: !2, line: 34, baseType: !295, size: 64, align: 64, offset: 1152)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_borderBrush", scope: !90, file: !2, line: 34, baseType: !295, size: 64, align: 64, offset: 1216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_grayBrush", scope: !90, file: !2, line: 34, baseType: !295, size: 64, align: 64, offset: 1280)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "onMenuShown", scope: !90, file: !2, line: 37, baseType: !279, size: 64, align: 64, offset: 1344)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "onMenuClose", scope: !90, file: !2, line: 37, baseType: !279, size: 64, align: 64, offset: 1408)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "onTrayMenuShown", scope: !90, file: !2, line: 38, baseType: !414, size: 64, align: 64, offset: 1472)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "onTrayMenuClose", scope: !90, file: !2, line: 38, baseType: !414, size: 64, align: 64, offset: 1536)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_className", scope: !37, file: !2, line: 69, baseType: !150, size: 64, align: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_style", scope: !37, file: !2, line: 70, baseType: !391, size: 32, align: 32, offset: 768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_exStyle", scope: !37, file: !2, line: 71, baseType: !391, size: 32, align: 32, offset: 800)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_drawMode", scope: !37, file: !2, line: 72, baseType: !76, size: 32, align: 32, offset: 832)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_isCreated", scope: !37, file: !2, line: 73, baseType: !3, size: 8, align: 8, offset: 864)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_lbDown", scope: !37, file: !2, line: 74, baseType: !3, size: 8, align: 8, offset: 872)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_rbDown", scope: !37, file: !2, line: 75, baseType: !3, size: 8, align: 8, offset: 880)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_isMouseEntered", scope: !37, file: !2, line: 76, baseType: !3, size: 8, align: 8, offset: 888)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_textable", scope: !37, file: !2, line: 77, baseType: !3, size: 8, align: 8, offset: 896)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_autoSizable", scope: !37, file: !2, line: 78, baseType: !3, size: 8, align: 8, offset: 904)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_cmenuUsed", scope: !37, file: !2, line: 79, baseType: !3, size: 8, align: 8, offset: 912)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_bkBrush", scope: !37, file: !2, line: 80, baseType: !295, size: 64, align: 64, offset: 960)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_wideText", scope: !37, file: !2, line: 81, baseType: !150, size: 64, align: 64, offset: 1024)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_wtext", scope: !37, file: !2, line: 82, baseType: !457, size: 64, align: 64, offset: 1088)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "WideString*", baseType: !458, size: 64, align: 64, dwarfAddressSpace: 0)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "WideString", scope: !2, file: !2, line: 6, size: 256, align: 64, elements: !459, identifier: "cforms.WideString")
!459 = !{!460, !463, !464, !465}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !458, file: !2, line: 7, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "WString", scope: !2, file: !2, line: 23, baseType: !462, align: 8)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ushort*", baseType: !152, size: 64, align: 64, dwarfAddressSpace: 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_inpLen", scope: !458, file: !2, line: 8, baseType: !81, size: 32, align: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_wcLen", scope: !458, file: !2, line: 9, baseType: !81, size: 32, align: 32, offset: 96)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_inpStr", scope: !458, file: !2, line: 10, baseType: !64, size: 128, align: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !37, file: !2, line: 83, baseType: !98, size: 320, align: 64, offset: 1152)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_parent", scope: !37, file: !2, line: 84, baseType: !169, size: 64, align: 64, offset: 1472)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "onGotFocus", scope: !37, file: !2, line: 86, baseType: !279, size: 64, align: 64, offset: 1536)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "onLostFocus", scope: !37, file: !2, line: 87, baseType: !279, size: 64, align: 64, offset: 1600)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "onClick", scope: !37, file: !2, line: 88, baseType: !279, size: 64, align: 64, offset: 1664)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "onRightClick", scope: !37, file: !2, line: 89, baseType: !279, size: 64, align: 64, offset: 1728)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseEnter", scope: !37, file: !2, line: 90, baseType: !279, size: 64, align: 64, offset: 1792)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseLeave", scope: !37, file: !2, line: 91, baseType: !279, size: 64, align: 64, offset: 1856)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseDown", scope: !37, file: !2, line: 92, baseType: !475, size: 64, align: 64, offset: 1920)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "MouseEventHandler", scope: !2, file: !2, line: 5, baseType: !476, align: 8)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MouseEventHandler", baseType: !477, size: 64, align: 64, dwarfAddressSpace: 0)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !258, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MouseEventArgs*", baseType: !480, size: 64, align: 64, dwarfAddressSpace: 0)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "MouseEventArgs", scope: !2, file: !2, line: 28, size: 192, align: 32, elements: !481, identifier: "cforms.MouseEventArgs")
!481 = !{!482, !483, !491, !492, !493, !494, !495}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "eventArgs", scope: !480, file: !2, line: 30, baseType: !284, size: 8, align: 8)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !480, file: !2, line: 31, baseType: !484, size: 32, align: 32, offset: 32)
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MouseButton", scope: !480, file: !2, line: 113, baseType: !81, size: 32, align: 32, elements: !485)
!485 = !{!189, !486, !487, !488, !489, !490}
!486 = !DIEnumerator(name: "RIGHT", value: 1)
!487 = !DIEnumerator(name: "MIDDLE", value: 2)
!488 = !DIEnumerator(name: "LEFT", value: 3)
!489 = !DIEnumerator(name: "XBUTTON1", value: 4)
!490 = !DIEnumerator(name: "XBUTTON2", value: 5)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "isShiftPressed", scope: !480, file: !2, line: 32, baseType: !3, size: 8, align: 8, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "isCtrlPressed", scope: !480, file: !2, line: 33, baseType: !3, size: 8, align: 8, offset: 72)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !480, file: !2, line: 34, baseType: !81, size: 32, align: 32, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !480, file: !2, line: 35, baseType: !81, size: 32, align: 32, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !480, file: !2, line: 36, baseType: !81, size: 32, align: 32, offset: 160)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseUp", scope: !37, file: !2, line: 93, baseType: !475, size: 64, align: 64, offset: 1984)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseDown", scope: !37, file: !2, line: 94, baseType: !475, size: 64, align: 64, offset: 2048)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseUp", scope: !37, file: !2, line: 95, baseType: !475, size: 64, align: 64, offset: 2112)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseWheel", scope: !37, file: !2, line: 96, baseType: !475, size: 64, align: 64, offset: 2176)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseMove", scope: !37, file: !2, line: 97, baseType: !475, size: 64, align: 64, offset: 2240)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "onKeyDown", scope: !37, file: !2, line: 98, baseType: !502, size: 64, align: 64, offset: 2304)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "KeyEventHandler", scope: !2, file: !2, line: 7, baseType: !503, align: 8)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "KeyEventHandler", baseType: !504, size: 64, align: 64, dwarfAddressSpace: 0)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !258, !506}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "KeyEventArgs*", baseType: !507, size: 64, align: 64, dwarfAddressSpace: 0)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyEventArgs", scope: !2, file: !2, line: 47, size: 160, align: 32, elements: !508, identifier: "cforms.KeyEventArgs")
!508 = !{!509, !510, !682, !683, !684, !685, !686, !687}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "eventArgs", scope: !507, file: !2, line: 49, baseType: !284, size: 8, align: 8)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "keyCode", scope: !507, file: !2, line: 50, baseType: !511, size: 32, align: 32, offset: 32)
!511 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Keys", scope: !507, file: !2, line: 165, baseType: !81, size: 32, align: 32, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!513 = !DIEnumerator(name: "MODIFIER", value: 0)
!514 = !DIEnumerator(name: "NOKEY", value: 1)
!515 = !DIEnumerator(name: "LBUTTON", value: 2)
!516 = !DIEnumerator(name: "RBUTTON", value: 3)
!517 = !DIEnumerator(name: "CANCEL", value: 4)
!518 = !DIEnumerator(name: "MBUTTON", value: 5)
!519 = !DIEnumerator(name: "XBUTTO1", value: 6)
!520 = !DIEnumerator(name: "XBUTTON2", value: 7)
!521 = !DIEnumerator(name: "BACK_SPACE", value: 8)
!522 = !DIEnumerator(name: "TAB", value: 9)
!523 = !DIEnumerator(name: "LINE_FEED", value: 10)
!524 = !DIEnumerator(name: "CLEAR", value: 11)
!525 = !DIEnumerator(name: "ENTER", value: 12)
!526 = !DIEnumerator(name: "SHIFT", value: 13)
!527 = !DIEnumerator(name: "CTRL", value: 14)
!528 = !DIEnumerator(name: "ALT", value: 15)
!529 = !DIEnumerator(name: "PAUSE", value: 16)
!530 = !DIEnumerator(name: "CAPS_LOCK", value: 17)
!531 = !DIEnumerator(name: "ESCAPE", value: 18)
!532 = !DIEnumerator(name: "SPACE", value: 19)
!533 = !DIEnumerator(name: "PAGE_UP", value: 20)
!534 = !DIEnumerator(name: "PAGE_DOWN", value: 21)
!535 = !DIEnumerator(name: "END", value: 22)
!536 = !DIEnumerator(name: "HOME", value: 23)
!537 = !DIEnumerator(name: "LEFTA_RROW", value: 24)
!538 = !DIEnumerator(name: "UP_ARROW", value: 25)
!539 = !DIEnumerator(name: "RIGHT_ARROW", value: 26)
!540 = !DIEnumerator(name: "DOWN_ARROW", value: 27)
!541 = !DIEnumerator(name: "SELECT", value: 28)
!542 = !DIEnumerator(name: "PRINT", value: 29)
!543 = !DIEnumerator(name: "EXECUTE", value: 30)
!544 = !DIEnumerator(name: "PRINT_SCREEN", value: 31)
!545 = !DIEnumerator(name: "INSERT", value: 32)
!546 = !DIEnumerator(name: "DEL", value: 33)
!547 = !DIEnumerator(name: "HELP", value: 34)
!548 = !DIEnumerator(name: "D0", value: 35)
!549 = !DIEnumerator(name: "D1", value: 36)
!550 = !DIEnumerator(name: "D2", value: 37)
!551 = !DIEnumerator(name: "D3", value: 38)
!552 = !DIEnumerator(name: "D4", value: 39)
!553 = !DIEnumerator(name: "D5", value: 40)
!554 = !DIEnumerator(name: "D6", value: 41)
!555 = !DIEnumerator(name: "D7", value: 42)
!556 = !DIEnumerator(name: "D8", value: 43)
!557 = !DIEnumerator(name: "D9", value: 44)
!558 = !DIEnumerator(name: "A", value: 45)
!559 = !DIEnumerator(name: "B", value: 46)
!560 = !DIEnumerator(name: "C", value: 47)
!561 = !DIEnumerator(name: "D", value: 48)
!562 = !DIEnumerator(name: "E", value: 49)
!563 = !DIEnumerator(name: "F", value: 50)
!564 = !DIEnumerator(name: "G", value: 51)
!565 = !DIEnumerator(name: "H", value: 52)
!566 = !DIEnumerator(name: "I", value: 53)
!567 = !DIEnumerator(name: "J", value: 54)
!568 = !DIEnumerator(name: "K", value: 55)
!569 = !DIEnumerator(name: "L", value: 56)
!570 = !DIEnumerator(name: "M", value: 57)
!571 = !DIEnumerator(name: "N", value: 58)
!572 = !DIEnumerator(name: "O", value: 59)
!573 = !DIEnumerator(name: "P", value: 60)
!574 = !DIEnumerator(name: "Q", value: 61)
!575 = !DIEnumerator(name: "R", value: 62)
!576 = !DIEnumerator(name: "S", value: 63)
!577 = !DIEnumerator(name: "T", value: 64)
!578 = !DIEnumerator(name: "U", value: 65)
!579 = !DIEnumerator(name: "V", value: 66)
!580 = !DIEnumerator(name: "W", value: 67)
!581 = !DIEnumerator(name: "X", value: 68)
!582 = !DIEnumerator(name: "Y", value: 69)
!583 = !DIEnumerator(name: "Z", value: 70)
!584 = !DIEnumerator(name: "LEFT_WIN", value: 71)
!585 = !DIEnumerator(name: "RIGH_TWIN", value: 72)
!586 = !DIEnumerator(name: "APPS", value: 73)
!587 = !DIEnumerator(name: "SLEEP", value: 74)
!588 = !DIEnumerator(name: "NUM_PAD0", value: 75)
!589 = !DIEnumerator(name: "NUM_PAD1", value: 76)
!590 = !DIEnumerator(name: "NUM_PAD2", value: 77)
!591 = !DIEnumerator(name: "NUM_PAD3", value: 78)
!592 = !DIEnumerator(name: "NUM_PAD4", value: 79)
!593 = !DIEnumerator(name: "NUM_PAD5", value: 80)
!594 = !DIEnumerator(name: "NUM_PAD6", value: 81)
!595 = !DIEnumerator(name: "NUM_PAD7", value: 82)
!596 = !DIEnumerator(name: "NUM_PAD8", value: 83)
!597 = !DIEnumerator(name: "NUM_PAD9", value: 84)
!598 = !DIEnumerator(name: "MULTIPLY", value: 85)
!599 = !DIEnumerator(name: "ADD", value: 86)
!600 = !DIEnumerator(name: "SEPERATOR", value: 87)
!601 = !DIEnumerator(name: "SUBTRACT", value: 88)
!602 = !DIEnumerator(name: "DECIMAL", value: 89)
!603 = !DIEnumerator(name: "DIVIDE", value: 90)
!604 = !DIEnumerator(name: "F1", value: 91)
!605 = !DIEnumerator(name: "F2", value: 92)
!606 = !DIEnumerator(name: "F3", value: 93)
!607 = !DIEnumerator(name: "F4", value: 94)
!608 = !DIEnumerator(name: "F5", value: 95)
!609 = !DIEnumerator(name: "F6", value: 96)
!610 = !DIEnumerator(name: "F7", value: 97)
!611 = !DIEnumerator(name: "F8", value: 98)
!612 = !DIEnumerator(name: "F9", value: 99)
!613 = !DIEnumerator(name: "F10", value: 100)
!614 = !DIEnumerator(name: "F11", value: 101)
!615 = !DIEnumerator(name: "F12", value: 102)
!616 = !DIEnumerator(name: "F13", value: 103)
!617 = !DIEnumerator(name: "F14", value: 104)
!618 = !DIEnumerator(name: "F15", value: 105)
!619 = !DIEnumerator(name: "F16", value: 106)
!620 = !DIEnumerator(name: "F17", value: 107)
!621 = !DIEnumerator(name: "F18", value: 108)
!622 = !DIEnumerator(name: "F19", value: 109)
!623 = !DIEnumerator(name: "F20", value: 110)
!624 = !DIEnumerator(name: "F21", value: 111)
!625 = !DIEnumerator(name: "F22", value: 112)
!626 = !DIEnumerator(name: "F23", value: 113)
!627 = !DIEnumerator(name: "F24", value: 114)
!628 = !DIEnumerator(name: "NUM_LOCK", value: 115)
!629 = !DIEnumerator(name: "SCROLL", value: 116)
!630 = !DIEnumerator(name: "LEFT_SHIFT", value: 117)
!631 = !DIEnumerator(name: "RIGHT_SHIFT", value: 118)
!632 = !DIEnumerator(name: "LEFT_CTRL", value: 119)
!633 = !DIEnumerator(name: "RIGHT_CTRL", value: 120)
!634 = !DIEnumerator(name: "LEFT_MENU", value: 121)
!635 = !DIEnumerator(name: "RIGHT_MENU", value: 122)
!636 = !DIEnumerator(name: "BROWSER_BACK", value: 123)
!637 = !DIEnumerator(name: "BROWSER_FORWARD", value: 124)
!638 = !DIEnumerator(name: "BROWER_REFRESH", value: 125)
!639 = !DIEnumerator(name: "BROWSER_STOP", value: 126)
!640 = !DIEnumerator(name: "BROWSER_SEARCH", value: 127)
!641 = !DIEnumerator(name: "BROWSER_FAVORITES", value: 128)
!642 = !DIEnumerator(name: "BROWSER_HOME", value: 129)
!643 = !DIEnumerator(name: "VOLUME_MUTE", value: 130)
!644 = !DIEnumerator(name: "VOLUME_DOWN", value: 131)
!645 = !DIEnumerator(name: "VOLUME_UP", value: 132)
!646 = !DIEnumerator(name: "MEDIA_NEXT_TRACK", value: 133)
!647 = !DIEnumerator(name: "MEDIA_PRE_VTRACK", value: 134)
!648 = !DIEnumerator(name: "MEDIA_STOP", value: 135)
!649 = !DIEnumerator(name: "MEDIA_PLAY_PAUSE", value: 136)
!650 = !DIEnumerator(name: "LAUNCH_MAIL", value: 137)
!651 = !DIEnumerator(name: "SELECT_MEDIA", value: 138)
!652 = !DIEnumerator(name: "LAUNCH_APP1", value: 139)
!653 = !DIEnumerator(name: "LAUNCH_APP2", value: 140)
!654 = !DIEnumerator(name: "OEM1", value: 141)
!655 = !DIEnumerator(name: "OEM_PLUS", value: 142)
!656 = !DIEnumerator(name: "OEM_COMMA", value: 143)
!657 = !DIEnumerator(name: "OEM_MINUS", value: 144)
!658 = !DIEnumerator(name: "OEM_PERIOD", value: 145)
!659 = !DIEnumerator(name: "OEM_QUESTION", value: 146)
!660 = !DIEnumerator(name: "OEM_TILDE", value: 147)
!661 = !DIEnumerator(name: "OEM_OPEN_BRACKET", value: 148)
!662 = !DIEnumerator(name: "OEM_PIPE", value: 149)
!663 = !DIEnumerator(name: "OEM_CLOSE_BRACKET", value: 150)
!664 = !DIEnumerator(name: "OEM_QUOTES", value: 151)
!665 = !DIEnumerator(name: "OEM8", value: 152)
!666 = !DIEnumerator(name: "OEM_BACK_SLASH", value: 153)
!667 = !DIEnumerator(name: "PROCESS", value: 154)
!668 = !DIEnumerator(name: "PACKET", value: 155)
!669 = !DIEnumerator(name: "ATTN", value: 156)
!670 = !DIEnumerator(name: "CRSEL", value: 157)
!671 = !DIEnumerator(name: "EXSEL", value: 158)
!672 = !DIEnumerator(name: "ERASE_EOF", value: 159)
!673 = !DIEnumerator(name: "PLAY", value: 160)
!674 = !DIEnumerator(name: "ZOOM", value: 161)
!675 = !DIEnumerator(name: "NONAME", value: 162)
!676 = !DIEnumerator(name: "PA1", value: 163)
!677 = !DIEnumerator(name: "OEM_CLEAR", value: 164)
!678 = !DIEnumerator(name: "KEY_CODE", value: 165)
!679 = !DIEnumerator(name: "SHIFT_MODIFIER", value: 166)
!680 = !DIEnumerator(name: "CTRL_MODIFIER", value: 167)
!681 = !DIEnumerator(name: "ALT_MODIFIER", value: 168)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !507, file: !2, line: 51, baseType: !511, size: 32, align: 32, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "keyValue", scope: !507, file: !2, line: 52, baseType: !81, size: 32, align: 32, offset: 96)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "altPressed", scope: !507, file: !2, line: 53, baseType: !3, size: 8, align: 8, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ctrlPressed", scope: !507, file: !2, line: 54, baseType: !3, size: 8, align: 8, offset: 136)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "shiftPressed", scope: !507, file: !2, line: 55, baseType: !3, size: 8, align: 8, offset: 144)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "supressKey", scope: !507, file: !2, line: 56, baseType: !3, size: 8, align: 8, offset: 152)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "onKeyUp", scope: !37, file: !2, line: 99, baseType: !502, size: 64, align: 64, offset: 2368)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "onKeyPress", scope: !37, file: !2, line: 100, baseType: !502, size: 64, align: 64, offset: 2432)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "noLine", scope: !34, file: !2, line: 78, baseType: !3, size: 8, align: 8, offset: 2496)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "noButton", scope: !34, file: !2, line: 79, baseType: !3, size: 8, align: 8, offset: 2504)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "hasCheckBox", scope: !34, file: !2, line: 80, baseType: !3, size: 8, align: 8, offset: 2512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "fullRowSelection", scope: !34, file: !2, line: 81, baseType: !3, size: 8, align: 8, offset: 2520)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "editable", scope: !34, file: !2, line: 82, baseType: !3, size: 8, align: 8, offset: 2528)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "showSelection", scope: !34, file: !2, line: 83, baseType: !3, size: 8, align: 8, offset: 2536)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "hotTrack", scope: !34, file: !2, line: 84, baseType: !3, size: 8, align: 8, offset: 2544)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lineColor", scope: !34, file: !2, line: 85, baseType: !73, size: 64, align: 32, offset: 2560)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "selNode", scope: !34, file: !2, line: 86, baseType: !27, size: 1152, align: 64, offset: 2624)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !34, file: !2, line: 87, baseType: !700, size: 320, align: 64, offset: 3776)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeNodeList", scope: !2, file: !2, line: 66, baseType: !16, align: 8)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_nodeCount", scope: !34, file: !2, line: 88, baseType: !81, size: 32, align: 32, offset: 4096)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_uniqNodeID", scope: !34, file: !2, line: 89, baseType: !81, size: 32, align: 32, offset: 4128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "parentNode", scope: !27, file: !2, line: 96, baseType: !26, size: 64, align: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_treeHwnd", scope: !27, file: !2, line: 97, baseType: !71, size: 64, align: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !27, file: !2, line: 98, baseType: !700, size: 320, align: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "imageIndex", scope: !27, file: !2, line: 99, baseType: !81, size: 32, align: 32, offset: 576)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "selImageIndex", scope: !27, file: !2, line: 100, baseType: !81, size: 32, align: 32, offset: 608)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_childCount", scope: !27, file: !2, line: 101, baseType: !81, size: 32, align: 32, offset: 640)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !27, file: !2, line: 102, baseType: !81, size: 32, align: 32, offset: 672)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "nodeID", scope: !27, file: !2, line: 103, baseType: !81, size: 32, align: 32, offset: 704)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", scope: !27, file: !2, line: 105, baseType: !73, size: 64, align: 32, offset: 736)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", scope: !27, file: !2, line: 106, baseType: !73, size: 64, align: 32, offset: 800)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !27, file: !2, line: 107, baseType: !64, size: 128, align: 64, offset: 896)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "checked", scope: !27, file: !2, line: 108, baseType: !3, size: 8, align: 8, offset: 1024)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_isCreated", scope: !27, file: !2, line: 109, baseType: !3, size: 8, align: 8, offset: 1032)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_notifyHandler", scope: !27, file: !2, line: 111, baseType: !717, size: 64, align: 64, offset: 1088)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeNotifyHandler", scope: !2, file: !2, line: 12, baseType: !718, align: 8)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "NodeNotifyHandler", baseType: !719, size: 64, align: 64, dwarfAddressSpace: 0)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !33, !26, !64, !11}
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "dummy", linkageName: "std_collections_list$p$cforms.TreeNode$.dummy.29908", scope: !2, file: !2, line: 558, type: !81, isLocal: true, isDefinition: true, align: 4)
!723 = !{i32 1, !"CodeView", i32 1}
!724 = !{i32 2, !"Debug Info Version", i32 3}
!725 = !{i32 2, !"wchar_size", i32 2}
!726 = !{i32 4, !"PIC Level", i32 2}
!727 = !{i32 1, !"uwtable", i32 2}
!728 = !{i32 1, !"MaxTLSAlign", i32 65536}
!729 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !730, globals: !731, splitDebugInlining: false)
!730 = !{!40, !103, !154, !174, !187, !198, !204, !328, !371, !484, !511}
!731 = !{!0, !4, !6, !14, !721}
!732 = distinct !DISubprogram(name: "init", linkageName: "std_collections_list$p$cforms.TreeNode$.List.init", scope: !2, file: !2, line: 30, type: !733, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !729, retainedNodes: !736)
!733 = !DISubroutineType(types: !734)
!734 = !{!735, !735, !8, !20}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "List*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!736 = !{}
!737 = !DILocation(line: 31, scope: !732)
!738 = !DILocalVariable(name: "self", arg: 1, scope: !732, file: !2, line: 30, type: !735)
!739 = !DILocation(line: 30, scope: !732)
!740 = !DILocalVariable(name: "allocator", arg: 2, scope: !732, file: !2, line: 30, type: !8)
!741 = !DILocalVariable(name: "initial_capacity", arg: 3, scope: !732, file: !2, line: 30, type: !19)
!742 = !DILocation(line: 32, scope: !732)
!743 = !DILocation(line: 33, scope: !732)
!744 = !DILocation(line: 34, scope: !732)
!745 = !DILocation(line: 35, scope: !732)
!746 = !DILocation(line: 36, scope: !732)
!747 = !DILocation(line: 37, scope: !732)
!748 = distinct !DISubprogram(name: "tinit", linkageName: "std_collections_list$p$cforms.TreeNode$.List.tinit", scope: !2, file: !2, line: 46, type: !749, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !729, retainedNodes: !736)
!749 = !DISubroutineType(types: !750)
!750 = !{!735, !735, !20}
!751 = !DILocation(line: 47, scope: !748)
!752 = !DILocalVariable(name: "self", arg: 1, scope: !748, file: !2, line: 46, type: !735)
!753 = !DILocation(line: 46, scope: !748)
!754 = !DILocalVariable(name: "initial_capacity", arg: 2, scope: !748, file: !2, line: 46, type: !19)
!755 = !DILocation(line: 48, scope: !748)
!756 = distinct !DISubprogram(name: "init_with_array", linkageName: "std_collections_list$p$cforms.TreeNode$.List.init_with_array", scope: !2, file: !2, line: 57, type: !757, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !729, retainedNodes: !736)
!757 = !DISubroutineType(types: !758)
!758 = !{!735, !735, !8, !759}
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "TreeNode*[]", size: 128, align: 64, elements: !760, identifier: "TreeNode*[]")
!760 = !{!761, !763}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !759, baseType: !762, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TreeNode**", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !759, baseType: !19, size: 64, align: 64, offset: 64)
!764 = !DILocation(line: 58, scope: !756)
!765 = !DILocalVariable(name: "self", arg: 1, scope: !756, file: !2, line: 57, type: !735)
!766 = !DILocation(line: 57, scope: !756)
!767 = !DILocalVariable(name: "allocator", arg: 2, scope: !756, file: !2, line: 57, type: !8)
!768 = !DILocalVariable(name: "values", arg: 3, scope: !756, file: !2, line: 57, type: !769)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type[]", size: 128, align: 64, elements: !770, identifier: "Type[]")
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !769, baseType: !24, size: 64, align: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !769, baseType: !19, size: 64, align: 64, offset: 64)
!773 = !DILocation(line: 55, scope: !774)
!774 = distinct !DILexicalBlock(scope: !756, file: !2, line: 58, column: 1)
!775 = !DILocation(line: 59, scope: !756)
!776 = !DILocation(line: 60, scope: !756)
!777 = !DILocation(line: 61, scope: !756)
!778 = distinct !DISubprogram(name: "tinit_with_array", linkageName: "std_collections_list$p$cforms.TreeNode$.List.tinit_with_array", scope: !2, file: !2, line: 70, type: !779, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !729, retainedNodes: !736)
!779 = !DISubroutineType(types: !780)
!780 = !{!735, !735, !759}
!781 = !DILocation(line: 71, scope: !778)
!782 = !DILocalVariable(name: "self", arg: 1, scope: !778, file: !2, line: 70, type: !735)
!783 = !DILocation(line: 70, scope: !778)
!784 = !DILocalVariable(name: "values", arg: 2, scope: !778, file: !2, line: 70, type: !769)
!785 = !DILocation(line: 68, scope: !786)
!786 = distinct !DILexicalBlock(scope: !778, file: !2, line: 71, column: 1)
!787 = !DILocation(line: 72, scope: !778)
!788 = !DILocation(line: 73, scope: !778)
!789 = !DILocation(line: 74, scope: !778)
!790 = distinct !DISubprogram(name: "init_wrapping_array", linkageName: "std_collections_list$p$cforms.TreeNode$.List.init_wrapping_array", scope: !2, file: !2, line: 80, type: !791, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !729, retainedNodes: !736)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !735, !8, !759}
!793 = !DILocation(line: 81, scope: !790)
!794 = !DILocalVariable(name: "self", arg: 1, scope: !790, file: !2, line: 80, type: !735)
!795 = !DILocation(line: 80, scope: !790)
!796 = !DILocalVariable(name: "allocator", arg: 2, scope: !790, file: !2, line: 80, type: !8)
!797 = !DILocalVariable(name: "types", arg: 3, scope: !790, file: !2, line: 80, type: !769)
!798 = !DILocation(line: 78, scope: !799)
!799 = distinct !DILexicalBlock(scope: !790, file: !2, line: 81, column: 1)
!800 = !DILocation(line: 82, scope: !790)
!801 = !DILocation(line: 83, scope: !790)
!802 = !DILocation(line: 84, scope: !790)
!803 = !DILocation(line: 85, scope: !790)
!804 = !DILocation(line: 422, scope: !790)
!805 = distinct !DISubprogram(name: "is_initialized", linkageName: "std_collections_list$p$cforms.TreeNode$.List.is_initialized", scope: !2, file: !2, line: 88, type: !806, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !729, retainedNodes: !736)
!806 = !DISubroutineType(types: !807)
!807 = !{!3, !735}
!808 = !DILocation(line: 88, scope: !805)
!809 = !DILocalVariable(name: "self", arg: 1, scope: !805, file: !2, line: 88, type: !735)
!810 = distinct !DISubprogram(name: "to_format", linkageName: "std_collections_list$p$cforms.TreeNode$.List.to_format", scope: !2, file: !2, line: 90, type: !811, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !729, retainedNodes: !736)
!811 = !DISubroutineType(types: !812)
!812 = !{!813, !814, !735, !815}
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !87)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !816, size: 64, align: 64, dwarfAddressSpace: 0)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 63, size: 320, align: 64, elements: !817, identifier: "std.io.Formatter")
!817 = !{!818, !819, !824}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !816, file: !2, line: 65, baseType: !11, size: 64, align: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !816, file: !2, line: 66, baseType: !820, size: 64, align: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 16, baseType: !821, align: 8)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !822, size: 64, align: 64, dwarfAddressSpace: 0)
!822 = !DISubroutineType(types: !823)
!823 = !{!813, !11, !11, !41}
!824 = !DIDerivedType(tag: DW_TAG_member, scope: !816, file: !2, line: 67, baseType: !825, size: 192, align: 64, offset: 128)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !816, file: !2, line: 67, size: 192, align: 64, elements: !826)
!826 = !{!827, !828, !829, !830}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !825, file: !2, line: 69, baseType: !76, size: 32, align: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !825, file: !2, line: 70, baseType: !76, size: 32, align: 32, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !825, file: !2, line: 71, baseType: !76, size: 32, align: 32, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !825, file: !2, line: 72, baseType: !813, size: 64, align: 64, offset: 128)
!831 = !DILocation(line: 91, scope: !810)
!832 = !DILocalVariable(name: "self", arg: 1, scope: !810, file: !2, line: 90, type: !735)
!833 = !DILocation(line: 90, scope: !810)
!834 = !DILocalVariable(name: "formatter", arg: 2, scope: !810, file: !2, line: 90, type: !815)
!835 = !DILocation(line: 92, scope: !836)
!836 = distinct !DILexicalBlock(scope: !810, file: !2, line: 92, column: 2)
!837 = !DILocation(line: 95, scope: !838)
!838 = distinct !DILexicalBlock(scope: !836, file: !2, line: 95, column: 4)
!839 = !DILocation(line: 97, scope: !840)
!840 = distinct !DILexicalBlock(scope: !836, file: !2, line: 97, column: 4)
!841 = !DILocalVariable(name: "n", scope: !842, file: !2, line: 99, type: !19, align: 8)
!842 = distinct !DILexicalBlock(scope: !836, file: !2, line: 99, column: 4)
!843 = !DILocation(line: 99, scope: !842)
!844 = !DILocation(line: 100, scope: !845)
!845 = distinct !DILexicalBlock(scope: !842, file: !2, line: 100, column: 4)
!846 = !DILocalVariable(name: ".temp", scope: !845, file: !2, line: 100, type: !19, align: 8)
!847 = !DILocalVariable(name: "i", scope: !848, file: !2, line: 100, type: !19, align: 8)
!848 = distinct !DILexicalBlock(scope: !845, file: !2, line: 101, column: 4)
!849 = !DILocation(line: 100, scope: !848)
!850 = !DILocalVariable(name: "element", scope: !848, file: !2, line: 100, type: !26, align: 8)
!851 = !DILocation(line: 102, scope: !852)
!852 = distinct !DILexicalBlock(scope: !848, file: !2, line: 101, column: 4)
!853 = !DILocation(line: 103, scope: !852)
!854 = !DILocation(line: 105, scope: !842)
!855 = !DILocation(line: 106, scope: !842)
!856 = distinct !DISubprogram(name: "push", linkageName: "std_collections_list$p$cforms.TreeNode$.List.push", scope: !2, file: !2, line: 110, type: !857, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !729, retainedNodes: !736)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !735, !26}
!859 = !DILocation(line: 111, scope: !856)
!860 = !DILocalVariable(name: "self", arg: 1, scope: !856, file: !2, line: 110, type: !735)
!861 = !DILocation(line: 110, scope: !856)
!862 = !DILocalVariable(name: "element", arg: 2, scope: !856, file: !2, line: 110, type: !25)
!863 = !DILocation(line: 112, scope: !856)
!864 = !DILocation(line: 113, scope: !856)
!865 = !DILocation(line: 422, scope: !856)
!866 = distinct !DISubprogram(name: "pop", linkageName: "std_collections_list$p$cforms.TreeNode$.List.pop", scope: !2, file: !2, line: 116, type: !867, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !729, retainedNodes: !736)
!867 = !DISubroutineType(types: !868)
!868 = !{!813, !24, !735}
!869 = !DILocation(line: 117, scope: !866)
!870 = !DILocalVariable(name: "self", arg: 1, scope: !866, file: !2, line: 116, type: !735)
!871 = !DILocation(line: 116, scope: !866)
!872 = !DILocation(line: 118, scope: !866)
!873 = !DILocation(line: 120, scope: !866)
!874 = !DILocation(line: 119, scope: !875)
!875 = distinct !DILexicalBlock(scope: !866, file: !2, line: 119, column: 8)
!876 = !DILocation(line: 422, scope: !875)
!877 = distinct !DISubprogram(name: "clear", linkageName: "std_collections_list$p$cforms.TreeNode$.List.clear", scope: !2, file: !2, line: 123, type: !878, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !729, retainedNodes: !736)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !735}
!880 = !DILocation(line: 124, scope: !877)
!881 = !DILocalVariable(name: "self", arg: 1, scope: !877, file: !2, line: 123, type: !735)
!882 = !DILocation(line: 123, scope: !877)
!883 = !DILocation(line: 125, scope: !877)
!884 = !DILocation(line: 422, scope: !877)
