; ModuleID = 'std_collections_map$String$p$cforms.MenuItem$'
source_filename = "std_collections_map$String$p$cforms.MenuItem$"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%HashMap = type { %"Entry*[]", %any, i32, i32, float }
%"Entry*[]" = type { ptr, i64 }
%"char[]" = type { ptr, i64 }
%LinkedHashMap = type { %"LinkedEntry*[]", %any, i64, i64, float, ptr, ptr }
%"LinkedEntry*[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"char[][]" = type { ptr, i64 }
%"MenuItem*[]" = type { ptr, i64 }
%HashMapIterator = type { ptr, i32, i32, ptr }
%Entry = type { i32, %"char[]", ptr, ptr }
%LinkedHashMapIterator = type { ptr, ptr, i8 }
%LinkedEntry = type { i32, %"char[]", ptr, ptr, ptr, ptr }

$"std_collections_map$String$p$cforms.MenuItem$.HashMap.init" = comdat any

$"std_collections_map$String$p$cforms.MenuItem$.HashMap.tinit" = comdat any

$"std_collections_map$String$p$cforms.MenuItem$.HashMap.init_from_keys_and_values" = comdat any

$"std_collections_map$String$p$cforms.MenuItem$.HashMap.tinit_from_keys_and_values" = comdat any

$"std_collections_map$String$p$cforms.MenuItem$.HashMap.is_initialized" = comdat any

$"std_collections_map$String$p$cforms.MenuItem$.HashMap.init_from_map" = comdat any

$"std_collections_map$String$p$cforms.MenuItem$.HashMap.tinit_from_map" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "DEFAULT_INITIAL_CAPACITY", linkageName: "std_collections_map$String$p$cforms.MenuItem$.DEFAULT_INITIAL_CAPACITY", scope: !2, file: !2, line: 11, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "hashmap.c3", directory: "C:/Compilers/C3/lib/std/collections")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "MAXIMUM_CAPACITY", linkageName: "std_collections_map$String$p$cforms.MenuItem$.MAXIMUM_CAPACITY", scope: !2, file: !2, line: 12, type: !3, isLocal: false, isDefinition: true, align: 4)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "DEFAULT_LOAD_FACTOR", linkageName: "std_collections_map$String$p$cforms.MenuItem$.DEFAULT_LOAD_FACTOR", scope: !2, file: !2, line: 13, type: !8, isLocal: false, isDefinition: true, align: 4)
!8 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "VALUE_IS_EQUATABLE", linkageName: "std_collections_map$String$p$cforms.MenuItem$.VALUE_IS_EQUATABLE", scope: !2, file: !2, line: 14, type: !11, isLocal: false, isDefinition: true, align: 1)
!11 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "COPY_KEYS", linkageName: "std_collections_map$String$p$cforms.MenuItem$.COPY_KEYS", scope: !2, file: !2, line: 15, type: !11, isLocal: false, isDefinition: true, align: 1)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "MAP_HEAP_ALLOCATOR", linkageName: "std_collections_map$String$p$cforms.MenuItem$.MAP_HEAP_ALLOCATOR", scope: !2, file: !2, line: 17, type: !16, isLocal: false, isDefinition: true, align: 8)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !17, identifier: "Allocator")
!17 = !{!18, !20}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !16, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !16, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "ONHEAP", linkageName: "std_collections_map$String$p$cforms.MenuItem$.ONHEAP", scope: !2, file: !2, line: 19, type: !24, isLocal: false, isDefinition: true, align: 8)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !2, file: !2, line: 29, size: 384, align: 64, elements: !25, identifier: "std_collections_map$String$p$cforms.MenuItem$.HashMap")
!25 = !{!26, !696, !697, !698, !699}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !24, file: !2, line: 31, baseType: !27, size: 128, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !28, identifier: "Entry*[]")
!28 = !{!29, !695}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !2, file: !2, line: 21, size: 320, align: 64, elements: !33, identifier: "std_collections_map$String$p$cforms.MenuItem$.Entry")
!33 = !{!34, !35, !46, !694}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !32, file: !2, line: 23, baseType: !3, size: 32, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !32, file: !2, line: 24, baseType: !36, size: 128, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !2, file: !2, line: 48, baseType: !37, align: 8)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !39, identifier: "char[]")
!39 = !{!40, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !38, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !38, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !45)
!45 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !32, file: !2, line: 25, baseType: !47, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !2, file: !2, line: 48, baseType: !48, align: 8)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MenuItem*", baseType: !49, size: 64, align: 64, dwarfAddressSpace: 0)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuItem", scope: !2, file: !2, line: 112, size: 1920, align: 64, elements: !50, identifier: "cforms.MenuItem")
!50 = !{!51, !92, !93, !95, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !116, !123, !124, !125, !686, !691, !692, !693}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !49, file: !2, line: 114, baseType: !52, size: 768, align: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuBase", scope: !49, file: !2, line: 56, size: 768, align: 64, elements: !53, identifier: "cforms.MenuBase")
!53 = !{!54, !57, !81, !82}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !52, file: !2, line: 58, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hmenu", scope: !2, file: !2, line: 16, baseType: !56, align: 8)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "Handle", scope: !2, file: !2, line: 6, baseType: !19, align: 8)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !52, file: !2, line: 59, baseType: !58, size: 320, align: 64, offset: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "Font", scope: !52, file: !2, line: 5, size: 320, align: 64, elements: !59, identifier: "cforms.Font")
!59 = !{!60, !61, !63, !75, !76, !77, !78, !79}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !58, file: !2, line: 7, baseType: !37, size: 128, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !58, file: !2, line: 8, baseType: !62, size: 32, align: 32, offset: 128)
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !58, file: !2, line: 9, baseType: !64, size: 32, align: 32, offset: 160)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FontWeight", scope: !58, file: !2, line: 45, baseType: !62, size: 32, align: 32, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74}
!66 = !DIEnumerator(name: "THIN", value: 0)
!67 = !DIEnumerator(name: "EXTRA_LIGHT", value: 1)
!68 = !DIEnumerator(name: "LIGHT", value: 2)
!69 = !DIEnumerator(name: "NORMAL", value: 3)
!70 = !DIEnumerator(name: "MEDIUM", value: 4)
!71 = !DIEnumerator(name: "SEMI_BOLD", value: 5)
!72 = !DIEnumerator(name: "BOLD", value: 6)
!73 = !DIEnumerator(name: "EXTRA_BOLD", value: 7)
!74 = !DIEnumerator(name: "THICK", value: 8)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "italics", scope: !58, file: !2, line: 10, baseType: !11, size: 8, align: 8, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "underline", scope: !58, file: !2, line: 11, baseType: !11, size: 8, align: 8, offset: 200)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "strikeout", scope: !58, file: !2, line: 12, baseType: !11, size: 8, align: 8, offset: 208)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_isCreated", scope: !58, file: !2, line: 13, baseType: !11, size: 8, align: 8, offset: 216)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !58, file: !2, line: 14, baseType: !80, size: 64, align: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hfont", scope: !2, file: !2, line: 12, baseType: !56, align: 8)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_menuCount", scope: !52, file: !2, line: 60, baseType: !3, size: 32, align: 32, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_menuList", scope: !52, file: !2, line: 62, baseType: !83, size: 320, align: 64, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "MenuItemList", scope: !2, file: !2, line: 47, baseType: !84, align: 8)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !85, identifier: "std_collections_list$p$cforms.MenuItem$.List")
!85 = !{!86, !87, !88, !89}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !84, file: !2, line: 20, baseType: !44, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !84, file: !2, line: 21, baseType: !44, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !84, file: !2, line: 22, baseType: !16, size: 128, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !84, file: !2, line: 23, baseType: !90, size: 64, align: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 47, baseType: !48, align: 8)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "parentHandle", scope: !49, file: !2, line: 115, baseType: !55, size: 64, align: 64, offset: 768)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_formHwnd", scope: !49, file: !2, line: 116, baseType: !94, size: 64, align: 64, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hwnd", scope: !2, file: !2, line: 19, baseType: !56, align: 8)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bgColor", scope: !49, file: !2, line: 117, baseType: !96, size: 64, align: 32, offset: 896)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", scope: !49, file: !2, line: 14, size: 64, align: 32, elements: !97, identifier: "cforms.Color")
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !96, file: !2, line: 16, baseType: !3, size: 32, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !96, file: !2, line: 17, baseType: !100, size: 32, align: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colorref", scope: !2, file: !2, line: 36, baseType: !3, align: 4)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "fgColor", scope: !49, file: !2, line: 118, baseType: !96, size: 64, align: 32, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "idNum", scope: !49, file: !2, line: 119, baseType: !3, size: 32, align: 32, offset: 1024)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_index", scope: !49, file: !2, line: 121, baseType: !3, size: 32, align: 32, offset: 1056)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_evtFlag", scope: !49, file: !2, line: 122, baseType: !3, size: 32, align: 32, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "iLevel", scope: !49, file: !2, line: 123, baseType: !62, size: 32, align: 32, offset: 1120)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hasCheckMark", scope: !49, file: !2, line: 124, baseType: !11, size: 8, align: 8, offset: 1152)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_isCreated", scope: !49, file: !2, line: 125, baseType: !11, size: 8, align: 8, offset: 1160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_isEnabled", scope: !49, file: !2, line: 126, baseType: !11, size: 8, align: 8, offset: 1168)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_popup", scope: !49, file: !2, line: 127, baseType: !11, size: 8, align: 8, offset: 1176)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_formMenu", scope: !49, file: !2, line: 128, baseType: !11, size: 8, align: 8, offset: 1184)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !49, file: !2, line: 129, baseType: !37, size: 128, align: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_wideText", scope: !49, file: !2, line: 130, baseType: !113, size: 64, align: 64, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Char16*", baseType: !114, size: 64, align: 64, dwarfAddressSpace: 0)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char16", scope: !2, file: !2, line: 33, baseType: !115, align: 2)
!115 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !49, file: !2, line: 131, baseType: !117, size: 8, align: 8, offset: 1408)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MenuType", scope: !49, file: !2, line: 49, baseType: !42, size: 8, align: 8, elements: !118)
!118 = !{!119, !120, !121, !122}
!119 = !DIEnumerator(name: "BASE_MENU", value: 0, isUnsigned: true)
!120 = !DIEnumerator(name: "MENU_ITEM", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "POPUP", value: 2, isUnsigned: true)
!122 = !DIEnumerator(name: "SEPRATOR", value: 3, isUnsigned: true)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_parent", scope: !49, file: !2, line: 132, baseType: !48, size: 64, align: 64, offset: 1472)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "uFlag", scope: !49, file: !2, line: 133, baseType: !3, size: 32, align: 32, offset: 1536)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_mbar", scope: !49, file: !2, line: 134, baseType: !126, size: 64, align: 64, offset: 1600)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MenuBar*", baseType: !127, size: 64, align: 64, dwarfAddressSpace: 0)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuBar", scope: !2, file: !2, line: 98, size: 1216, align: 64, elements: !128, identifier: "cforms.MenuBar")
!128 = !{!129, !130, !131, !681, !682, !683, !684, !685}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !127, file: !2, line: 100, baseType: !52, size: 768, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_formHwnd", scope: !127, file: !2, line: 101, baseType: !94, size: 64, align: 64, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_pForm", scope: !127, file: !2, line: 102, baseType: !132, size: 64, align: 64, offset: 832)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Form*", baseType: !133, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", scope: !2, file: !2, line: 69, size: 5632, align: 64, elements: !134, identifier: "cforms.Form")
!134 = !{!135, !516, !529, !539, !545, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !576, !590, !600, !623, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !675, !676}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !133, file: !2, line: 71, baseType: !136, size: 2496, align: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Control", scope: !133, file: !2, line: 55, size: 2496, align: 64, elements: !137, identifier: "cforms.Control")
!137 = !{!138, !157, !161, !162, !163, !164, !165, !166, !167, !168, !169, !172, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !292, !293, !294, !295, !296, !297, !298, !299, !300, !322, !323, !324, !325, !326, !327, !514, !515}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !136, file: !2, line: 57, baseType: !139, size: 8, align: 8)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ControlType", scope: !136, file: !2, line: 25, baseType: !42, size: 8, align: 8, elements: !140)
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!141 = !DIEnumerator(name: "NONE", value: 0, isUnsigned: true)
!142 = !DIEnumerator(name: "BUTTON", value: 1, isUnsigned: true)
!143 = !DIEnumerator(name: "CALENDAR", value: 2, isUnsigned: true)
!144 = !DIEnumerator(name: "CHECK_BOX", value: 3, isUnsigned: true)
!145 = !DIEnumerator(name: "COMBO_BOX", value: 4, isUnsigned: true)
!146 = !DIEnumerator(name: "DATE_TIME_PICKER", value: 5, isUnsigned: true)
!147 = !DIEnumerator(name: "GROUP_BOX", value: 6, isUnsigned: true)
!148 = !DIEnumerator(name: "LABEL", value: 7, isUnsigned: true)
!149 = !DIEnumerator(name: "LIST_BOX", value: 8, isUnsigned: true)
!150 = !DIEnumerator(name: "LIST_VIEW", value: 9, isUnsigned: true)
!151 = !DIEnumerator(name: "NUM_PICKER", value: 10, isUnsigned: true)
!152 = !DIEnumerator(name: "PROGRESS_BAR", value: 11, isUnsigned: true)
!153 = !DIEnumerator(name: "RADIO_BUTTON", value: 12, isUnsigned: true)
!154 = !DIEnumerator(name: "TEXT_BOX", value: 13, isUnsigned: true)
!155 = !DIEnumerator(name: "TRACK_BAR", value: 14, isUnsigned: true)
!156 = !DIEnumerator(name: "TREE_VIEW", value: 15, isUnsigned: true)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !2, line: 58, baseType: !158, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !159, align: 8)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !160, size: 64, align: 64, dwarfAddressSpace: 0)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 1)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !136, file: !2, line: 59, baseType: !37, size: 128, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !136, file: !2, line: 60, baseType: !94, size: 64, align: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", scope: !136, file: !2, line: 61, baseType: !96, size: 64, align: 32, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", scope: !136, file: !2, line: 62, baseType: !96, size: 64, align: 32, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !136, file: !2, line: 63, baseType: !62, size: 32, align: 32, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !136, file: !2, line: 64, baseType: !62, size: 32, align: 32, offset: 480)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "xpos", scope: !136, file: !2, line: 65, baseType: !62, size: 32, align: 32, offset: 512)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ypos", scope: !136, file: !2, line: 66, baseType: !62, size: 32, align: 32, offset: 544)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ctlID", scope: !136, file: !2, line: 67, baseType: !170, size: 64, align: 64, offset: 576)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "iptr", baseType: !171)
!171 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "contextMenu", scope: !136, file: !2, line: 68, baseType: !173, size: 64, align: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ContextMenu*", baseType: !174, size: 64, align: 64, dwarfAddressSpace: 0)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "ContextMenu", scope: !2, file: !2, line: 23, size: 1600, align: 64, elements: !175, identifier: "cforms.ContextMenu")
!175 = !{!176, !177, !179, !249, !250, !251, !252, !253, !254, !255, !256, !258, !259, !260, !261, !266, !267, !268}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !174, file: !2, line: 25, baseType: !52, size: 768, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !174, file: !2, line: 26, baseType: !178, size: 64, align: 64, offset: 768)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Control*", baseType: !136, size: 64, align: 64, dwarfAddressSpace: 0)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tray", scope: !174, file: !2, line: 27, baseType: !180, size: 64, align: 64, offset: 832)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TrayIcon*", baseType: !181, size: 64, align: 64, dwarfAddressSpace: 0)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "TrayIcon", scope: !2, file: !2, line: 40, size: 8640, align: 64, elements: !182, identifier: "cforms.TrayIcon")
!182 = !{!183, !184, !185, !186, !194, !196, !197, !198, !204, !230, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_resetIcon", scope: !181, file: !2, line: 42, baseType: !11, size: 8, align: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_cmenuUsed", scope: !181, file: !2, line: 43, baseType: !11, size: 8, align: 8, offset: 8)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_retainIcon", scope: !181, file: !2, line: 44, baseType: !11, size: 8, align: 8, offset: 16)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "menuTrigger", scope: !181, file: !2, line: 45, baseType: !187, size: 32, align: 32, offset: 32)
!187 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TrayMenuTrigger", scope: !181, file: !2, line: 145, baseType: !62, size: 32, align: 32, elements: !188)
!188 = !{!189, !190, !191, !192, !193}
!189 = !DIEnumerator(name: "NONE", value: 0)
!190 = !DIEnumerator(name: "LEFT_CLICK", value: 1)
!191 = !DIEnumerator(name: "LEFT_DOUBLE_CLICK", value: 2)
!192 = !DIEnumerator(name: "RIGHT_CLICK", value: 3)
!193 = !DIEnumerator(name: "ANY_CLICK", value: 4)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_hTrayIcon", scope: !181, file: !2, line: 46, baseType: !195, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hicon", scope: !2, file: !2, line: 14, baseType: !56, align: 8)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_msgWinHwnd", scope: !181, file: !2, line: 47, baseType: !94, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "contextMenu", scope: !181, file: !2, line: 48, baseType: !173, size: 64, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !181, file: !2, line: 49, baseType: !199, size: 64, align: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !200, size: 64, align: 64, dwarfAddressSpace: 0)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !201, identifier: "any")
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !200, baseType: !19, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !200, baseType: !21, size: 64, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_nid", scope: !181, file: !2, line: 50, baseType: !205, size: 7616, align: 64, offset: 320)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "NotifyIconData", scope: !181, file: !2, line: 423, size: 7616, align: 64, elements: !206, identifier: "cforms.NotifyIconData")
!206 = !{!207, !209, !210, !211, !212, !213, !214, !218, !219, !220, !224, !225, !229}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cbSize", scope: !205, file: !2, line: 425, baseType: !208, size: 32, align: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dword", scope: !2, file: !2, line: 34, baseType: !3, align: 4)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", scope: !205, file: !2, line: 426, baseType: !94, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "uID", scope: !205, file: !2, line: 427, baseType: !3, size: 32, align: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "uFlags", scope: !205, file: !2, line: 428, baseType: !3, size: 32, align: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "uCallbackMessage", scope: !205, file: !2, line: 429, baseType: !3, size: 32, align: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "hIcon", scope: !205, file: !2, line: 430, baseType: !195, size: 64, align: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "toolTipText", scope: !205, file: !2, line: 431, baseType: !215, size: 2048, align: 16, offset: 320)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 2048, align: 16, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 128, lowerBound: 0)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "dwState", scope: !205, file: !2, line: 432, baseType: !208, size: 32, align: 32, offset: 2368)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "dwStateMask", scope: !205, file: !2, line: 433, baseType: !208, size: 32, align: 32, offset: 2400)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "balloonText", scope: !205, file: !2, line: 434, baseType: !221, size: 4096, align: 16, offset: 2432)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 4096, align: 16, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 256, lowerBound: 0)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "uVersionOrTimeout", scope: !205, file: !2, line: 435, baseType: !3, size: 32, align: 32, offset: 6528)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "balloonTitle", scope: !205, file: !2, line: 436, baseType: !226, size: 1024, align: 16, offset: 6560)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 1024, align: 16, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 64, lowerBound: 0)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "dwInfoFlags", scope: !205, file: !2, line: 437, baseType: !208, size: 32, align: 32, offset: 7584)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "onBalloonShow", scope: !181, file: !2, line: 52, baseType: !231, size: 64, align: 64, offset: 7936)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "TrayIconEventHandler", scope: !2, file: !2, line: 10, baseType: !232, align: 8)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TrayIconEventHandler", baseType: !233, size: 64, align: 64, dwarfAddressSpace: 0)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !180, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "EventArgs*", baseType: !236, size: 64, align: 64, dwarfAddressSpace: 0)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "EventArgs", scope: !2, file: !2, line: 23, size: 8, align: 8, elements: !237, identifier: "cforms.EventArgs")
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "handled", scope: !236, file: !2, line: 25, baseType: !11, size: 8, align: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "onBalloonClose", scope: !181, file: !2, line: 53, baseType: !231, size: 64, align: 64, offset: 8000)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "onBalloonClick", scope: !181, file: !2, line: 54, baseType: !231, size: 64, align: 64, offset: 8064)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseMove", scope: !181, file: !2, line: 55, baseType: !231, size: 64, align: 64, offset: 8128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftMouseDown", scope: !181, file: !2, line: 56, baseType: !231, size: 64, align: 64, offset: 8192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftMouseUp", scope: !181, file: !2, line: 57, baseType: !231, size: 64, align: 64, offset: 8256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseDown", scope: !181, file: !2, line: 58, baseType: !231, size: 64, align: 64, offset: 8320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseUp", scope: !181, file: !2, line: 59, baseType: !231, size: 64, align: 64, offset: 8384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftClick", scope: !181, file: !2, line: 60, baseType: !231, size: 64, align: 64, offset: 8448)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "onRightClick", scope: !181, file: !2, line: 61, baseType: !231, size: 64, align: 64, offset: 8512)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "onLeftDoubleClick", scope: !181, file: !2, line: 62, baseType: !231, size: 64, align: 64, offset: 8576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !174, file: !2, line: 28, baseType: !62, size: 32, align: 32, offset: 896)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !174, file: !2, line: 28, baseType: !62, size: 32, align: 32, offset: 928)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "rightClick", scope: !174, file: !2, line: 29, baseType: !11, size: 8, align: 8, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_menuInserted", scope: !174, file: !2, line: 30, baseType: !11, size: 8, align: 8, offset: 968)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_trayParent", scope: !174, file: !2, line: 31, baseType: !11, size: 8, align: 8, offset: 976)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_grayCref", scope: !174, file: !2, line: 32, baseType: !100, size: 32, align: 32, offset: 992)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_dummyHwnd", scope: !174, file: !2, line: 33, baseType: !94, size: 64, align: 64, offset: 1024)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_defBgBrush", scope: !174, file: !2, line: 34, baseType: !257, size: 64, align: 64, offset: 1088)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hbrush", scope: !2, file: !2, line: 9, baseType: !56, align: 8)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_hotBgBrush", scope: !174, file: !2, line: 34, baseType: !257, size: 64, align: 64, offset: 1152)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_borderBrush", scope: !174, file: !2, line: 34, baseType: !257, size: 64, align: 64, offset: 1216)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_grayBrush", scope: !174, file: !2, line: 34, baseType: !257, size: 64, align: 64, offset: 1280)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "onMenuShown", scope: !174, file: !2, line: 37, baseType: !262, size: 64, align: 64, offset: 1344)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "EventHandler", scope: !2, file: !2, line: 4, baseType: !263, align: 8)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "EventHandler", baseType: !264, size: 64, align: 64, dwarfAddressSpace: 0)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !178, !235}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "onMenuClose", scope: !174, file: !2, line: 37, baseType: !262, size: 64, align: 64, offset: 1408)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "onTrayMenuShown", scope: !174, file: !2, line: 38, baseType: !231, size: 64, align: 64, offset: 1472)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "onTrayMenuClose", scope: !174, file: !2, line: 38, baseType: !231, size: 64, align: 64, offset: 1536)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_className", scope: !136, file: !2, line: 69, baseType: !113, size: 64, align: 64, offset: 704)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_style", scope: !136, file: !2, line: 70, baseType: !208, size: 32, align: 32, offset: 768)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_exStyle", scope: !136, file: !2, line: 71, baseType: !208, size: 32, align: 32, offset: 800)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_drawMode", scope: !136, file: !2, line: 72, baseType: !3, size: 32, align: 32, offset: 832)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_isCreated", scope: !136, file: !2, line: 73, baseType: !11, size: 8, align: 8, offset: 864)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_lbDown", scope: !136, file: !2, line: 74, baseType: !11, size: 8, align: 8, offset: 872)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_rbDown", scope: !136, file: !2, line: 75, baseType: !11, size: 8, align: 8, offset: 880)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_isMouseEntered", scope: !136, file: !2, line: 76, baseType: !11, size: 8, align: 8, offset: 888)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_textable", scope: !136, file: !2, line: 77, baseType: !11, size: 8, align: 8, offset: 896)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_autoSizable", scope: !136, file: !2, line: 78, baseType: !11, size: 8, align: 8, offset: 904)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_cmenuUsed", scope: !136, file: !2, line: 79, baseType: !11, size: 8, align: 8, offset: 912)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_bkBrush", scope: !136, file: !2, line: 80, baseType: !257, size: 64, align: 64, offset: 960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_wideText", scope: !136, file: !2, line: 81, baseType: !113, size: 64, align: 64, offset: 1024)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_wtext", scope: !136, file: !2, line: 82, baseType: !283, size: 64, align: 64, offset: 1088)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "WideString*", baseType: !284, size: 64, align: 64, dwarfAddressSpace: 0)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "WideString", scope: !2, file: !2, line: 6, size: 256, align: 64, elements: !285, identifier: "cforms.WideString")
!285 = !{!286, !289, !290, !291}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !284, file: !2, line: 7, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "WString", scope: !2, file: !2, line: 23, baseType: !288, align: 8)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ushort*", baseType: !115, size: 64, align: 64, dwarfAddressSpace: 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_inpLen", scope: !284, file: !2, line: 8, baseType: !62, size: 32, align: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_wcLen", scope: !284, file: !2, line: 9, baseType: !62, size: 32, align: 32, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_inpStr", scope: !284, file: !2, line: 10, baseType: !37, size: 128, align: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !136, file: !2, line: 83, baseType: !58, size: 320, align: 64, offset: 1152)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_parent", scope: !136, file: !2, line: 84, baseType: !132, size: 64, align: 64, offset: 1472)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "onGotFocus", scope: !136, file: !2, line: 86, baseType: !262, size: 64, align: 64, offset: 1536)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "onLostFocus", scope: !136, file: !2, line: 87, baseType: !262, size: 64, align: 64, offset: 1600)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "onClick", scope: !136, file: !2, line: 88, baseType: !262, size: 64, align: 64, offset: 1664)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "onRightClick", scope: !136, file: !2, line: 89, baseType: !262, size: 64, align: 64, offset: 1728)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseEnter", scope: !136, file: !2, line: 90, baseType: !262, size: 64, align: 64, offset: 1792)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseLeave", scope: !136, file: !2, line: 91, baseType: !262, size: 64, align: 64, offset: 1856)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseDown", scope: !136, file: !2, line: 92, baseType: !301, size: 64, align: 64, offset: 1920)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "MouseEventHandler", scope: !2, file: !2, line: 5, baseType: !302, align: 8)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MouseEventHandler", baseType: !303, size: 64, align: 64, dwarfAddressSpace: 0)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !178, !305}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MouseEventArgs*", baseType: !306, size: 64, align: 64, dwarfAddressSpace: 0)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "MouseEventArgs", scope: !2, file: !2, line: 28, size: 192, align: 32, elements: !307, identifier: "cforms.MouseEventArgs")
!307 = !{!308, !309, !317, !318, !319, !320, !321}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "eventArgs", scope: !306, file: !2, line: 30, baseType: !236, size: 8, align: 8)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !306, file: !2, line: 31, baseType: !310, size: 32, align: 32, offset: 32)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MouseButton", scope: !306, file: !2, line: 113, baseType: !62, size: 32, align: 32, elements: !311)
!311 = !{!189, !312, !313, !314, !315, !316}
!312 = !DIEnumerator(name: "RIGHT", value: 1)
!313 = !DIEnumerator(name: "MIDDLE", value: 2)
!314 = !DIEnumerator(name: "LEFT", value: 3)
!315 = !DIEnumerator(name: "XBUTTON1", value: 4)
!316 = !DIEnumerator(name: "XBUTTON2", value: 5)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "isShiftPressed", scope: !306, file: !2, line: 32, baseType: !11, size: 8, align: 8, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "isCtrlPressed", scope: !306, file: !2, line: 33, baseType: !11, size: 8, align: 8, offset: 72)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !306, file: !2, line: 34, baseType: !62, size: 32, align: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !306, file: !2, line: 35, baseType: !62, size: 32, align: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !306, file: !2, line: 36, baseType: !62, size: 32, align: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseUp", scope: !136, file: !2, line: 93, baseType: !301, size: 64, align: 64, offset: 1984)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseDown", scope: !136, file: !2, line: 94, baseType: !301, size: 64, align: 64, offset: 2048)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "onRightMouseUp", scope: !136, file: !2, line: 95, baseType: !301, size: 64, align: 64, offset: 2112)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseWheel", scope: !136, file: !2, line: 96, baseType: !301, size: 64, align: 64, offset: 2176)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "onMouseMove", scope: !136, file: !2, line: 97, baseType: !301, size: 64, align: 64, offset: 2240)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "onKeyDown", scope: !136, file: !2, line: 98, baseType: !328, size: 64, align: 64, offset: 2304)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "KeyEventHandler", scope: !2, file: !2, line: 7, baseType: !329, align: 8)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "KeyEventHandler", baseType: !330, size: 64, align: 64, dwarfAddressSpace: 0)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !178, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "KeyEventArgs*", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyEventArgs", scope: !2, file: !2, line: 47, size: 160, align: 32, elements: !334, identifier: "cforms.KeyEventArgs")
!334 = !{!335, !336, !508, !509, !510, !511, !512, !513}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "eventArgs", scope: !333, file: !2, line: 49, baseType: !236, size: 8, align: 8)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "keyCode", scope: !333, file: !2, line: 50, baseType: !337, size: 32, align: 32, offset: 32)
!337 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Keys", scope: !333, file: !2, line: 165, baseType: !62, size: 32, align: 32, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!339 = !DIEnumerator(name: "MODIFIER", value: 0)
!340 = !DIEnumerator(name: "NOKEY", value: 1)
!341 = !DIEnumerator(name: "LBUTTON", value: 2)
!342 = !DIEnumerator(name: "RBUTTON", value: 3)
!343 = !DIEnumerator(name: "CANCEL", value: 4)
!344 = !DIEnumerator(name: "MBUTTON", value: 5)
!345 = !DIEnumerator(name: "XBUTTO1", value: 6)
!346 = !DIEnumerator(name: "XBUTTON2", value: 7)
!347 = !DIEnumerator(name: "BACK_SPACE", value: 8)
!348 = !DIEnumerator(name: "TAB", value: 9)
!349 = !DIEnumerator(name: "LINE_FEED", value: 10)
!350 = !DIEnumerator(name: "CLEAR", value: 11)
!351 = !DIEnumerator(name: "ENTER", value: 12)
!352 = !DIEnumerator(name: "SHIFT", value: 13)
!353 = !DIEnumerator(name: "CTRL", value: 14)
!354 = !DIEnumerator(name: "ALT", value: 15)
!355 = !DIEnumerator(name: "PAUSE", value: 16)
!356 = !DIEnumerator(name: "CAPS_LOCK", value: 17)
!357 = !DIEnumerator(name: "ESCAPE", value: 18)
!358 = !DIEnumerator(name: "SPACE", value: 19)
!359 = !DIEnumerator(name: "PAGE_UP", value: 20)
!360 = !DIEnumerator(name: "PAGE_DOWN", value: 21)
!361 = !DIEnumerator(name: "END", value: 22)
!362 = !DIEnumerator(name: "HOME", value: 23)
!363 = !DIEnumerator(name: "LEFTA_RROW", value: 24)
!364 = !DIEnumerator(name: "UP_ARROW", value: 25)
!365 = !DIEnumerator(name: "RIGHT_ARROW", value: 26)
!366 = !DIEnumerator(name: "DOWN_ARROW", value: 27)
!367 = !DIEnumerator(name: "SELECT", value: 28)
!368 = !DIEnumerator(name: "PRINT", value: 29)
!369 = !DIEnumerator(name: "EXECUTE", value: 30)
!370 = !DIEnumerator(name: "PRINT_SCREEN", value: 31)
!371 = !DIEnumerator(name: "INSERT", value: 32)
!372 = !DIEnumerator(name: "DEL", value: 33)
!373 = !DIEnumerator(name: "HELP", value: 34)
!374 = !DIEnumerator(name: "D0", value: 35)
!375 = !DIEnumerator(name: "D1", value: 36)
!376 = !DIEnumerator(name: "D2", value: 37)
!377 = !DIEnumerator(name: "D3", value: 38)
!378 = !DIEnumerator(name: "D4", value: 39)
!379 = !DIEnumerator(name: "D5", value: 40)
!380 = !DIEnumerator(name: "D6", value: 41)
!381 = !DIEnumerator(name: "D7", value: 42)
!382 = !DIEnumerator(name: "D8", value: 43)
!383 = !DIEnumerator(name: "D9", value: 44)
!384 = !DIEnumerator(name: "A", value: 45)
!385 = !DIEnumerator(name: "B", value: 46)
!386 = !DIEnumerator(name: "C", value: 47)
!387 = !DIEnumerator(name: "D", value: 48)
!388 = !DIEnumerator(name: "E", value: 49)
!389 = !DIEnumerator(name: "F", value: 50)
!390 = !DIEnumerator(name: "G", value: 51)
!391 = !DIEnumerator(name: "H", value: 52)
!392 = !DIEnumerator(name: "I", value: 53)
!393 = !DIEnumerator(name: "J", value: 54)
!394 = !DIEnumerator(name: "K", value: 55)
!395 = !DIEnumerator(name: "L", value: 56)
!396 = !DIEnumerator(name: "M", value: 57)
!397 = !DIEnumerator(name: "N", value: 58)
!398 = !DIEnumerator(name: "O", value: 59)
!399 = !DIEnumerator(name: "P", value: 60)
!400 = !DIEnumerator(name: "Q", value: 61)
!401 = !DIEnumerator(name: "R", value: 62)
!402 = !DIEnumerator(name: "S", value: 63)
!403 = !DIEnumerator(name: "T", value: 64)
!404 = !DIEnumerator(name: "U", value: 65)
!405 = !DIEnumerator(name: "V", value: 66)
!406 = !DIEnumerator(name: "W", value: 67)
!407 = !DIEnumerator(name: "X", value: 68)
!408 = !DIEnumerator(name: "Y", value: 69)
!409 = !DIEnumerator(name: "Z", value: 70)
!410 = !DIEnumerator(name: "LEFT_WIN", value: 71)
!411 = !DIEnumerator(name: "RIGH_TWIN", value: 72)
!412 = !DIEnumerator(name: "APPS", value: 73)
!413 = !DIEnumerator(name: "SLEEP", value: 74)
!414 = !DIEnumerator(name: "NUM_PAD0", value: 75)
!415 = !DIEnumerator(name: "NUM_PAD1", value: 76)
!416 = !DIEnumerator(name: "NUM_PAD2", value: 77)
!417 = !DIEnumerator(name: "NUM_PAD3", value: 78)
!418 = !DIEnumerator(name: "NUM_PAD4", value: 79)
!419 = !DIEnumerator(name: "NUM_PAD5", value: 80)
!420 = !DIEnumerator(name: "NUM_PAD6", value: 81)
!421 = !DIEnumerator(name: "NUM_PAD7", value: 82)
!422 = !DIEnumerator(name: "NUM_PAD8", value: 83)
!423 = !DIEnumerator(name: "NUM_PAD9", value: 84)
!424 = !DIEnumerator(name: "MULTIPLY", value: 85)
!425 = !DIEnumerator(name: "ADD", value: 86)
!426 = !DIEnumerator(name: "SEPERATOR", value: 87)
!427 = !DIEnumerator(name: "SUBTRACT", value: 88)
!428 = !DIEnumerator(name: "DECIMAL", value: 89)
!429 = !DIEnumerator(name: "DIVIDE", value: 90)
!430 = !DIEnumerator(name: "F1", value: 91)
!431 = !DIEnumerator(name: "F2", value: 92)
!432 = !DIEnumerator(name: "F3", value: 93)
!433 = !DIEnumerator(name: "F4", value: 94)
!434 = !DIEnumerator(name: "F5", value: 95)
!435 = !DIEnumerator(name: "F6", value: 96)
!436 = !DIEnumerator(name: "F7", value: 97)
!437 = !DIEnumerator(name: "F8", value: 98)
!438 = !DIEnumerator(name: "F9", value: 99)
!439 = !DIEnumerator(name: "F10", value: 100)
!440 = !DIEnumerator(name: "F11", value: 101)
!441 = !DIEnumerator(name: "F12", value: 102)
!442 = !DIEnumerator(name: "F13", value: 103)
!443 = !DIEnumerator(name: "F14", value: 104)
!444 = !DIEnumerator(name: "F15", value: 105)
!445 = !DIEnumerator(name: "F16", value: 106)
!446 = !DIEnumerator(name: "F17", value: 107)
!447 = !DIEnumerator(name: "F18", value: 108)
!448 = !DIEnumerator(name: "F19", value: 109)
!449 = !DIEnumerator(name: "F20", value: 110)
!450 = !DIEnumerator(name: "F21", value: 111)
!451 = !DIEnumerator(name: "F22", value: 112)
!452 = !DIEnumerator(name: "F23", value: 113)
!453 = !DIEnumerator(name: "F24", value: 114)
!454 = !DIEnumerator(name: "NUM_LOCK", value: 115)
!455 = !DIEnumerator(name: "SCROLL", value: 116)
!456 = !DIEnumerator(name: "LEFT_SHIFT", value: 117)
!457 = !DIEnumerator(name: "RIGHT_SHIFT", value: 118)
!458 = !DIEnumerator(name: "LEFT_CTRL", value: 119)
!459 = !DIEnumerator(name: "RIGHT_CTRL", value: 120)
!460 = !DIEnumerator(name: "LEFT_MENU", value: 121)
!461 = !DIEnumerator(name: "RIGHT_MENU", value: 122)
!462 = !DIEnumerator(name: "BROWSER_BACK", value: 123)
!463 = !DIEnumerator(name: "BROWSER_FORWARD", value: 124)
!464 = !DIEnumerator(name: "BROWER_REFRESH", value: 125)
!465 = !DIEnumerator(name: "BROWSER_STOP", value: 126)
!466 = !DIEnumerator(name: "BROWSER_SEARCH", value: 127)
!467 = !DIEnumerator(name: "BROWSER_FAVORITES", value: 128)
!468 = !DIEnumerator(name: "BROWSER_HOME", value: 129)
!469 = !DIEnumerator(name: "VOLUME_MUTE", value: 130)
!470 = !DIEnumerator(name: "VOLUME_DOWN", value: 131)
!471 = !DIEnumerator(name: "VOLUME_UP", value: 132)
!472 = !DIEnumerator(name: "MEDIA_NEXT_TRACK", value: 133)
!473 = !DIEnumerator(name: "MEDIA_PRE_VTRACK", value: 134)
!474 = !DIEnumerator(name: "MEDIA_STOP", value: 135)
!475 = !DIEnumerator(name: "MEDIA_PLAY_PAUSE", value: 136)
!476 = !DIEnumerator(name: "LAUNCH_MAIL", value: 137)
!477 = !DIEnumerator(name: "SELECT_MEDIA", value: 138)
!478 = !DIEnumerator(name: "LAUNCH_APP1", value: 139)
!479 = !DIEnumerator(name: "LAUNCH_APP2", value: 140)
!480 = !DIEnumerator(name: "OEM1", value: 141)
!481 = !DIEnumerator(name: "OEM_PLUS", value: 142)
!482 = !DIEnumerator(name: "OEM_COMMA", value: 143)
!483 = !DIEnumerator(name: "OEM_MINUS", value: 144)
!484 = !DIEnumerator(name: "OEM_PERIOD", value: 145)
!485 = !DIEnumerator(name: "OEM_QUESTION", value: 146)
!486 = !DIEnumerator(name: "OEM_TILDE", value: 147)
!487 = !DIEnumerator(name: "OEM_OPEN_BRACKET", value: 148)
!488 = !DIEnumerator(name: "OEM_PIPE", value: 149)
!489 = !DIEnumerator(name: "OEM_CLOSE_BRACKET", value: 150)
!490 = !DIEnumerator(name: "OEM_QUOTES", value: 151)
!491 = !DIEnumerator(name: "OEM8", value: 152)
!492 = !DIEnumerator(name: "OEM_BACK_SLASH", value: 153)
!493 = !DIEnumerator(name: "PROCESS", value: 154)
!494 = !DIEnumerator(name: "PACKET", value: 155)
!495 = !DIEnumerator(name: "ATTN", value: 156)
!496 = !DIEnumerator(name: "CRSEL", value: 157)
!497 = !DIEnumerator(name: "EXSEL", value: 158)
!498 = !DIEnumerator(name: "ERASE_EOF", value: 159)
!499 = !DIEnumerator(name: "PLAY", value: 160)
!500 = !DIEnumerator(name: "ZOOM", value: 161)
!501 = !DIEnumerator(name: "NONAME", value: 162)
!502 = !DIEnumerator(name: "PA1", value: 163)
!503 = !DIEnumerator(name: "OEM_CLEAR", value: 164)
!504 = !DIEnumerator(name: "KEY_CODE", value: 165)
!505 = !DIEnumerator(name: "SHIFT_MODIFIER", value: 166)
!506 = !DIEnumerator(name: "CTRL_MODIFIER", value: 167)
!507 = !DIEnumerator(name: "ALT_MODIFIER", value: 168)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !333, file: !2, line: 51, baseType: !337, size: 32, align: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "keyValue", scope: !333, file: !2, line: 52, baseType: !62, size: 32, align: 32, offset: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "altPressed", scope: !333, file: !2, line: 53, baseType: !11, size: 8, align: 8, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ctrlPressed", scope: !333, file: !2, line: 54, baseType: !11, size: 8, align: 8, offset: 136)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "shiftPressed", scope: !333, file: !2, line: 55, baseType: !11, size: 8, align: 8, offset: 144)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "supressKey", scope: !333, file: !2, line: 56, baseType: !11, size: 8, align: 8, offset: 152)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "onKeyUp", scope: !136, file: !2, line: 99, baseType: !328, size: 64, align: 64, offset: 2368)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "onKeyPress", scope: !136, file: !2, line: 100, baseType: !328, size: 64, align: 64, offset: 2432)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "formPos", scope: !133, file: !2, line: 72, baseType: !517, size: 32, align: 32, offset: 2496)
!517 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormPos", scope: !133, file: !2, line: 58, baseType: !62, size: 32, align: 32, elements: !518)
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!519 = !DIEnumerator(name: "CENTER", value: 0)
!520 = !DIEnumerator(name: "TOP_LEFT", value: 1)
!521 = !DIEnumerator(name: "TOP_MID", value: 2)
!522 = !DIEnumerator(name: "TOP_RIGHT", value: 3)
!523 = !DIEnumerator(name: "MID_LEFT", value: 4)
!524 = !DIEnumerator(name: "MID_RIGHT", value: 5)
!525 = !DIEnumerator(name: "BOTTOM_LEFT", value: 6)
!526 = !DIEnumerator(name: "BOTTOM_MID", value: 7)
!527 = !DIEnumerator(name: "BOTTOM_RIGHT", value: 8)
!528 = !DIEnumerator(name: "MANUAL", value: 9)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "formStyle", scope: !133, file: !2, line: 73, baseType: !530, size: 32, align: 32, offset: 2528)
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormStyle", scope: !133, file: !2, line: 72, baseType: !62, size: 32, align: 32, elements: !531)
!531 = !{!189, !532, !533, !534, !535, !536, !537, !538}
!532 = !DIEnumerator(name: "FIXED_SINGLE", value: 1)
!533 = !DIEnumerator(name: "FIXED_3D", value: 2)
!534 = !DIEnumerator(name: "FIXED_DIALOG", value: 3)
!535 = !DIEnumerator(name: "NORMAL_WINDOW", value: 4)
!536 = !DIEnumerator(name: "FIXED_TOOL", value: 5)
!537 = !DIEnumerator(name: "SIZABLE_TOOL", value: 6)
!538 = !DIEnumerator(name: "HIDDEN", value: 7)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "formState", scope: !133, file: !2, line: 74, baseType: !540, size: 32, align: 32, offset: 2560)
!540 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormState", scope: !133, file: !2, line: 84, baseType: !62, size: 32, align: 32, elements: !541)
!541 = !{!542, !543, !544}
!542 = !DIEnumerator(name: "NORMAL", value: 0)
!543 = !DIEnumerator(name: "MAXIMIZED", value: 1)
!544 = !DIEnumerator(name: "MINIMIZED", value: 2)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_fDrawMode", scope: !133, file: !2, line: 75, baseType: !546, size: 32, align: 32, offset: 2592)
!546 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FormDrawMode", scope: !133, file: !2, line: 90, baseType: !62, size: 32, align: 32, elements: !547)
!547 = !{!548, !549, !550}
!548 = !DIEnumerator(name: "DEFAULT", value: 0)
!549 = !DIEnumerator(name: "FLAT_COLOR", value: 1)
!550 = !DIEnumerator(name: "GRADIENT", value: 2)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "topMost", scope: !133, file: !2, line: 76, baseType: !11, size: 8, align: 8, offset: 2624)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "createChilds", scope: !133, file: !2, line: 77, baseType: !11, size: 8, align: 8, offset: 2632)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "maximizeBox", scope: !133, file: !2, line: 78, baseType: !11, size: 8, align: 8, offset: 2640)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "minimizeBox", scope: !133, file: !2, line: 79, baseType: !11, size: 8, align: 8, offset: 2648)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_isLoaded", scope: !133, file: !2, line: 80, baseType: !11, size: 8, align: 8, offset: 2656)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_isMainWindow", scope: !133, file: !2, line: 81, baseType: !11, size: 8, align: 8, offset: 2664)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_isMouseTracking", scope: !133, file: !2, line: 82, baseType: !11, size: 8, align: 8, offset: 2672)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_isSizing", scope: !133, file: !2, line: 83, baseType: !11, size: 8, align: 8, offset: 2680)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_menuMapInited", scope: !133, file: !2, line: 84, baseType: !11, size: 8, align: 8, offset: 2688)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_menubarCreated", scope: !133, file: !2, line: 85, baseType: !11, size: 8, align: 8, offset: 2696)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_formID", scope: !133, file: !2, line: 86, baseType: !62, size: 32, align: 32, offset: 2720)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_comboList", scope: !133, file: !2, line: 87, baseType: !563, size: 320, align: 64, offset: 2752)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "CmbList", scope: !2, file: !2, line: 65, baseType: !564, align: 8)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !565, identifier: "std_collections_list$cforms.ComboInfo$.List")
!565 = !{!566, !567, !568, !569}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !564, file: !2, line: 20, baseType: !44, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !564, file: !2, line: 21, baseType: !44, size: 64, align: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !564, file: !2, line: 22, baseType: !16, size: 128, align: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !564, file: !2, line: 23, baseType: !570, size: 64, align: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !571, size: 64, align: 64, dwarfAddressSpace: 0)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 65, baseType: !572, align: 8)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComboInfo", scope: !2, file: !2, line: 61, size: 128, align: 64, elements: !573, identifier: "cforms.ComboInfo")
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "listHwnd", scope: !572, file: !2, line: 61, baseType: !94, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "cmbHwnd", scope: !572, file: !2, line: 61, baseType: !94, size: 64, align: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_menuItemList", scope: !133, file: !2, line: 88, baseType: !577, size: 320, align: 64, offset: 3072)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "MenuItems", scope: !2, file: !2, line: 66, baseType: !578, align: 8)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !579, identifier: "std_collections_list$cforms.MenuInfo$.List")
!579 = !{!580, !581, !582, !583}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !578, file: !2, line: 20, baseType: !44, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !578, file: !2, line: 21, baseType: !44, size: 64, align: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !578, file: !2, line: 22, baseType: !16, size: 128, align: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !578, file: !2, line: 23, baseType: !584, size: 64, align: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !585, size: 64, align: 64, dwarfAddressSpace: 0)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 66, baseType: !586, align: 8)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuInfo", scope: !2, file: !2, line: 62, size: 128, align: 64, elements: !587, identifier: "cforms.MenuInfo")
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "menuID", scope: !586, file: !2, line: 62, baseType: !3, size: 32, align: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pMenuItem", scope: !586, file: !2, line: 62, baseType: !48, size: 64, align: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "controls", scope: !133, file: !2, line: 89, baseType: !591, size: 320, align: 64, offset: 3392)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "ControlList", scope: !2, file: !2, line: 56, baseType: !592, align: 8)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !593, identifier: "std_collections_list$p$cforms.Control$.List")
!593 = !{!594, !595, !596, !597}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !592, file: !2, line: 20, baseType: !44, size: 64, align: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !592, file: !2, line: 21, baseType: !44, size: 64, align: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !592, file: !2, line: 22, baseType: !16, size: 128, align: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !592, file: !2, line: 23, baseType: !598, size: 64, align: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !599, size: 64, align: 64, dwarfAddressSpace: 0)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 56, baseType: !178, align: 8)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_timerList", scope: !133, file: !2, line: 90, baseType: !601, size: 320, align: 64, offset: 3712)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerList", scope: !2, file: !2, line: 64, baseType: !602, align: 8)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !603, identifier: "std_collections_list$cforms.TimerInfo$.List")
!603 = !{!604, !605, !606, !607}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !602, file: !2, line: 20, baseType: !44, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !602, file: !2, line: 21, baseType: !44, size: 64, align: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !602, file: !2, line: 22, baseType: !16, size: 128, align: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !602, file: !2, line: 23, baseType: !608, size: 64, align: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !609, size: 64, align: 64, dwarfAddressSpace: 0)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 64, baseType: !610, align: 8)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "TimerInfo", scope: !2, file: !2, line: 60, size: 128, align: 64, elements: !611, identifier: "cforms.TimerInfo")
!611 = !{!612, !614}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "timerID", scope: !610, file: !2, line: 60, baseType: !613, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uintptr", scope: !2, file: !2, line: 31, baseType: !45, align: 8)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "pTimer", scope: !610, file: !2, line: 60, baseType: !615, size: 64, align: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Timer*", baseType: !616, size: 64, align: 64, dwarfAddressSpace: 0)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timer", scope: !2, file: !2, line: 20, size: 320, align: 64, elements: !617, identifier: "cforms.Timer")
!617 = !{!618, !619, !620, !621, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !616, file: !2, line: 22, baseType: !3, size: 32, align: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "onTick", scope: !616, file: !2, line: 23, baseType: !262, size: 64, align: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_idNum", scope: !616, file: !2, line: 24, baseType: !613, size: 64, align: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_parentHwnd", scope: !616, file: !2, line: 25, baseType: !94, size: 64, align: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_isEnabled", scope: !616, file: !2, line: 26, baseType: !11, size: 8, align: 8, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "hinst", scope: !133, file: !2, line: 91, baseType: !624, size: 64, align: 64, offset: 4032)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hinstance", scope: !2, file: !2, line: 15, baseType: !56, align: 8)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "menubar", scope: !133, file: !2, line: 92, baseType: !126, size: 64, align: 64, offset: 4096)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_menuFont", scope: !133, file: !2, line: 93, baseType: !58, size: 320, align: 64, offset: 4160)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayBrush", scope: !133, file: !2, line: 94, baseType: !257, size: 64, align: 64, offset: 4480)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_menuDefBgBrush", scope: !133, file: !2, line: 95, baseType: !257, size: 64, align: 64, offset: 4544)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_menuHotBgBrush", scope: !133, file: !2, line: 96, baseType: !257, size: 64, align: 64, offset: 4608)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_menuFrameBrush", scope: !133, file: !2, line: 97, baseType: !257, size: 64, align: 64, offset: 4672)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayCref", scope: !133, file: !2, line: 98, baseType: !100, size: 32, align: 32, offset: 4736)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "onLoad", scope: !133, file: !2, line: 101, baseType: !262, size: 64, align: 64, offset: 4800)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "onActivate", scope: !133, file: !2, line: 102, baseType: !262, size: 64, align: 64, offset: 4864)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "onDeActivate", scope: !133, file: !2, line: 103, baseType: !262, size: 64, align: 64, offset: 4928)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "onMoving", scope: !133, file: !2, line: 104, baseType: !262, size: 64, align: 64, offset: 4992)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "onMoved", scope: !133, file: !2, line: 105, baseType: !262, size: 64, align: 64, offset: 5056)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "onMinimized", scope: !133, file: !2, line: 106, baseType: !262, size: 64, align: 64, offset: 5120)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "onMaximized", scope: !133, file: !2, line: 107, baseType: !262, size: 64, align: 64, offset: 5184)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "onRestored", scope: !133, file: !2, line: 108, baseType: !262, size: 64, align: 64, offset: 5248)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "onClosing", scope: !133, file: !2, line: 109, baseType: !262, size: 64, align: 64, offset: 5312)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "onClosed", scope: !133, file: !2, line: 110, baseType: !262, size: 64, align: 64, offset: 5376)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "onSizing", scope: !133, file: !2, line: 113, baseType: !643, size: 64, align: 64, offset: 5440)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "SizeEventHandler", scope: !2, file: !2, line: 6, baseType: !644, align: 8)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SizeEventHandler", baseType: !645, size: 64, align: 64, dwarfAddressSpace: 0)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !178, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SizeEventArgs*", baseType: !648, size: 64, align: 64, dwarfAddressSpace: 0)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "SizeEventArgs", scope: !2, file: !2, line: 39, size: 256, align: 32, elements: !649, identifier: "cforms.SizeEventArgs")
!649 = !{!650, !651, !659, !670}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "eventArgs", scope: !648, file: !2, line: 41, baseType: !236, size: 8, align: 8)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "formRect", scope: !648, file: !2, line: 42, baseType: !652, size: 128, align: 32, offset: 32)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rect", scope: !648, file: !2, line: 62, size: 128, align: 32, elements: !653, identifier: "cforms.Rect")
!653 = !{!654, !656, !657, !658}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !652, file: !2, line: 63, baseType: !655, size: 32, align: 32)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "Long", scope: !2, file: !2, line: 24, baseType: !62, align: 4)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !652, file: !2, line: 64, baseType: !655, size: 32, align: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !652, file: !2, line: 65, baseType: !655, size: 32, align: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !652, file: !2, line: 66, baseType: !655, size: 32, align: 32, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sizedOn", scope: !648, file: !2, line: 43, baseType: !660, size: 32, align: 32, offset: 160)
!660 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SizedPosition", scope: !648, file: !2, line: 123, baseType: !62, size: 32, align: 32, elements: !661)
!661 = !{!189, !662, !663, !664, !665, !666, !667, !668, !669}
!662 = !DIEnumerator(name: "LEFTEDGE", value: 1)
!663 = !DIEnumerator(name: "RIGHTEDGE", value: 2)
!664 = !DIEnumerator(name: "TOPEDGE", value: 3)
!665 = !DIEnumerator(name: "TOPLEFTCORNER", value: 4)
!666 = !DIEnumerator(name: "TOPRIGHTCORNER", value: 5)
!667 = !DIEnumerator(name: "BOTTOMEDGE", value: 6)
!668 = !DIEnumerator(name: "BOTTOMLEFTCORNER", value: 7)
!669 = !DIEnumerator(name: "BOTTOMRIGHTCORNER", value: 8)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "clientArea", scope: !648, file: !2, line: 44, baseType: !671, size: 64, align: 32, offset: 192)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "Area", scope: !648, file: !2, line: 17, size: 64, align: 32, elements: !672, identifier: "cforms.Area")
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !671, file: !2, line: 19, baseType: !62, size: 32, align: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !671, file: !2, line: 20, baseType: !62, size: 32, align: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "onSized", scope: !133, file: !2, line: 114, baseType: !643, size: 64, align: 64, offset: 5504)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "onThreadMsg", scope: !133, file: !2, line: 115, baseType: !677, size: 64, align: 64, offset: 5568)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadMsgHandler", scope: !2, file: !2, line: 9, baseType: !678, align: 8)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ThreadMsgHandler", baseType: !679, size: 64, align: 64, dwarfAddressSpace: 0)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !45, !171}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayCref", scope: !127, file: !2, line: 103, baseType: !100, size: 32, align: 32, offset: 896)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_menuDefBgBrush", scope: !127, file: !2, line: 104, baseType: !257, size: 64, align: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_menuHotBgBrush", scope: !127, file: !2, line: 105, baseType: !257, size: 64, align: 64, offset: 1024)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_menuFrameBrush", scope: !127, file: !2, line: 106, baseType: !257, size: 64, align: 64, offset: 1088)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_menuGrayBrush", scope: !127, file: !2, line: 107, baseType: !257, size: 64, align: 64, offset: 1152)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "onClick", scope: !49, file: !2, line: 136, baseType: !687, size: 64, align: 64, offset: 1664)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "MenuEventHandler", scope: !2, file: !2, line: 11, baseType: !688, align: 8)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MenuEventHandler", baseType: !689, size: 64, align: 64, dwarfAddressSpace: 0)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !48, !235}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "onPopup", scope: !49, file: !2, line: 137, baseType: !687, size: 64, align: 64, offset: 1728)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "onCloseup", scope: !49, file: !2, line: 138, baseType: !687, size: 64, align: 64, offset: 1792)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "onFocus", scope: !49, file: !2, line: 139, baseType: !687, size: 64, align: 64, offset: 1856)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !32, file: !2, line: 26, baseType: !31, size: 64, align: 64, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !27, baseType: !44, size: 64, align: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !24, file: !2, line: 32, baseType: !16, size: 128, align: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !24, file: !2, line: 33, baseType: !3, size: 32, align: 32, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !24, file: !2, line: 34, baseType: !3, size: 32, align: 32, offset: 288)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !24, file: !2, line: 35, baseType: !8, size: 32, align: 32, offset: 320)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "dummy", linkageName: "std_collections_map$String$p$cforms.MenuItem$.dummy.29147", scope: !2, file: !2, line: 592, type: !62, isLocal: true, isDefinition: true, align: 4)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "LINKEDONHEAP", linkageName: "std_collections_map$String$p$cforms.MenuItem$.LINKEDONHEAP", scope: !704, file: !704, line: 11, type: !705, isLocal: false, isDefinition: true, align: 8)
!704 = !DIFile(filename: "linked_hashmap.c3", directory: "C:/Compilers/C3/lib/std/collections")
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkedHashMap", scope: !704, file: !704, line: 23, size: 576, align: 64, elements: !706, identifier: "std_collections_map$String$p$cforms.MenuItem$.LinkedHashMap")
!706 = !{!707, !722, !723, !724, !725, !726, !727}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !705, file: !704, line: 25, baseType: !708, size: 128, align: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkedEntry*[]", size: 128, align: 64, elements: !709, identifier: "LinkedEntry*[]")
!709 = !{!710, !721}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !708, baseType: !711, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "LinkedEntry**", baseType: !712, size: 64, align: 64, dwarfAddressSpace: 0)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "LinkedEntry*", baseType: !713, size: 64, align: 64, dwarfAddressSpace: 0)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkedEntry", scope: !704, file: !704, line: 13, size: 448, align: 64, elements: !714, identifier: "std_collections_map$String$p$cforms.MenuItem$.LinkedEntry")
!714 = !{!715, !716, !717, !718, !719, !720}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !713, file: !704, line: 15, baseType: !3, size: 32, align: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !713, file: !704, line: 16, baseType: !36, size: 128, align: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !713, file: !704, line: 17, baseType: !47, size: 64, align: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !713, file: !704, line: 18, baseType: !712, size: 64, align: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !713, file: !704, line: 19, baseType: !712, size: 64, align: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !713, file: !704, line: 20, baseType: !712, size: 64, align: 64, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !708, baseType: !44, size: 64, align: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !705, file: !704, line: 26, baseType: !16, size: 128, align: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !705, file: !704, line: 27, baseType: !44, size: 64, align: 64, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !705, file: !704, line: 28, baseType: !44, size: 64, align: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !705, file: !704, line: 29, baseType: !8, size: 32, align: 32, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !705, file: !704, line: 30, baseType: !712, size: 64, align: 64, offset: 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !705, file: !704, line: 31, baseType: !712, size: 64, align: 64, offset: 512)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "dummy", linkageName: "std_collections_map$String$p$cforms.MenuItem$.dummy.29380", scope: !704, file: !704, line: 645, type: !62, isLocal: true, isDefinition: true, align: 4)
!730 = !{i32 1, !"CodeView", i32 1}
!731 = !{i32 2, !"Debug Info Version", i32 3}
!732 = !{i32 2, !"wchar_size", i32 2}
!733 = !{i32 4, !"PIC Level", i32 2}
!734 = !{i32 1, !"uwtable", i32 2}
!735 = !{i32 1, !"MaxTLSAlign", i32 65536}
!736 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !737, globals: !738, splitDebugInlining: false)
!737 = !{!64, !117, !139, !187, !310, !337, !517, !530, !540, !546, !660}
!738 = !{!0, !4, !6, !9, !12, !14, !22, !700, !702, !728}
!739 = distinct !DISubprogram(name: "init", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.init", scope: !2, file: !2, line: 46, type: !740, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!740 = !DISubroutineType(types: !741)
!741 = !{!742, !742, !16, !3, !8}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "HashMap*", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!743 = !{}
!744 = !DILocation(line: 47, scope: !739)
!745 = !DILocalVariable(name: "self", arg: 1, scope: !739, file: !2, line: 46, type: !742)
!746 = !DILocation(line: 46, scope: !739)
!747 = !DILocalVariable(name: "allocator", arg: 2, scope: !739, file: !2, line: 46, type: !16)
!748 = !DILocalVariable(name: "capacity", arg: 3, scope: !739, file: !2, line: 46, type: !3)
!749 = !DILocalVariable(name: "load_factor", arg: 4, scope: !739, file: !2, line: 46, type: !8)
!750 = !DILocation(line: 41, scope: !751)
!751 = distinct !DILexicalBlock(scope: !739, file: !2, line: 47, column: 1)
!752 = !DILocation(line: 42, scope: !751)
!753 = !DILocation(line: 43, scope: !751)
!754 = !DILocation(line: 44, scope: !751)
!755 = !DILocalVariable(name: "y", scope: !756, file: !2, line: 980, type: !3, align: 4)
!756 = distinct !DISubprogram(name: "next_power_of_2", linkageName: "next_power_of_2", scope: !757, file: !757, line: 978, scopeLine: 978, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736, retainedNodes: !743)
!757 = !DIFile(filename: "math.c3", directory: "C:/Compilers/C3/lib/std/math")
!758 = !DILocation(line: 980, scope: !756, inlinedAt: !759)
!759 = !DILocation(line: 48, scope: !739)
!760 = !DILocation(line: 981, scope: !756, inlinedAt: !759)
!761 = !DILocation(line: 981, scope: !762, inlinedAt: !759)
!762 = distinct !DILexicalBlock(scope: !756, file: !757, line: 981, column: 2)
!763 = !DILocation(line: 982, scope: !756, inlinedAt: !759)
!764 = !DILocation(line: 49, scope: !739)
!765 = !DILocation(line: 50, scope: !739)
!766 = !DILocation(line: 51, scope: !739)
!767 = !DILocation(line: 52, scope: !739)
!768 = !DILocation(line: 270, scope: !769, inlinedAt: !771)
!769 = distinct !DISubprogram(name: "new_array_try", linkageName: "new_array_try", scope: !770, file: !770, line: 268, scopeLine: 268, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736)
!770 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Compilers/C3/lib/std/core")
!771 = !DILocation(line: 262, scope: !772, inlinedAt: !767)
!772 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !770, file: !770, line: 260, scopeLine: 260, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736)
!773 = !DILocation(line: 97, scope: !774, inlinedAt: !768)
!774 = distinct !DISubprogram(name: "calloc_try", linkageName: "calloc_try", scope: !770, file: !770, line: 95, scopeLine: 95, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736)
!775 = !DILocation(line: 98, scope: !774, inlinedAt: !768)
!776 = !DILocation(line: 38, scope: !774, inlinedAt: !768)
!777 = !DILocation(line: 975, scope: !778, inlinedAt: !776)
!778 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !757, file: !757, line: 973, scopeLine: 973, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736)
!779 = !DILocation(line: 53, scope: !739)
!780 = distinct !DISubprogram(name: "tinit", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.tinit", scope: !2, file: !2, line: 62, type: !781, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!781 = !DISubroutineType(types: !782)
!782 = !{!742, !742, !3, !8}
!783 = !DILocation(line: 63, scope: !780)
!784 = !DILocalVariable(name: "self", arg: 1, scope: !780, file: !2, line: 62, type: !742)
!785 = !DILocation(line: 62, scope: !780)
!786 = !DILocalVariable(name: "capacity", arg: 2, scope: !780, file: !2, line: 62, type: !3)
!787 = !DILocalVariable(name: "load_factor", arg: 3, scope: !780, file: !2, line: 62, type: !8)
!788 = !DILocation(line: 57, scope: !789)
!789 = distinct !DILexicalBlock(scope: !780, file: !2, line: 63, column: 1)
!790 = !DILocation(line: 58, scope: !789)
!791 = !DILocation(line: 59, scope: !789)
!792 = !DILocation(line: 60, scope: !789)
!793 = !DILocation(line: 64, scope: !780)
!794 = !DILocation(line: 42, scope: !780)
!795 = !DILocation(line: 43, scope: !780)
!796 = distinct !DISubprogram(name: "init_from_keys_and_values", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.init_from_keys_and_values", scope: !2, file: !2, line: 106, type: !797, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!797 = !DISubroutineType(types: !798)
!798 = !{!742, !742, !16, !799, !804, !3, !8}
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !800, identifier: "String[]")
!800 = !{!801, !803}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !799, baseType: !802, size: 64, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !799, baseType: !44, size: 64, align: 64, offset: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "MenuItem*[]", size: 128, align: 64, elements: !805, identifier: "MenuItem*[]")
!805 = !{!806, !808}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !804, baseType: !807, size: 64, align: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MenuItem**", baseType: !48, size: 64, align: 64, dwarfAddressSpace: 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !804, baseType: !44, size: 64, align: 64, offset: 64)
!809 = !DILocation(line: 107, scope: !796)
!810 = !DILocalVariable(name: "self", arg: 1, scope: !796, file: !2, line: 106, type: !742)
!811 = !DILocation(line: 106, scope: !796)
!812 = !DILocalVariable(name: "allocator", arg: 2, scope: !796, file: !2, line: 106, type: !16)
!813 = !DILocalVariable(name: "keys", arg: 3, scope: !796, file: !2, line: 106, type: !814)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key[]", size: 128, align: 64, elements: !815, identifier: "Key[]")
!815 = !{!816, !818}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !814, baseType: !817, size: 64, align: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Key*", baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !814, baseType: !44, size: 64, align: 64, offset: 64)
!819 = !DILocalVariable(name: "values", arg: 4, scope: !796, file: !2, line: 106, type: !820)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value[]", size: 128, align: 64, elements: !821, identifier: "Value[]")
!821 = !{!822, !824}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !820, baseType: !823, size: 64, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Value*", baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !820, baseType: !44, size: 64, align: 64, offset: 64)
!825 = !DILocalVariable(name: "capacity", arg: 5, scope: !796, file: !2, line: 106, type: !3)
!826 = !DILocalVariable(name: "load_factor", arg: 6, scope: !796, file: !2, line: 106, type: !8)
!827 = !DILocation(line: 100, scope: !828)
!828 = distinct !DILexicalBlock(scope: !796, file: !2, line: 107, column: 1)
!829 = !DILocation(line: 101, scope: !828)
!830 = !DILocation(line: 102, scope: !828)
!831 = !DILocation(line: 103, scope: !828)
!832 = !DILocation(line: 104, scope: !828)
!833 = !DILocation(line: 108, scope: !796)
!834 = !DILocation(line: 109, scope: !796)
!835 = !DILocation(line: 42, scope: !796)
!836 = !DILocation(line: 43, scope: !796)
!837 = !DILocalVariable(name: "i", scope: !838, file: !2, line: 110, type: !44, align: 8)
!838 = distinct !DILexicalBlock(scope: !796, file: !2, line: 110, column: 2)
!839 = !DILocation(line: 110, scope: !838)
!840 = !DILocation(line: 112, scope: !841)
!841 = distinct !DILexicalBlock(scope: !838, file: !2, line: 111, column: 2)
!842 = !DILocation(line: 114, scope: !796)
!843 = distinct !DISubprogram(name: "tinit_from_keys_and_values", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.tinit_from_keys_and_values", scope: !2, file: !2, line: 127, type: !844, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!844 = !DISubroutineType(types: !845)
!845 = !{!742, !742, !799, !804, !3, !8}
!846 = !DILocation(line: 128, scope: !843)
!847 = !DILocalVariable(name: "self", arg: 1, scope: !843, file: !2, line: 127, type: !742)
!848 = !DILocation(line: 127, scope: !843)
!849 = !DILocalVariable(name: "keys", arg: 2, scope: !843, file: !2, line: 127, type: !814)
!850 = !DILocalVariable(name: "values", arg: 3, scope: !843, file: !2, line: 127, type: !820)
!851 = !DILocalVariable(name: "capacity", arg: 4, scope: !843, file: !2, line: 127, type: !3)
!852 = !DILocalVariable(name: "load_factor", arg: 5, scope: !843, file: !2, line: 127, type: !8)
!853 = !DILocation(line: 121, scope: !854)
!854 = distinct !DILexicalBlock(scope: !843, file: !2, line: 128, column: 1)
!855 = !DILocation(line: 122, scope: !854)
!856 = !DILocation(line: 123, scope: !854)
!857 = !DILocation(line: 124, scope: !854)
!858 = !DILocation(line: 125, scope: !854)
!859 = !DILocation(line: 129, scope: !843)
!860 = !DILocation(line: 100, scope: !843)
!861 = !DILocation(line: 102, scope: !843)
!862 = !DILocation(line: 103, scope: !843)
!863 = distinct !DISubprogram(name: "is_initialized", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.is_initialized", scope: !2, file: !2, line: 138, type: !864, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!864 = !DISubroutineType(types: !865)
!865 = !{!11, !742}
!866 = !DILocation(line: 139, scope: !863)
!867 = !DILocalVariable(name: "map", arg: 1, scope: !863, file: !2, line: 138, type: !742)
!868 = !DILocation(line: 138, scope: !863)
!869 = !DILocation(line: 140, scope: !863)
!870 = distinct !DISubprogram(name: "init_from_map", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.init_from_map", scope: !2, file: !2, line: 148, type: !871, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!871 = !DISubroutineType(types: !872)
!872 = !{!742, !742, !16, !742}
!873 = !DILocation(line: 149, scope: !870)
!874 = !DILocalVariable(name: "self", arg: 1, scope: !870, file: !2, line: 148, type: !742)
!875 = !DILocation(line: 148, scope: !870)
!876 = !DILocalVariable(name: "allocator", arg: 2, scope: !870, file: !2, line: 148, type: !16)
!877 = !DILocalVariable(name: "other_map", arg: 3, scope: !870, file: !2, line: 148, type: !742)
!878 = !DILocation(line: 146, scope: !879)
!879 = distinct !DILexicalBlock(scope: !870, file: !2, line: 149, column: 1)
!880 = !DILocation(line: 150, scope: !870)
!881 = !DILocation(line: 42, scope: !870)
!882 = !DILocation(line: 43, scope: !870)
!883 = !DILocation(line: 151, scope: !870)
!884 = !DILocation(line: 152, scope: !870)
!885 = distinct !DISubprogram(name: "tinit_from_map", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.tinit_from_map", scope: !2, file: !2, line: 159, type: !886, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!886 = !DISubroutineType(types: !887)
!887 = !{!742, !742, !742}
!888 = !DILocation(line: 160, scope: !885)
!889 = !DILocalVariable(name: "map", arg: 1, scope: !885, file: !2, line: 159, type: !742)
!890 = !DILocation(line: 159, scope: !885)
!891 = !DILocalVariable(name: "other_map", arg: 2, scope: !885, file: !2, line: 159, type: !742)
!892 = !DILocation(line: 157, scope: !893)
!893 = distinct !DILexicalBlock(scope: !885, file: !2, line: 160, column: 1)
!894 = !DILocation(line: 161, scope: !885)
!895 = !DILocation(line: 146, scope: !885)
!896 = distinct !DISubprogram(name: "is_empty", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.is_empty", scope: !2, file: !2, line: 164, type: !864, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!897 = !DILocation(line: 165, scope: !896)
!898 = !DILocalVariable(name: "map", arg: 1, scope: !896, file: !2, line: 164, type: !742)
!899 = !DILocation(line: 164, scope: !896)
!900 = !DILocation(line: 166, scope: !896)
!901 = distinct !DISubprogram(name: "len", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.len", scope: !2, file: !2, line: 169, type: !902, scopeLine: 169, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!902 = !DISubroutineType(types: !903)
!903 = !{!44, !742}
!904 = !DILocation(line: 170, scope: !901)
!905 = !DILocalVariable(name: "map", arg: 1, scope: !901, file: !2, line: 169, type: !742)
!906 = !DILocation(line: 169, scope: !901)
!907 = !DILocation(line: 171, scope: !901)
!908 = distinct !DISubprogram(name: "get_ref", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.get_ref", scope: !2, file: !2, line: 174, type: !909, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!909 = !DISubroutineType(types: !910)
!910 = !{!911, !912, !742, !37}
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !171)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Value**", baseType: !823, size: 64, align: 64, dwarfAddressSpace: 0)
!913 = !DILocation(line: 175, scope: !908)
!914 = !DILocalVariable(name: "map", arg: 1, scope: !908, file: !2, line: 174, type: !742)
!915 = !DILocation(line: 174, scope: !908)
!916 = !DILocalVariable(name: "key", arg: 2, scope: !908, file: !2, line: 174, type: !36)
!917 = !DILocation(line: 176, scope: !908)
!918 = !DILocalVariable(name: "hash", scope: !908, file: !2, line: 177, type: !3, align: 4)
!919 = !DILocation(line: 177, scope: !908)
!920 = !DILocation(line: 568, scope: !921, inlinedAt: !919)
!921 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !922, file: !922, line: 568, scopeLine: 568, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736)
!922 = !DIFile(filename: "builtin.c3", directory: "C:/Compilers/C3/lib/std/core")
!923 = !DILocalVariable(name: "e", scope: !924, file: !2, line: 178, type: !31, align: 8)
!924 = distinct !DILexicalBlock(scope: !908, file: !2, line: 178, column: 2)
!925 = !DILocation(line: 178, scope: !924)
!926 = !DILocation(line: 589, scope: !927, inlinedAt: !925)
!927 = distinct !DISubprogram(name: "index_for", linkageName: "index_for", scope: !2, file: !2, line: 587, scopeLine: 587, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736)
!928 = !DILocation(line: 180, scope: !929)
!929 = distinct !DILexicalBlock(scope: !924, file: !2, line: 179, column: 2)
!930 = !DILocation(line: 93, scope: !931, inlinedAt: !928)
!931 = distinct !DISubprogram(name: "equals", linkageName: "equals", scope: !932, file: !932, line: 83, scopeLine: 83, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736)
!932 = !DIFile(filename: "builtin_comparison.c3", directory: "C:/Compilers/C3/lib/std/core")
!933 = !DILocation(line: 182, scope: !908)
!934 = distinct !DISubprogram(name: "get_entry", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.get_entry", scope: !2, file: !2, line: 185, type: !935, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!935 = !DISubroutineType(types: !936)
!936 = !{!911, !30, !742, !37}
!937 = !DILocation(line: 186, scope: !934)
!938 = !DILocalVariable(name: "map", arg: 1, scope: !934, file: !2, line: 185, type: !742)
!939 = !DILocation(line: 185, scope: !934)
!940 = !DILocalVariable(name: "key", arg: 2, scope: !934, file: !2, line: 185, type: !36)
!941 = !DILocation(line: 187, scope: !934)
!942 = !DILocalVariable(name: "hash", scope: !934, file: !2, line: 188, type: !3, align: 4)
!943 = !DILocation(line: 188, scope: !934)
!944 = !DILocation(line: 568, scope: !945, inlinedAt: !943)
!945 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !922, file: !922, line: 568, scopeLine: 568, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736)
!946 = !DILocalVariable(name: "e", scope: !947, file: !2, line: 189, type: !31, align: 8)
!947 = distinct !DILexicalBlock(scope: !934, file: !2, line: 189, column: 2)
!948 = !DILocation(line: 189, scope: !947)
!949 = !DILocation(line: 589, scope: !950, inlinedAt: !948)
!950 = distinct !DISubprogram(name: "index_for", linkageName: "index_for", scope: !2, file: !2, line: 587, scopeLine: 587, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736)
!951 = !DILocation(line: 191, scope: !952)
!952 = distinct !DILexicalBlock(scope: !947, file: !2, line: 190, column: 2)
!953 = !DILocation(line: 93, scope: !954, inlinedAt: !951)
!954 = distinct !DISubprogram(name: "equals", linkageName: "equals", scope: !932, file: !932, line: 83, scopeLine: 83, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736)
!955 = !DILocation(line: 193, scope: !934)
!956 = distinct !DISubprogram(name: "get", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.get", scope: !2, file: !2, line: 219, type: !957, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!957 = !DISubroutineType(types: !958)
!958 = !{!911, !823, !742, !37}
!959 = !DILocation(line: 220, scope: !956)
!960 = !DILocalVariable(name: "map", arg: 1, scope: !956, file: !2, line: 219, type: !742)
!961 = !DILocation(line: 219, scope: !956)
!962 = !DILocalVariable(name: "key", arg: 2, scope: !956, file: !2, line: 219, type: !36)
!963 = !DILocation(line: 221, scope: !956)
!964 = distinct !DISubprogram(name: "has_key", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.has_key", scope: !2, file: !2, line: 224, type: !965, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!965 = !DISubroutineType(types: !966)
!966 = !{!11, !742, !37}
!967 = !DILocation(line: 225, scope: !964)
!968 = !DILocalVariable(name: "map", arg: 1, scope: !964, file: !2, line: 224, type: !742)
!969 = !DILocation(line: 224, scope: !964)
!970 = !DILocalVariable(name: "key", arg: 2, scope: !964, file: !2, line: 224, type: !36)
!971 = !DILocation(line: 434, scope: !972, inlinedAt: !973)
!972 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !922, file: !922, line: 432, scopeLine: 432, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736)
!973 = !DILocation(line: 226, scope: !964)
!974 = !DILocation(line: 435, scope: !972, inlinedAt: !973)
!975 = distinct !DISubprogram(name: "set", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.set", scope: !2, file: !2, line: 229, type: !976, scopeLine: 229, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!976 = !DISubroutineType(types: !977)
!977 = !{!11, !742, !37, !48}
!978 = !DILocation(line: 230, scope: !975)
!979 = !DILocalVariable(name: "map", arg: 1, scope: !975, file: !2, line: 229, type: !742)
!980 = !DILocation(line: 229, scope: !975)
!981 = !DILocalVariable(name: "key", arg: 2, scope: !975, file: !2, line: 229, type: !36)
!982 = !DILocalVariable(name: "value", arg: 3, scope: !975, file: !2, line: 229, type: !47)
!983 = !DILocation(line: 232, scope: !984)
!984 = distinct !DILexicalBlock(scope: !975, file: !2, line: 232, column: 5)
!985 = !DILocation(line: 234, scope: !984)
!986 = !DILocation(line: 235, scope: !987)
!987 = distinct !DILexicalBlock(scope: !984, file: !2, line: 235, column: 10)
!988 = !DILocation(line: 43, scope: !987)
!989 = !DILocation(line: 236, scope: !984)
!990 = !DILocation(line: 237, scope: !991)
!991 = distinct !DILexicalBlock(scope: !984, file: !2, line: 237, column: 10)
!992 = !DILocation(line: 59, scope: !991)
!993 = !DILocation(line: 239, scope: !994)
!994 = distinct !DILexicalBlock(scope: !984, file: !2, line: 239, column: 7)
!995 = !DILocalVariable(name: "hash", scope: !975, file: !2, line: 241, type: !3, align: 4)
!996 = !DILocation(line: 241, scope: !975)
!997 = !DILocation(line: 568, scope: !998, inlinedAt: !996)
!998 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !922, file: !922, line: 568, scopeLine: 568, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736)
!999 = !DILocalVariable(name: "index", scope: !975, file: !2, line: 242, type: !3, align: 4)
!1000 = !DILocation(line: 242, scope: !975)
!1001 = !DILocation(line: 589, scope: !1002, inlinedAt: !1000)
!1002 = distinct !DISubprogram(name: "index_for", linkageName: "index_for", scope: !2, file: !2, line: 587, scopeLine: 587, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736)
!1003 = !DILocalVariable(name: "e", scope: !1004, file: !2, line: 243, type: !31, align: 8)
!1004 = distinct !DILexicalBlock(scope: !975, file: !2, line: 243, column: 2)
!1005 = !DILocation(line: 243, scope: !1004)
!1006 = !DILocation(line: 245, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1004, file: !2, line: 244, column: 2)
!1008 = !DILocation(line: 93, scope: !1009, inlinedAt: !1006)
!1009 = distinct !DISubprogram(name: "equals", linkageName: "equals", scope: !932, file: !932, line: 83, scopeLine: 83, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !736)
!1010 = !DILocation(line: 247, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1007, file: !2, line: 246, column: 3)
!1012 = !DILocation(line: 248, scope: !1011)
!1013 = !DILocation(line: 251, scope: !975)
!1014 = !DILocation(line: 252, scope: !975)
!1015 = distinct !DISubprogram(name: "remove", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.remove", scope: !2, file: !2, line: 255, type: !1016, scopeLine: 255, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!911, !19, !742, !37}
!1018 = !DILocation(line: 256, scope: !1015)
!1019 = !DILocalVariable(name: "map", arg: 1, scope: !1015, file: !2, line: 255, type: !742)
!1020 = !DILocation(line: 255, scope: !1015)
!1021 = !DILocalVariable(name: "key", arg: 2, scope: !1015, file: !2, line: 255, type: !36)
!1022 = !DILocation(line: 257, scope: !1015)
!1023 = distinct !DISubprogram(name: "clear", linkageName: "std_collections_map$String$p$cforms.MenuItem$.HashMap.clear", scope: !2, file: !2, line: 260, type: !1024, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !736, retainedNodes: !743)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{null, !742}
!1026 = !DILocation(line: 261, scope: !1023)
!1027 = !DILocalVariable(name: "map", arg: 1, scope: !1023, file: !2, line: 260, type: !742)
